[
  {
    "teamName": "Arizona Cardinals",
    "year": 2011,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Arizona Cardinals had a nice draft, which included them picking who they thought was the best player available for the first two rounds, which is a strategy I endorse. In round one, the Cardinals got the best player in the draft. Patrick Peterson is an absolute stud on defense and special teams; four teams will be kicking themselves for letting him go by. They picked up Ryan Williams, who some thought was the best RB in the class, and they also addressed their TE problem with Robert Housler in round three, who was a nice pickup. Good job by Arizona throughout.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2011,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Atlanta Falcons went all in for Julio Jones in round one, giving up two first round picks, two fourth round picks and a second round pick. Normally, I would like a move like this for a team on the brink of Super Bowl contention like Atlanta, but as far as I'm concerned they didn't even address a need here. Which is very bad, since they mortgaged two drafts to get their man. Jones should be great, but Atlanta needed impact players on defense not offense. Luckily, a steal of Akeem Dent in round three bumps up their grade a tiny bit, but I still think the Atlanta Falcons are losers this year.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Baltimore Ravens got an absolute steal in round one with Jimmy Smith. Originally considered a top 10 pick, Smith fell due to character concerns, which the Ravens no longer have to worry about because he was just drafted into one of the strongest locker rooms in the NFL. Corner was a huge need for Baltimore, and I think they got one of the best picks of the first round. Then in round two, they picked up a burner wide receiver (which they needed as well) in Torrey Smith, and they got their replacement for Jared Gaither when they stole Jah Reid in round three. Great job by the Ravens as always.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Buffalo Bills got an official anchor to their defense when they picked up stud defensive tackle Marcell Dareus in round one, then they picked corner back Aaron Williams in round two, a guy who most saw as a first round prospect. In the thrid round, they picked up a steal by getting LSU ILB Kelvin Sheppard. Good draft by Buffalo; they got good value every time they picked early.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2011,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They could have gone a number of ways, but the Carolina Panthers wanted Cam Newton, and that's who they got. He's got boom or bust potential, and when you're as bad as Carolina, sometimes it's worth the chance. In round three, they stole Terrell McClain and reached for Sione Fua, so I guess that evens out. Overall, this is a tough draft class to evaluate for Carolina at this moment. We won't know for sure until we see what happens with Cam Newton, but for now, it's just a B.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2011,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "You have to like what the Bears did this year in the draft. First, they were lucky enough to have Gabe Carimi fall to them at 29 so they could address their desperate need for an offensive lineman. Then, they moved up the board in the second round to make one of the best picks of day two by getting Steven Paea to replace Tommiw Harris. The Bears definitely got better with this draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I love what the Bengals did this year in the draft. They used their first round pick to get the draft's best offensive player in A.J Green. Green is an absolute stud. Then they made a courageous move by standing pat in round two, and it paid off, as Andy Dalton fell right into their laps. The Bengals are re-inventing this offense with Dalton and Green taking over for Palmer and OchoCinco. With Jermaine Gresham, A.J Green and Jordan Shipley, Andy Dalton should be primed for success.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Browns started their draft off with a bang as they completely fleeced the Alanta Falcons for the sixth overall pick, and Cleveland picked up five picks for it, including two firsts. Then they moved back up the first round and got Baylor DT Phil Taylor, who figures to be a good NFL player. In round two, they picked up Pitt defensive end Jabaal Sheard, who I like a lot. The Browns' best move was that trade with Atlanta, but they picked up two or three starters in this draft as well. Great job.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Dallas definitely didn't have a bad draft this year, but I don't believe it was a great one either. Tyron Smith should be a starter in the NFL, but he'll never be elite, which is what you look for at ninth overall. Still, he fills a need, so Cowboy fans should be content with that pick. They also brought in UNC OLB Bruce Carter, who should be groomed into a great rush-linebacker by DeMarcus Ware. Solid draft for Dallas overall, but not spectacular.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Broncos made the right choice when they picked Von Miller second overall; the kid is an absolute stud. In round two, they got the draft's very best safety in Rahim Moore, another great pick. One pick later, they got offensive guard Orlando Franklin, who also has a future as a starter in this league. They even picked up Nate Irving, who was a good value in round three. Nice job by the Broncos this year.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2011,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Detroit Lions had a great, great draft. In the first round, they stole Nick Fairley with the 13th overall pick and can now put him next to Ndamukong Suh to make sure the Lions will have the league's best defensive line for the next 10 years. But the Lions weren't done after that. In round two, they got speedy receiver Titus Young, who should draw double teams away from Calvin Johnson, and later that round, they picked up the second best running back in the draft in Mikel Leshoure. They didn't address some of their needs, but it doesn't matter; the Lions were winners in this year's draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Coming into this draft, you could make an argument that the Green Bay Packers did not really have a need. So what they did was pick prospects that intrigued them. They picked up Derek Sherrod in round one, who should be a starter sometime in the next three to four seasons. Then they made a great pick in round two by picking up the versatile Randall Cobb. Cobb has been compared to Percy Harvin because he's not just a wide receiver; he's also a kick returner, running back and wildcat quarterback. Great pick for Green Bay. In round three, they got a good third round running back in Alexander Green. Their biggest steal may be sixth round pick Ricky Elmore, who could be a great a pass-rusher in the league. For more on Elmore and all the Packers picks, click here.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2011,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "It was a great draft for the Houston Texans this year. In round one, they picked up J.J Watt, who is a great player and a high-effort, high-character guy. That was a good pick, but where the Texans really left their mark was on Day 2. They committed theft when they got Brooks Reed midway through round two. Reed has been compared to Clay Matthews, and the fact he fell out of the first round was a shock, let alone all the way to Houston at 42. Later in round two, Houston made another steal on a first round prospect who fell in Brandon Harris, which was an especially good pick when you consider how bad their secondary was last season. Houston went into this draft needing to improve their pass defense, and they got three immediate starters early who can help do that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I love the Colts draft this year. They got good value for Anthony Castonzo in round one, which is especially great for the Colts, because it didn't matter who was on the board when they picked; they were going O-Line. They desperately needed to re-vamp at the offensive tackle position, and they got two future starters. Great job.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2011,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "If you had asked me before the draft which team I thought was least likely to trade up in the first round, I would have said the Jacksonville Jaguars. They're a team that loves to play it safe, but this year, they decided to live on the edge. I'm not so sure I like what they did though. I personally think Blaine Gabbert will wind up being a bust, but I've been wrong before. The Jags also picked up a good offensive guard prospect in William Rackley in round two. Still, I don't like Gabbert much.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2011,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "I had the Kansas City Chiefs listed as losers after day one, but a great Day 2 may have just saved their draft. The Chiefs traded down in the first round rather than taking DT Phil Taylor, who I thought would have been a great fit for them. I still would have been okay with them trading down, but they used their first round pick on Jonathan Baldwin, who they could have had in round two had they traded down with a team looking for a quarterback like the Bengals. But rather than working the phones, KC rushed their pick to try and beat the Ravens, who exceeded the time limit, which was stupid, because it's unlikely the Ravens had their eyes on Baldwin anyway. But grabbing center Rodney Hudson (who will be a starter for them soon enough) in round two and first-round talent Justin Houston in round three saved their draft. Overall, KC didn't do too bad for themselves.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I don't like the selection of Mike Pouncey in the first round, but I don't hate it either. Pouncey isn't as good as his brother. I think he'll be a solid interior lineman but not a great one, and Mark Ingram would have been a better pick. Luckily, though, the Dolphins also had a pretty good day 2, picking up underrated running back Daniel Thomas and solid wide receiver Edmond Gates. Not a horrible draft for Miami, but not a great one either.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2011,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Vikings made the reach of the draft when they picked Christian Ponder 12th overall with players like Prince Amukamara and Nick Fairley still on the board. I understand they tried and failed to trade down from 12, but there was no reason to take Ponder that high with all the big names still available. They made up for it a little bit when they got Kyle Rudolph in round two, but that wasn't enough to make up for the Ponder blunder.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2011,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "I'm highly unimpressed with the Patriots draft this year. They reached for Nate Solder in round one when Anthony Castonzo and Gabe Carimi were both still on the board. Then,  they chose corner Ras-I Dowling in round two instead of a pass-rusher  like Brooks Reed when they desperately needed a pass-rusher. The  Pats also passed on Cameron Jordan in round one, wasted second and third  round picks on bottom of the depth chart running backs, and then made  their best pick of the draft, which is saying a lot considering all they  got was a back-up QB. The only think keeping the Pats from an even lower grade is that they picked up a first and second round pick for next year.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2011,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "I thought the New York Giants had an outstanding draft this year. Their first pick was one of the biggest steals of the draft when they got Prince Amukamara at 19 overall. Amukamara should give the Giants the shutdown corner that they've coveted for so long. Then they picked up UNC DT Marvin Austin in the second round, who had first round talent but fell due to character concerns. Tom Coughlin won't put up with that. I think he'll turn into another steal for New York. In the fourth round, I thought the Giants made another great pick by getting Indiana offensive tackle James Brewer.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I loved the Jets first round pick; unfortunately for them, it was the only pick they made that I really liked. They got Muhammad Wilkerson in round one, who I think will make an immediate impact for the Jets. In five years, he may be the only player left from this draft still on the team. Also, just to note, I like Greg McElroy and think he'll be a solid NFL QB, but I don't think he'll still be on the Jets in three years. It was a good pick though.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2011,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Saints are one of the biggest winners of this year's draft. In the first round, they completed grand-theft of top-10 player Cameron Jordan and then did it again for former Heisman Trophy winner Mark Ingram. Both will be outstanding pros. And the Saints weren't done after day one either. On Day 2, they picked up two more solid prospects in Martez Wilson and Johnny Patrick. Great draft for the Saints.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2011,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Raiders had an up-and-down draft. They didn't pick until the second round, and they used their pick to grab Stefen Wisniewski, who they definitely reached for. But I still think he'll be a decent player. Next the Raiders made their annual \"pick a guy who runs a fast 40-yard dash but can't play football\" pick when they used their third round selection on Demarcus Van Dyke. They also made a bizarre trade with the Patriots where they traded their second round pick next year for the Patriots third and fourth this year about 10 picks before New England was even on the clock. With their second pick in the fourth round, the Raiders got speedy running back Taiwan Jones in what could one day be considered a steal. Overall, not bad by Al Davis standards.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "It wasn't a bad draft for the Eagles this year, but it was by no means a great one either. They reached a bit for Danny Watkins in round one, but I don't mind it, because I think he'll be a good starter for a team that needs o-line help right now. They got safety Jaiquawn Jarrett in the second round, who should be a good fit for them. I also love what they did in round four. They picked up Casey Matthews, who has great NFL player inscribed in his genes, and they got the best kicker available (Alex Henery.). Sure they reached for Henery, but I love the boldness here, I think he'll be a great kicker, and as they learned when they played the Packers in the playoffs last season, that's pretty damn valuable. They didn't get a corner that can come in and start right now, but expect them to be in play for Nnamdi Asomugha.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "As far as I'm concerned, the Pittsburgh Steelers had a decent, but unspectacular, draft. In round one, they got a fringe first round defensive end in Cameron Heyward. In round two, the Steelers got a fring second round offensive lineman. You see where I'm going with this. Good draft for Pittsburgh, but not great.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The happiest man in America right now has to be Sam Bradford. After throwing to a bunch of bums last season, he now has some new weapons to play with. He's got a tight end and two wide receivers who will probably play for the Rams in some capacity from day one. Not to mention St. Louis got a steal when Robert Quinn fell to them in round one. The Rams are getting better.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Chargers had a decent draft, but I'm not crazy about it. In the first round, they picked Corey Liuget rather than Cameron Jordan or Muhammad Wilkerson, who to me were both better. Still, Liuget should be an impact player. Then they picked up corner back Marcus Gilchrist in round two rather than Brandon Harris, who to me will be better. But Gilchrist wasn't a bad pick. Overall, the Chargers got a lot of good players from this draft, but it's not the draft that's going to finally put them in the Super Bowl either.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The San Francisco 49ers shocked a lot of people when they made Missouri's Aldon Smith their first round pick rather than Blaine Gabbert. I like the pick of Smith. I think he'll really be a good NFL player, and he gives a pass-rusher to a 49er team that desperately needed one. I also like their aggressiveness to trade up in the second round and get their future QB in Colin Kaepernick. They don't need to throw him to the dogs as a rookie like they did to Alex Smith, because he can wait and develop as a backup for a few years. I think Kaepernick will be a pretty good NFL QB, especially considering he gets to throw to Michael Crabtree and Vernon Davis.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2011,
    "grade": "F",
    "gradeNumeric": 0,
    "text": "The Seattle Seahawks' first round pick of James Carpenter was the most baffling of the draft. Carpenter was a late-second round to early-third round prospect and Derek Sherrod was still available. There is nothing you can say to convince me that was a good pick. Then with their next pick they ignored needs at quarterback and defensive tackle again to select Wisconsin offensive guard John Moffitt. Moffitt was their best pick of the draft, which says a lot when you consider it wasn't a good pick to begin with. Horrible, horrible draft for the Seahawks.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2011,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Bucs took two huge chances with their first two picks this year. They picked up Adrian Clayborn and Da'Quan Bowers way below market value (both were at one time projected top 10 picks), but both could lose their careers to injuries. They both have health problems, and while they could easily combine to make one of the league's most feared pass-rushing duos for years to come, they could also both wind up being wasted picks. With that being said, I think these are two guys that were worth the risk (especially Bowers that late.) The Buccaneers got good value all draft long; good for them.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2011,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "I liked the Titans draft a lot this year. Many people will say they reached for Jake Locker, and while that may be true, nobody will be saying that in five years when he's the best quarterback in this class. And if they reached for Locker, then they definitely made up for it by stealing UCLA OLB Akeem Ayers in round two. I love Ayers. Tennessee also got a nice defensive tackle in round three when they picked up Jurrell Casey. This was a good draft for the Titans, who should be a sleeper playoff team next season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2011,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "It was a pretty solid draft for the Redskins this year. However, I'm not a huge fan of the fact that the Redskins didn't go out and get any of the top quarterbacks available, because they did have a chance. They never really even seemed interested in a quarterback which I thought was a little odd. I do like their first round pick of Ryan Kerrigan, though. I also like Jarvis Jenkins and Leonard Hankerson, which is why the Redskins still get a B+ here despite not drafting a respectable quarterback.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/684372-2011-nfl-draft-grades-final-report-cards-and-results-for-all-32-teams",
    "playerGrades": []
  }
]