[
  {
    "teamName": "Arizona Cardinals",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Cardinals did a good job playing it safe here by grabbing the player Larry Fitzgerald wanted (Michael Floyd), drafting an underrated cornerback who had fallen down the board (Jamell Fleming) and then picking up a great athlete at left tackle who just needs some seasoning (Bobby Massie). Their draft class is weak on top-end talent due to the Kevin Kolb trade, but Arizona made the best of what it had available. Don't sleep on late-rounder Nate Potter—when healthy, he has good potential to be a left tackle starter.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "With no first-round pick due to the Julio Jones trade, the Atlanta Falcons weren't in a great position to get an impact player early on, but they did anyway with Peter Konz. The top-rated center on my board, Konz will likely slide to guard in Atlanta. The Falcons played it smart elsewhere by getting intelligent, tough football players in Holmes, Ewing and Massaquoi.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Ravens always do a good job playing the board, and by trading back in Round 1, they set themselves up for 2013 while still getting a potential star player in Courtney Upshaw. He'll be an immediate contributor at outside linebacker. Kelechi Osemele is athletic enough to play guard or tackle and could fill the need created when Ben Grubbs left for Baltimore. Pierce, Gradkowski and Thompson are solid, tough players who will all fill roles as depth players.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "A great draft by the Buffalo Bills in 2012. The selection of Stephon Gilmore is a classic example of not overthinking your pick. He has shutdown corner ability and will instantly upgrade the secondary. Cordy Glenn could be a sleeper at left tackle, and at worst case he's a long-term starter on the right side. T.J. Graham and Ron Brooks are nice depth players who can play on third down and special teams. Same goes for Carder and Bradham, two future starters with good upside. The sleeper may be Zebrie Sanders, a guy who could be a surprise star at right tackle down the road.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2012,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "While I'm not a big fan of Luke Kuechly in the first round over a defensive tackle, the pick is easy to explain. He can play any position at linebacker and will make injuries to Jon Beason and Thomas Davis in 2011 easier to come back from. Silatolu is a sleeper at guard, and someone I had pegged as a late first-rounder. He's a great pickup there for the Panthers to protect Cam Newton. Frank Alexander is a bit of a reach, and the team still hasn't addressed their need for a defensive tackle. Joe Adams and Josh Norman were good sleeper picks who could contribute on third down right away.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Bears nailed it in Rounds 1 and 2 when they grabbed Shea McClellin to line up opposite Julius Peppers and my No. 1 wide receiver, Alshon Jeffery. Phil Emery did a great job in his first draft. The pick of Brandon Hardin is a little confusing, as they have Major Wright, Chris Conte and Craig Steltz ahead of him on the depth chart. Evan Rodriguez is incredibly versatile at fullback/tight end/wide receiver. He'll be a surprise playmaker for Jay Cutler.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2012,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "While I'm not a huge fan of Dre Kirkpatrick this early—and they technically passed on David DeCastro to get Kevin Zeitler—the rest of this draft is amazing. The Bengals filled needs for the present and future, drafting tough competitors who have played at high levels on major stages in college football. Still, Sanu, Thompson, Charles, Prater, Jones and Iloka are all steals in their draft slots. Best draft of the 2012 class? The early grade goes to Cincinnati.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The selection of Trent Richardson—even trading up to get him—was one of the best of the draft. The selection of Brandon Weeden? Not so much. Especially in Round 1. Weeden is a good quarterback prospect, but he's 28 years old and will turn 29 in October. He's the oldest player drafted in the first round since the NFL-AFL merger. Cleveland could have sat on him until Round 2. Mitchell Schwartz was a great pick—he's a day-one starter at right tackle—but the John Hughes selection was another major head-scratcher.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Trading up for Morris Claiborne was pure brilliance. He's a lockdown cornerback who will instantly make their defense better. Claiborne and Brandon Carr will be a dangerous one-two punch. Kyle Wilber is one of my favorite 'tweeners in this year's class. He's a guy who could steal major playing time from Anthony Spencer at outside linebacker this year. Same for Tyrone Crawford, who will challenge for playing time at defensive end in the 3-4 defense.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2012,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Broncos did the right thing by filling needs early, but I'm not a fan of the players chosen. Derek Wolfe over Devon Still and Jerel Worthy? Brock Osweiler over Kirk Cousins and Ronnie Hillman over Lamar Miller? The Broncos' draft board was clearly stacked different from the rest of the NFL's. Denver gets a \"C\" for filling needs without getting high-level players at those positions.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Detroit Lions do a good job staying true to their board, but this year they did so in a way that addresses their top five needs without straying from good value. Reiff is a 12-year starter at tackle and will make Jeff Backus' age a non-factor moving forward. Ryan Broyles is a very good slot receiver who will draw safeties up in the box and off Calvin Johnson. Dwight Bentley may be a small-school guy, but he has great potential to jump up and be a starter. Pick by pick, the Lions made great calls in every round.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2012,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Once again, the Green Bay Packers own the NFL draft. Ted Thompson was on his game this weekend, nabbing great values and finding players who will attack the needs on this depth chart. Nick Perry is one of the steals of the draft at No. 28 overall. Same for Jerel Worthy and Casey Hayward in the second round. Day 3 filled the roster out with good depth players who have nice special teams potential. Notable is Andrew Datko. A preseason 2011 first-rounder, Datko has missed major time with injury but has great upside.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2012,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "In 2011, the Texans' draft order seemed to be a bit backwards when they chose J.J. Watt over needs at outside linebacker and cornerback. It turns out they nailed it, so take my 2012 criticism with a grain of salt. Outside linebacker in Round 1 is questionable as Connor Barwin and Brooks Reed were great in '11. Trading out of Round 2 made sense, but drafting the 343-pound Brandon Brooks for a zone-blocking scheme doesn't make sense. The saving grace came in Round 4—Ben Jones and Jared Crick will both be starters for a long time in the NFL.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2012,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Not only did the Indianapolis Colts draft the best player in this year's class, they drafted the two best tight ends and my No. 2-ranked nose tackle. A pretty good day, overall. Chuck Pagano and Ryan Grigson are winning the draft so far, finding really solid players who will come in and help set the tone for the locker room in Indianapolis. A smart, safe draft highlighted with tough players at key positions.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2012,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "The only pick worth liking here is the one of Andre Branch in Round 2. Sure, Justin Blackmon is a solid wideout prospect, but trading up for a receiver who lacks dynamic size, can't run away from defenders and drops passes over the middle is a bad fit. To top it all off, Jacksonville drafted a punter in Round 3. Yep, a punter. It's a forehead-slapping day in Jacksonville.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Dontari Poe may prove to be a reach at No. 11 overall, but he's filling a need and will round out the Kansas City defensive line. It's a pick you could argue for based on his athletic potential. The picks outside of Round 1 were all very good. Allen and Stephenson will push for playing time on the offensive line, and at least Allen will be a starter soon. Wylie and Menzie were two of my favorite slot players in the class, with Menzie my top-rated slot cornerback. The Day 3 selections were all very solid in Kansas City.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2012,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Other than that reach for Ryan Tannehill in Round 1, Miami did a really good job of managing this draft. Jonathan Martin will step in immediately at right tackle, fixing the revolving door at right tackle. Vernon is a potential starter at defensive end opposite Cameron Wake. Michael Egnew is a good flexed-out tight end. The steal of the class for Miami was speedster running back Lamar Miller in Round 4. With Reggie Bush in a contract year, Miller's presence could be huge.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2012,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Vikings did a good job up front with Matt Kalil, Harrison Smith and even Josh Robinson as a potential shutdown cornerback. On Day 3 they did well grabbing depth/special teams guys who can contribute early on in multiple roles. Their Round 4 skill players are all worthy contributors. Minnesota did a great job loading up their roster to support Christian Ponder in this draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The lack of picks on Day 3 may hurt the New England Patriots' overall depth, but it's hard to argue with their all-out approach to improving their defense in the early rounds of the 2012 class. Chandler Jones, Dont'a Hightower and Jake Bequette could start as rookies. All three are big, tough football players who will pack a punch in the 3-4 defense. The lone head-scratcher is Tavon Wilson at safety. He was a cornerback at Illinois who wasn't ranked in my top 300 players. Alfonzo Dennard fell due to poor speed and poor off-field decisions, but he could be a sleeper in Round 7.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2012,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Grading New Orleans only on the picks it has—not penalizing it for picks lost—the Saints did a good job of finding value. Akiem Hicks is incredibly raw coming out of Canada, but his size and explosiveness are hard to find. Nick Toon was one of my favorite receivers when healthy, and he impressed with a good pro day showing. The underlying theme will be that New Orleans didn't have many picks, but it did well on what it had available.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Going with David Wilson to end the first round didn't address a major need, but he's a nice complementary back to work with Ahmad Bradshaw. His speed will be an asset on the outside. Same with Rueben Randle, who is a big target on the edge. If Randle works out, he could keep Victor Cruz in the slot where he's most effective. Jayron Hosley was a little overrated by the media, but his speed and hard-nosed mentality on the outside will be a welcome addition in replacing Aaron Ross. Brandon Mosley is a guy who could eventually be a starter at right tackle. Keep an eye on him.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2012,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Quinton Coples is a question mark in Round 1 due to his lack of work ethic, which may not be the best fit in the Jets' circus-like environment. I really like the move up and to get Stephen Hill in Round 2—he's a super-fast wide receiver who could explode with a little seasoning before he's unleashed. Hill was a late first-rounder on a lot of boards. Demario Davis is another pick that makes good sense for the Jets on the outside, where they badly need a pass rush. The big issue here is that with so many holes on the roster—and there are many—the Jets moved around and didn't get many depth players until the end of the draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2012,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Reggie McKenzie was handcuffed by previous trades to add Carson Palmer and Richard Seymour, and then the supplemental draft pick of Terrelle Pryor. In his first draft, it's hard to argue with what McKenzie did. The Raiders went after tough guys who didn't bring great athletic ability but are hard-nosed competitors. Bergstrom and Crawford will be looked at as starting-caliber players. Criner is the physical possession-style receiver the team needs to pair with their athletic roster.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Eagles' top five picks hold up against any team's draft class this year. Andy Reid and Co. looked at their needs and did a methodical job of collecting value players at each spot. They filled out their defense in the first two rounds and then found a developmental quarterback to groom behind Michael Vick. One potential sleeper is Brandon Boykin. If healthy, he could be a starter. In Round 6, Philadelphia hit two big-name college players, Marvin McNutt and Brandon Washington. Both could easily outplay their draft stock.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2012,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "For years people have complained that the Pittsburgh Steelers don't take drafting offensive linemen seriously enough. They changed that perception in 2012 by drafting two starters in the first two rounds, solidifying their offensive line with Maurkice Pouncey and Marcus Gilbert already in place. Pittsburgh could look to go back to a run-first offense with these selections, but it went back to defense in Rounds 3 and 4 when it found a ball-hawking linebacker in Sean Spence and a huge nose tackle with great upside in Alameda Ta'amu. Ho-hum...just another great draft for the Pittsburgh Steelers.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2012,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "It's hard to argue with reloading their defense with their first three picks. Ingram, Reyes and Taylor are all big hitters who will help close the gap in the AFC West. Ingram and Reyes will be penciled in as starters, with Jarret Johnson possibly playing more inside. Taylor, if paired with Eric Weddle, has room to grow into an elite player. Ladarius Green has great athletic ability and tons of potential to become a No. 1 tight end once Antonio Gates moves on. David Molk is a very strong center prospect who is just a bit undersized but could impress.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2012,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The San Francisco 49ers have made some questionable moves that may make more sense once training camp begins, but at least on paper, they're somewhat odd. A.J. Jenkins is a great slot receiver option with deadly speed, but he's more of a situational player. Same for LaMichael James, who is a third-down running back and returner. The Day 3 picks are more solid, but Rounds 1 and 2 hurt the 49ers' overall grade. If nothing else, the 49ers added a ton of speed and explosive players.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2012,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "The Seahawks received our lowest Round 1 grade for their reach to grab Bruce Irvin at No. 15 overall. They messed up again in Round 3 with Russell Wilson after having signed Matt Flynn this offseason. Neither pick makes much sense to us. Bobby Wagner and Robert Turbin saved the Seattle draft, but two of its first three picks were just bad.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "This is a classic Jeff Fisher draft. The Rams got a tough defensive tackle and backed it up with two raw receivers and a top-15 player who fell due to character concerns. The Rams' first seven picks were all textbook team-building choices. When you look at the second- through fourth-round picks, St. Louis has built the backbone of its roster with skill players on each side of the ball. Without reaching for talent, Fisher has loaded up his roster.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2012,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Drafting Mark Barron still doesn't sit well with me, but he's a hard-nosed football player who will separate the ball from receivers over the middle and at least they traded down two spots for him. Barron's not a playmaker though, so the feeling is he was overdrafted a bit. Doug Martin and Lavonte David are two of my favorites in this class, and both are great fits for the Tampa mentality. Same with fifth-rounder Najee Goode. He's a downhill, attacking linebacker who can make plays.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2012,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Titans had another draft similar to their 2011 class—they added tough players who succeeded at major universities with big-time experience. Kendall Wright, Zach Brown, Mike Martin and Markelle Martin all excelled on big stages and will be big-time producers for the Titans. The early impact of their first three picks should be huge. All three are great athletes at their positions—Martin is a former wrestler—who will help improve the overall talent level in Tennessee.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2012,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Their first pick gets an A+. Their third pick gets an F. Why the Redskins would draft two quarterbacks in their first four selections is beyond me. Josh Leribeus and Adam Gettis have big potential at guard and will bolster a poorly built interior offensive line in Washington. Keep an eye on Keenan Robinson and Alfred Morris. Both could surprise people with big playing time in 2012.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1163416-2012-nfl-draft-grades-full-draft-results-report-card",
    "playerGrades": []
  }
]