[
  {
    "teamName": "Arizona Cardinals",
    "year": 2013,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Arizona Cardinals wasted no time addressing what was one of the worst offensive lines in football last season. Strong, athletic No. 7 overall pick Jonathan Cooper will be one of the best guards in the NFL from Day 1, and fourth-round pick Earl Watford should have every opportunity to start at the other guard spot. Inside linebacker Kevin Minter represented good value at No. 45, while defensive end Alex Okafor was a steal in the early fourth round. Whether Okafor has the bulk to play end in the Cardinals' 3-4, though, remains to be seen. The Cardinals also picked up a pair of running backs, Stepfan Taylor and Andre Ellington, who should compete to push free-agent signee Rashard Mendenhall right away. Ellington, particularly, was good value. Receiver Ryan Swope was another explosive, productive college football player who slid further than he should have. I would have preferred to see the Cardinals snag one of the many talented developmental quarterbacks late to develop behind Carson Palmer and Drew Stanton. Additionally, the writing is on the wall for Darnell Dockett and his relationship with the team; a Jordan Hill or Brandon Williams in the third would have made more sense than drafting troubled nickel corner Tyrann Mathieu to play safety.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2013,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Falcons lost cornerback Brent Grimes to free agency, but the back-to-back picks of Desmond Trufant and Robert Alford more than addressed the vacancy. Trufant's talent and physicality should mean a quick transition to the NFL, while Alford will have the time and space to apply his athleticism in the pros. The Falcons have one of the most balanced rosters in the NFL; they had the luxury of taking almost any player. Still, they could have used a pass-rusher or two along the defensive line. Fourth-round defensive end Malliciah Goodman is a size/power-rusher and not the terrifying edge-rusher the Falcons needed. Fifth-round pick Stansly Maponga is a more traditional 4-3 end, but he likely doesn't have the tools to make an impact. Finally, seventh-round picks are usually \"best available\" grab bags, and Kemal Ishmael, Zeke Motta and Sean Renfree will be lucky to crack this roster.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2013,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Ravens needed to replace the departed heart and soul of the team, inside linebacker Ray Lewis. They also needed to replace his named heir, Dannell Ellerbe, who surprisingly left via free agency. The first player the Ravens replaced, though, was safety Ed Reed, and they did so emphatically with first-round pick Matt Elam. The consensus second-best safety in the draft, Elam and his physical style were probably the best fit for the Ravens. The Ravens had their presumed first-round pick, linebacker Arthur Brown, fall to them in Round 2. They nabbed Haloti Ngata's successor inside, 335-pound Brandon Williams. The team continued to get impact front-seven players with defensive end John Simon of Ohio State in the fourth round. One of the few teams that knows how to utilize a true fullback, the Ravens took the first off the board in Kyle Juszczyk, and they went with the best player available the rest of the way. Seventh-round pick Aaron Mellette hails from a tiny school, Elon, but his 6'2\", 217-pound frame makes him a big, big value so late in the draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2013,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "This Buffalo Bills' draft class hinges entirely on the success—or failure—of No. 16 overall pick EJ Manuel. The Florida State quarterback was shockingly picked before several more highly touted quarterbacks. He might even have been considered a reach as the Bills' second-round pick at No. 41 overall. That pick was spent much more savvily on polished, productive pass-catcher Robert Woods. Woods tore up USC his sophomore season. Despite being overshadowed by the sublime Marqise Lee in his junior year, he proved he has professional-caliber talent and skills. Kiko Alonso adds athleticism to an already young inside linebacker corps. With Marquise Goodwin, Buffalo wisely doubled down on getting Manuel playmakers downfield. With veteran safety George Wilson gone, the Bills picked up two mid-round successors in Duke Williams and Jonathan Meeks. Adding a kicker with a sixth-round pick was a smart move, and tight end Chris Gragg is a converted receiver with the kind of mismatch speed that's never available in the seventh round. This was a very solid draft, except for the part where they took the consensus fourth- or fifth-best quarterback prospect 23 picks before the consensus No. 1 went in the second round.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2013,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Carolina Panthers only had five picks to work with, but they made several of them work. Star Lotulelei, who likely would have propelled himself into the top three with a great combine performance, was held out for what turned out to be a medical non-issue. Between Lotulelei and underrated Purdue run-stopper Kawann Short, the Panthers added tremendous size and strength in the middle of the line, taking pressure off their ends and linebackers. Edmund Kugbila, however, was a massive reach for need. He likely would have been available in the fifth, or even sixth, for the Panthers. That said, underrated Oregon playmaker Kenjon Barner probably should have gone in the fourth round, swinging the needle back toward value. The Panthers didn't hurt for running backs, but Barner will find ways to make an impact.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2013,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Chicago Bears, in a way, settled two positions with their first draft pick. Athletic lineman Kyle Long could play either tackle spot or guard for the Bears. For now, he'll hold down the right side while free-agent signee Jermon Bushrod takes over Jay Cutler's blind side. If Bushrod doesn't pan out, the Bears already have his successor in hand, one whose best ball is in front of him. Long was definitely a reach from a board standpoint, but getting the right player trumps winning the consensus value board. The price for picking a tackle first was not drafting the successor to departed Bears legend Brian Urlacher—or so it seemed. By picking up Florida's Jon Bostic in the second round, the Bears got a strong inside linebacker with great lateral movement and good instincts in coverage. The Bears also added Rutgers outside linebacker Khaseem Greene, a talented outside linebacker who'll see time very quickly. Finally, the Bears got great value in the sixth round with Cornelius Washington, a big, strong defensive end with deceptive speed. If he develops, he could make a fearsome bookend pair with fellow young end Corey Wootton.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2013,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Cincinnati Bengals have never been known for their draft prowess. Typically, they make up for a skeleton scouting staff with fearlessness regarding character and medical flags. This season, though, they snagged the draft's top tight end prospect, Tyler Eifert, took the first running back off the board in Giovani Bernard and added the best all-around athlete at the combine, defensive end Margus Hunt. All of their first three picks were excellent scheme fits for their system as well. In the third round, the tide turned. Shawn Williams was not a value at No. 84 overall, nor were any of the Bengals' picks until Reid Fragel in the seventh round. The Bengals consistently reached for need through the middle and late rounds, and that sapped some of the juice out of this grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2013,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Like many drafts, especially those with less than a full complement of picks, this one comes down to the first-rounder. Whether Barkevious Mingo, a one-dimensional pass-rusher, can make this pick look good depends on whether the Browns use him wisely. Lined up on the outside across from free-agent signee Paul Kruger on passing downs, Mingo could do a lot of damage. He'll have to in order to justify the No. 6 overall pick, though. The rest of the draft is nearly an \"incomplete\" grade. San Diego State cornerback Leon McFadden could have been had much later. Cleveland traded later picks to Miami to pick up wide receiver Davone Bess. The Browns went down their shopping list and snagged needs the rest of the way, though they didn't get good value or an especially interesting prospect until No. 227, Garrett Gilkey. The 6'6\", 318-pound guard from tiny Chadron State could bubble his way up the depth chart.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2013,
    "grade": "D-",
    "gradeNumeric": 0.7,
    "text": "The first-round pick of the Dallas Cowboys, Wisconsin center Travis Frederick, was such a shocking reach he headlined Bleacher Report's compendium of the worst picks of the 2013 draft. San Diego State tight end Gavin Escobar should work out great on the field for the Cowboys, but he probably could have been had later. Terrance Williams started a run of wide receivers that included prospects with much more upside, like Keenan Allen and Markus Wheaton. Until cornerback B.W. Webb, the Cowboys failed to get any kind of value for their picks—and Webb will likely be buried on the depth chart. Sixth-round outside linebacker DeVonte Holloman, though, was a very savvy (or lucky) pick who could become quite valuable as DeMarcus Ware ages.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2013,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Denver Broncos had one of the best picks of the first round. Need, fit and value came together when 6'3\", 313-pound defensive tackle Sylvester Williams fell to the team with the No. 28 overall pick. The opposite happened in the second round, where the Broncos reached to take plodding, powerful tailback Montee Ball. It's hard to see how Ball will crack a running back committee that features Wills McGahee and Knowshon Moreno, and it's even tougher to see how he'll develop into a worthy replacement for either. The Broncos needed a young corner to groom behind Champ Bailey, so they reached for South Florida corner Kayvon Webster in the third round. Six cornerbacks came off the board between Ball and Webster, but only two running backs did. If the Broncos had drafted their corner in the second and back in the third, they would have gotten much more value. The Broncos did pick up one steal, though: Miami (OH) quarterback Zac Dysert. Dysert is a good athlete with a good arm who can throw on the run. He may not be the next Peyton Manning, but he could develop into excellent trade bait.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2013,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Lions did an outstanding job of addressing needs, but whether they got value is an open question. Physically, Ezekiel Ansah is a perfect fit for the Lions defense. At 6'5\", 271 pounds, Ansah is built like Kyle Vanden Bosch—but he has much better closing speed. Ansah is extremely raw, having played no high school and little college football. The Lions staff coached him at the Senior Bowl, but the team needs him to play like a No. 5 overall pick from Day 1. The Lions had a need at corner after not being able to count on any of the three from last year's draft. Mississippi State's Darius Slay has good size and best-in-class speed. Meanwhile, guard Larry Warford improves two positions. Not only does his 332-pound frame fill the hole the Lions have at right guard, but he prevents them from having to slide last year's first-round pick, Riley Reiff, over to fill it. Reiff will play left tackle, preserving his value. The Lions got another of their favored big defensive ends with 6'7\", 266-pound Devin Taylor in the fourth round. The team is so thin at end that Taylor will almost certainly rotate in from Day 1. The Lions needed a true outside receiver with height and speed to draw attention away from Megatron, but though sixth-round pick Corey Fuller has height and speed, he'll need a year or to to prove he has the skills. Finally, punter Sam Martin should cure the Lions' punting woes; he'll likely also take over kickoff duties from new kicker David Akers.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2013,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Green Bay Packers started the draft off with a very soft bang. That is to say, their pickup of Datone Jones didn't send shock waves through the NFL, but perhaps it should have. Jones is a perfect fit for what the Packers want to do up front. Adding tailback Eddie Lacy was an inspired choice; plugging the draft's only do-everything back into the Packers' explosive downfield offense could be lethal. If not, fourth-round choice Johnathan Franklin could step up and gash defenses in the space opened up by the passing attack. The Packers reloaded the offensive line in the fourth round with tackle David Bakhtiari and guard J.C. Tretter. They also bolstered the secondary with cornerback Micah Hyde. I like going WR/WR in the seventh; the team needs more bodies there right away and can groom starters long-term.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2013,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Houston Texans are one of a few teams this season with well-stocked rosters and more than the usual complement of picks. Many of these players will struggle to see the field just because of the depth chart. The Texans have looked for a Robin to Andre Johnson's Batman ever since they drafted Johnson. First-round pick DeAndre Hopkins will have every opportunity to put on that cape and mask. D.J. Swearinger was a solid follow-up in the second round, helping ease the pain of losing Glover Quin to free agency. Swearinger will look great next to signee Ed Reed. Tackle Brennan Williams was taken a little early at No. 89 overall, especially since he'll have to earn his way into the starting lineup. Defensive end Sam Montgomery is a great fit for the scheme, but he will also have to spend some time proving himself. The Texans missed an opportunity to get a talented young understudy for Matt Schaub; actually, they missed quite a few of them.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2013,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Indianapolis Colts made a big splash in free agency, but they were relatively quiet during the draft. They picked up an excellent all-around prospect for their still new 3-4 defense, Florida State's Bjoern Werner. Werner started the draft cycle being touted as a possible top-10 pick; his lack of terrifying speed dropped him somewhat, but he has the tools to be an outstanding 3-4 end. The Colts had to wait a while to pick up their second selection, third-round pick Hugh Thornton. Thornton was a bit of a reach, but if he solidifies the guard spot opposite new signee Donald Thomas, it's a good pick. Similar thoughts apply for center Khaled Holmes: taken a little too early, but he could help quickly. Utah State running back Kerwynn Williams will be a fan favorite; his speed and playmaking ability should be obvious right away on returns.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2013,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "It's hard to comprehend spending the No. 2 overall pick on a good young left tackle when you already have one, but that's what the Jaguars did. Unless they plan on trading Eugene Monroe, the Jaguars have taken an opportunity to add another foundational piece and used it to plan for Monroe's eventual departure. Sure, Joeckel will play right tackle just fine, but that's a huge opportunity wasted. John Cyprien was one of the early steals of the draft; he'll make an impact in new head coach Gus Bradley's defense early and often. Dwayne Gratz was a bit of a reach, but he should be a good fit for the system as well. Denard Robinson is one of the most interesting stories of the draft; a fifth-round draft pick will enter Jaguars camp with a brand-new position to learn—and his likeness on NCAA Football 14.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2013,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Kansas City Chiefs also decided to write off the future of their incumbent young veteran left tackle. Branden Albert's future with Kansas City was already murkier than Monroe's with Jacksonville, though, and Eric Fisher is a clearer upgrade over Albert than Joeckel is over Monroe. For the moment, though, both teams will have two quality tackles, and that's fine. Travis Kelce was a forgotten man in the second round; part of a thick crop of athletic tight ends, the Chiefs might have luckily landed the best one. Knile Davis in the third round was a good fit but a huge reach; there were running backs with similar tools and much fewer question marks available there. Nico Johnson, though, was a value pick at No. 99, an inside linebacker who can fortify the middle of the defense. Eric Kush was a very nice pickup in the sixth round. If he develops, he could be useful to the Chiefs sooner rather than later.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2013,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Miami Dolphins are going for it this year. The top of their draft was all about instant help. Outside linebacker Dion Jordan, cornerback Jamar Taylor and guard/tackle Dallas Thomas all represent instant upgrades to their starting lineup. The Dolphins didn't kill it from a value perspective. They traded up to secure Jordan, got Taylor a little later than expected and reached a bit for Thomas. Then they really reached for third-round pick Will Davis, who was a consensus late-fourth to fifth-round guy. Dion Sims was the best combination of size, speed and athleticism at the tight end spot. If he establishes a rapport with Ryan Tannehill, he'll be a fourth-round steal. Taking a specialist when you need a special teams upgrade always gets a thumbs-up from this grader.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2013,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Without a doubt, the Minnesota Vikings won the first day of the draft. They had Sharrif Floyd, widely tipped as a top-10 or even top-three prospect, fall to them at No. 23—on the day legendary Vikings tackle Pat Williams signed a one-day retirement contract. Then, they took the man many had mocked for their first pick, physical cornerback Xavier Rhodes. Rhodes is a perfect fit for their system and will be an instant upgrade. Finally, to replace the departed Percy Harvin (whose trade netted the extra first-rounder), the Vikings dealt half their draft to the Patriots and took Cordarrelle Patterson. Those three players will each have the chance to make huge, instant impacts on the Vikings' bottom line—and for years to come. They didn't get good value on the move up, but it appears to be a pedal-to-the-metal strategy. If all three players pan out, it will be one of the best draft crops in recent history. If not, well...",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2013,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "After gladly taking half the Vikings' draft in exchange for their first-rounder, the Patriots added a perfect fit for their defense in outside linebacker Jamie Collins. Collins has the athleticism and attitude to make a quick impact on the Patriots' D. Receiver Aaron Dobson was a bit of a head-scratcher. Taken early with much more dynamic receivers on the board, his height and hands will at least make him an asset to Tom Brady. Cornerback Logan Ryan and safety Duron Harmon were taken a little and a lot early, respectively; the two reaches will nevertheless have a good opportunity to compete and contribute. The savvy trade gets the Patriots a bump back up to \"average.\"",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2013,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "There's something to be said for a team that knows exactly what it needs and takes it. Safety Kenny Vaccaro adds desperately needed talent and athleticism to a secondary that had little of it in 2012. Tackle Terron Armstead was great value in the third round and should ease the loss of free-agent left tackle Jermon Bushrod. I mocked massive tackle John Jenkins to the Saints with the No. 75 pick that became Armstead; the Saints nicked defensive coordinator Rob Ryan's new interior anchor with the No. 82 pick instead. Overall, the Saints got exactly what they needed, despite holding few picks, and got great value across the board.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2013,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The video of offensive lineman Justin Pugh getting mobbed by his friends after the Giants called him was one of the best stories of the first day. Pugh should be a good story for the Giants on the field too. Defensive tackle Johnathan Hankins and end Damontre Moore really help reload that vaunted Giants defensive line after the departures of Chris Canty and Osi Umenyiora. The Giants get huge brownie points for not letting quality quarterback talent slide past them over and over just because they have a starter already. Ryan Nassib in the fourth round is fantastic value and adds a further upstate New York flavor to this Giants draft class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2013,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The New York Jets finally traded Darrelle Revis. With one of their resultant two first-rounders, they got a big, physical, athletic cornerback who will spend his career unsuccessfully trying to paddle away from the legend of Revis Island. Dee Milliner should be a great player for the Jets even if he can't match Revis' all-world ability. He was also a great value, as many pegged him as a top-five prospect. Sheldon Richardson was taken right where he belonged. That Geno Smith was still there for them with the 39th overall selection was a huge shock; that they took him was a huge relief. The Jets needed an answer at the quarterback position more than anything else this offseason. While the franchise still propped up Mark Sanchez as the quarterback, the team could not move forward.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2013,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "When the Raiders seriously overdrafted a blazing-fast cornerback with a lot of question marks, Houston's D.J. Hayden, out came the jokes about the late Al Davis still drafting for the Raiders from the hereafter. Picking up a tackle prospect, Menelik Watson, with impressive measurables in the second round didn't stop the jokes, even though Watson was a good value at No. 42. It was the clever pick of playmaking outside linebacker Sio Moore in the third round and the savvy pickup of quarterback Tyler Wilson in the fourth that turned the jokes into respect. The Raiders didn't get great value with their first-round pick, but on the whole, they got a lot of quality talent to fit many of their myriad of needs. Good show.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2013,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Everyone looked at Philadelphia Eagles head coach Chip Kelly to usher in a brave new world of zone-read offense in the NFL. With his first pick, Kelly reached a little bit for a left tackle prospect with elite upside but little polish. Lane Johnson will have to prove he can destroy people one-on-one in the NFL for Kelly's system to work. Zach Ertz was a nice pick in the second round, but whether he can excel in Kelly's offense without strong blocking ability is an open question. Meanwhile, defensive tackle Bennie Logan was a reach for need in the third round. The real head-scratcher is Matt Barkley. It's not that the quarterback didn't represent great value at the No. 98 pick, but how he fits into the system is unclear, and the Eagles already have a very young starter and veteran situational quarterback. Even if Nick Foles is on his way out, how is Barkley a significantly different/better prospect? Safety Earl Wolff was a good pickup for a secondary undergoing yet another massive overhaul.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2013,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "This draft class was a classic Pittsburgh Steelers crop: Jarvis Jones, a classic Steelers outside linebacker to replace the departed James Harrison. Le'Veon Bell, a big bruising power back with surprising agility and versatility. Markus Wheaton, a perfect replacement for the departed Mike Wallace. Landry Jones, a decent value and a likely replacement for the Methuselah of the NFL, backup quarterback Charlie Batch. All in all, the Steelers not only got good players at positions of need with good value; they got a draft class that's a perfect expression of their ethos and identity.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2013,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Massive, athletic offensive tackle D.J. Fluker was just the prospect the Chargers needed. Most draftniks did not have him in play at the No. 11 spot, but Fluker's upside and fit are undeniable, and the unprecedented run on linemen was well under way at that point. The Chargers traded up to get Manti Te'o, which is an interesting move considering the on- and off-field questions surrounding him. Still, at No. 38 overall, Te'o had fallen further than most expected. If he can step in and solidify the Chargers run defense, that's what you want in a second-round pick. Keenan Allen took one of the more bizarre slides down the board in the entire draft. What do NFL teams know about this explosive target we don't? Assuming Allen doesn't have too many more skeletons in his closet than an alleged positive combine drug test, the Chargers got an absolute steal with him in the third.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2013,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The San Francisco 49ers entered the draft with the shortest list of roster needs and the longest list of picks. After plenty of movement up and down, they ended up with a really, really nice class of picks. Safety Eric Reid will be an outstanding replacement for the departed Dashon Goldson. Explosive pass-rusher Tank Carradine was a heist at the No. 40 pick. The 49ers also got the fastest tight end in the draft with Rice's Vance McDonald. He and Vernon Davis will give opposing linebackers and safeties fits. Corey Lemonier at the No. 88 slot was one of my favorite picks in the draft. Lemonier has the terrifying speed and edge-rush ability. Marcus Lattimore was an interesting pickup; he'll be the between-the-tackles heir apparent to Frank Gore while LaMichael James takes over all other backfield duties. Little pressure on him to perform is good news. After that, frankly, I have a hard time seeing any of their third-day picks making the 49ers' stocked roster. There's a minus after this \"A\" because the 49ers had the ammo to move up higher and take even more impressive game-changing talent, but they didn't.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2013,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Seattle Seahawks spent their first-round draft pick trading for explosive veteran playmaker Percy Harvin. They spent their second-round draft pick on a powerful, playmaking tailback in Christine Micheal; he'll take pressure off workhorse Marshawn Lynch. In the fourth round, the Seahawks added another offensive playmaker: Kansas State receiver Chris Harper. He wasn't the biggest or fastest target in the draft, but he's yet another weapon for quarterback Russell Wilson to bludgeon defenses with. Of the Seahawks' many third-day picks, most of whom will have a hard time finding a roster spot, I especially like outside linebacker Ty Powell, an explosive athlete who could flex up to defensive end in passing situations. If we count Harvin, this could be an A-, but as it stands, the Seahawks just got a lot of good players at decent value.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2013,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The headlining moment of the Rams' 2013 draft was the trade up to snag Tavon Austin, the draft's top playmaker. No wonder: Austin is the last piece of a balanced Rams offense that could take a big leap forward in 2013. The explosive Austin gives Sam Bradford a terrifying weapon at last. The other young receivers and backs (including third-rounder Stedman Bailey, Austin's Mountaineer teammate) combined behind an offensive line now anchored by Jake Long could be something to behold. Garnering less attention was the hardly-less-important addition of Alec Ogletree, the athletic linebacker from Georgia. Ogletree should switch to outside linebacker for the Rams; the one-time safety has great athleticism and pass coverage skills. Safety T.J. McDonald was a fairly hefty reach at No. 71 overall, but the top safeties had flown off the board, and the Rams needed an impact player there. Alabama center/guard/tackle Barrett Jones slid all the way into the fourth round, where the Rams smartly stopped his slide. His intelligence and versatility make this a great value pick.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2013,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "With the massive flop of 2012 big-money free-agent cornerback Eric Wright, the Buccaneers had a crystal-clear need for Mississippi State cornerback Johnthan Banks. Banks has great height, good speed and natural cover skills. Though he was a bit of a reach at No. 43, he'll be a good player for the Bucs. While great value at pick No. 73, the Bucs taking quarterback Mike Glennon speaks of a team that had targeted its fit before the draft began, not paying attention to the board (or, of course, the team legitimately preferred Glennon to Matt Barkley or Ryan Nassib). The Bucs did get two nice pickups on the third day, tackle Akeem Spence and end William Gholston. How Gholston's freaky tool set and inconsistent motor fit into the Bucs defense is an open question; will he replace the departed Michael Bennett?",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2013,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Tennessee Titans got their man in the first round: overpowering guard prospect Chance Warmack. Better yet, they didn't lose their head and trade up to get the guard; he fell to them at just the right slot. The Titans also added a local boy, wide receiver Justin Hunter, near the top of the second round. Hunter, though, was a good value there; some valued his skill and savvy above catch-and-run teammate Cordarrelle Patterson. Cornerback Blidi Wreh-Wilson was a great fit for their system and an excellent value in the third. And in Brian Schwenke, the Titans got the consensus second- or third-best center in the draft at least a full round later than most thought he'd go.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2013,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Redskins approached the draft just as they approached free agency: calmly, quietly and with keen awareness of their roster needs. With few, low picks and feeling the crushing burden of the NFL's arbitrary salary-cap penalties, they still met needs. Value, though, not so much. Defensive back David Amerson was a reach at the No. 51 pick, but he was such a perfect fit. As the near-future replacement for DeAngelo Hall, he can play either corner or safety. The Redskins needed one of the many athletic tight ends available in the draft; with Jordan Reed, they got one, but they reached a bit to do it. Someone will have to explain to me how Georgia safety Bacarri Rambo was still available in the sixth round, but nobody needs to explain to me why the Redskins took him. Safety was a crying need, and Rambo's selection might give the Redskins the flexibility to keep Amerson at corner.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/1620969-2013-nfl-draft-grades-team-by-team-report-cards-results",
    "playerGrades": []
  }
]