[
  {
    "teamName": "Arizona Cardinals",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They landed a future star in first-round pick Haason Reddick. He will add speed and versatility to their defense. I love second-round pick Budda Baker, the safety from Washington. He will help offset the loss of Tony Jefferson. Third-round pick Chad Williams, a receiver from Grambling, could be a steal where he was drafted, adding much-needed speed, and I love fourth-round pick Dorian Johnson. It was a really good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Falcons wanted to get an edge rusher, and they got a good one in UCLA's Takk McKinley in the first round, which was an outstanding pick. They came back and added a speed linebacker in LSU's Duke Riley in the second round and a much-needed guard in Sean Harlow from Oregon State, who should be the starting right guard. They got faster on defense, which is not a good thing for NFC South quarterbacks.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Did they really need a corner in the first round? I know they stuck to their board by taking Alabama corner Marlon Humphrey, but I thought they had bigger needs. They came back to make up for it by taking Houston edge rusher Tyus Bowser in the second round and Michigan defensive tackle Chris Wormley in the third. Fourth-round rusher Tim Williams could be a pass-rush star -- if he can stay out of trouble.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I think they made really good picks with their first two, trading down in the first before taking LSU corner Tre'Davious White, then landing East Carolina receiver Zay Jones in the second. Their other second-round pick, Dion Dawkins, will probably be the starting right tackle. Fifth-round quarterback Nathan Peterman could end up being a potential starter down the road.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They were linked to Stanford running back Christian McCaffrey in the first round, and it played out that way. I think it's too high to take him at No. 8, but he will help in a lot of ways. Second-round pick Curtis Samuel can do a lot of the same things, and will likely be their slot receiver. I love the pick of Texas A&M pass rusher Daeshon Hall in the fourth. He will develop into a quality pass rusher. Fifth-round corner Corn Elder will be a good nickel corner.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2016,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They made a strange move to give up so much to move up a spot to No. 2 overall and draft North Carolina quarterback Mitchell Trubisky. They could have stayed in their third spot and landed him, but gave up too much to move up a spot. If he's a star, they will be laughing at all us. But why give Mike Glennon that contract if this was what you planned to do? Second-round tight end Adam Shaheen from Ashland is a big, physical tight end. But this is all about Trubisky and that trade.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I thought the Bengals had as good draft as any team in the league. Taking receiver John Ross with the ninth pick is a bit of a risk, but you can't coach speed. They took a different type of risk with Oklahoma running back Joe Mixon in the second round, but the kid is the best runner in the draft. They clearly looked past the assault video to take him. They then landed two good pass rushers in Kansas State Jordan Willis and Auburn's Carl Lawson, two players who will compete to start at right end. Fourth-round receiver Josh Malone from Tennessee can fly. There are some risks here, but I think they will pay off big.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "For all the criticism of the analytics crew in Cleveland, they had a heck of a draft. Aside from trading down to get Michigan's Jabrill Peppers in the first round, they added a lot of really good players. They had a lot of picks and did some good things. They got the top player in the draft in Myles Garrett with the first pick, and then continued to do a nice job. Tight end David Njoku was a nice add with their third first-round pick. This draft, though, will be defined by how well second-round quarterback DeShone Kizer develops. If he is their starter for a long time, this will be a great draft. Right now, it's a damn good one.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They needed help up front, so taking Michigan defensive end Taco Charlton makes sense, but I think there were better options at that point. I think they bounced back and got two good corners in the next two rounds in Colorado's Chidobe Awuzie and Michigan's Jourdan Lewis, which help a position of need. Taking Ryan Switzer in the fourth round could mean Cole Beasley may be out next year when his contract is up.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They needed help up front on the offensive line and landed a solid left tackle in Utah's Garett Bolles. He is older at 25, and he is raw, but he plays with a nasty streak. Second-round defensive lineman Demarcus Walker will be a nice addition up front. It's clear they want receiver help, taking two in the first five rounds, and I like third-round receiver Carlos Henderson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2016,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "First-round pick Jarrad Davis is a nice three-down linebacker who will fill a major need, so that pick is solid. But this is a team that had major pass-rush issues last season, and they waited until the sixth round to take a defensive lineman. That's not wise in a division with Aaron Rodgers. Second-round corner Teez Tabor was a reach at that spot. I just didn't think it was a good haul for the Lions.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Some general managers seem to always do it right in the draft, and Green Bay's Ted Thompson is one of those guys. He had another good draft, trading out of the first round and still landing a lot of good players. He took Washington corner Kevin King in the second round, and he will be a big-time player. Second-round safety Josh Jones is a nice player who helps offset the loss of Micah Hyde. I love third-round defensive tackle Montravius Adams. Fourth-round running back Jamaal Williams will be a 1,200-yard rusher in a season at some point in his career.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2016,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They made the bold move to go up in the first round to No. 12 to get quarterback Deshaun Watson from Clemson, which is a smart move -- but a risky one. How will he fit in Bill O'Brien's offense? It's smart to take the shot. Second-round linebacker Zach Cunningham was a nice hit after being a big-time player in the SEC. They added some line help later on both sides of the ball. This draft will be all about Watson. If he is what they think he can be, it's a major hit. If not, it will be a big whiff.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They needed to get defensive help, and they used their first three picks on that side of the ball. First-round safety Malik Hooker is a rangy player in the Ed Reed mold, which they needed. Second-round corner Quincy Wilson is a nice cover player who will start right away, and third-round defensive end Tarrell Basham should help the pass rush. I like fourth-round running back Marlon Mack a lot. He has big-play ability.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Leonard Fournette, their first-round pick, is a nice player, but I just don't think you take backs as high as No. 4. After that, they did a nice job trading up for tackle Cam Robinson in the second, and third-round pick Dawuane Smoot will be a steal. Fourth-round receiver Dede Westbrook will add speed to a pass-catching group that needs it, but he does have baggage.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "I think Texas Tech quarterback Patrick Mahomes will be the best quarterback in this class, so from a talent standpoint making the move up in the first round to get him makes sense. Second-round defensive end Tanoh Kpassagnon from Villanova is a raw player, but they need down help. I really like third-round running back Kareem Hunt from Toledo. Fourth-round receiver Jehu Chesson will help the passing game. This is a draft that will be all about Mahomes, but we won't know that answer until years in the future.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I didn't love taking receiver Mike Williams that high in the first round, but I think they had a really good draft in the next four rounds. Williams doesn't separate enough for my liking. They upgraded their offensive line with Forrest Lamp and Dan Feeney and added two other weapons for Philip Rivers and two quality safeties. Nice job. Taking Williams too high drops it down from an A for me.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2016,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They traded their first-round pick last year to get quarterback Jared Goff, so they had to wait until the second round to pick. When they did pick, they seemed to focus on helping Goff. Their second-round pick was tight end Gerald Everett, and they followed that up with Eastern Washington receiver Copper Kupp in the third and Texas A&M receiver Josh Reynolds in the fourth. They didn't take an offensive lineman, which was strange.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Dolphins did a nice job with their draft, landing pass rusher Charles Harris in the first round. He fills a need, and he's a productive player. Linebacker Raekwon McMillan brings some speed to a group that needs it. Adding corner Cordrea Tankersley in the third round and guard Isaac Asiata are also good picks and fill needs. It was a good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2016,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They didn't have a first-round pick after trading it last year to get quarterback Sam Bradford, but they got a first-round talent in the second round in running back Dalvin Cook. If he can stay away from the issues that had many dropping him down, he will be a steal. Upgrading their offensive line with Ohio State center Pat Elflein in the third round was a good pick. They added some weapons with a chance to help the passing game in the later rounds, including fifth-round receiver Rodney Adams from South Florida.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They didn't have a pick in the first or second round, since they traded them away to get receiver Brandin Cooks and pass rusher Kony Ealy. They are part of this class, which will bring up the grade. They got a solid pass rusher in Youngstown State's Derek Rivers in the third and tackle Antonio Garcia will be the guy who takes over for Nate Solder next year when his contract is up. They also gave up a fifth-round pick to sign Bills running back Mike Gillislee as restricted free agent. If Ealy can get them 8-10 sacks, this will be a good haul with their picks. If not, it will be just solid.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They probably thought they had no chance to get Ohio State corner Marshon Lattimore when the draft started, but they end up getting him in the 11th spot. That was a nice pick of the top corner. I didn't love the pick of Wisconsin tackle Ryan Ramczyk with the 32nd pick -- he has some medical issues and is that really a major need? -- but they added some nice players later in Utah safety Marcus Williams in the second and pass rusher Troy Hendrickson in third. I also think third-round linebacker Alex Anzalone from Florida has a chance to a long-time starter if he stays healthy. That's a big if, based on his career.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2016,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They used their first-round pick on tight end Evan Engram, a nice weapon for Eli Manning, but they needed help up front. I would have gone with an offensive lineman. I love second-round pick Dalvin Tomlinson, a defensive tackle from Alabama. I also like Davis Webb as a potential starter, but I think this team is built to win now with Manning's years coming to an end. Why not take another player who can help now? Fifth-round pass rusher Avery Moss is intriguing and has a lot of ability.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2016,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They landed a gem in first-round LSU safety Jamal Adams, but why come back and take safety Marcus Maye in the second? There were other needs. They did get two receivers with their next two picks, and I really like Cal's Chad Hansen in the fourth. Sixth-round runner Elijah McGuire could be a steal in that spot. I expected more out of this class.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "There was some risk in them taking Ohio State corner Gareon Conley in the first round with his legal situation pending, but he is a top talent and could pay off big. The next three picks could also be big-time steals. Second-round safety Obi Melifonwu had first-round talent, and if UCLA defensive tackle Eddie Vanderdoes can keep his weight in check he will be a good player. They needed some help up front, so he made sense.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I really like the choice of pass rusher Derek Barnett in the first round. He might be the best pass rusher in this class. They took a risk with Washington corner Sidney Jones in the second, but it could be a big-time payoff if he comes off a torn Achilles tendon healthy. They added some young weapons for Carson Wentz in the later rounds. Fifth-round receiver Shelton Gibson can fly.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "First-round pick T.J. Watt is a player who is a perfect fit for the Steelers' scheme. His best football is in front of him. I thought second-round pick JuJu Smith-Schuster went a little high, but third-round corner/safety Cam Sutton was a really nice pick. The best story of the draft is the pick of third-round runner James Conner out of Pittsburgh. This is a kid who overcame cancer. Love that.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "First-year general manager John Lynch killed it in his first draft, trading down one spot with the Bears in the first round and picking up a bounty of picks. That was a fleecing. Then they took Solomon Thomas with the third overall pick, and he is a future star. They next traded back into the first to get linebacker Reuben Foster with the 31st pick, and he will be a steal. I thought taking quarterback C.J. Beathard in the third was too high, but it was good first draft for the 49ers. Watch out for sixth-round defensive tackle D.J. Jones from Mississippi. He could be a steal.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They traded out of the first round and added picks, then general manager John Schneider did a really god job with the extra ones. They had a nice couple of days. Second-round pick Malik McDowell has first-round talent, and will be a nice addition. Second-round offensive lineman Ethan Pocic can play a bunch of spots, which they like up front. They then sent messages to the Legion of Boom by drafting a corner and three safeties. Schneider knows how to keep a handle on his roster by making moves like that. One knock: Maybe one more offensive lineman would have helped.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They landed perhaps the cleanest player in the draft with their first pick in tight end O.J. Howard, giving Jameis Winston another top weapon. Second-round safety Justin Evans will push to start right away, and third-round receiver Chris Godwin can fly. Fifth-round running back Jeremy McNichols from Boise State is a good runner who could be a nice surprise.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Titans wanted to get a receiver and corner with their first two picks, and they did that. They got the best receiver in the draft in Western Michigan's Corey Davis with the fifth overall pick. They then came back and got USC corner Adoree Jackson with their second first-round pick. It was a nice one-two hit. They added another receiver (Taywan Taylor) and a tight end (Jonnu Smith) to give Marcus Mariota some more weapons.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Although they don't have a true general manager, the Redskins had a nice draft haul. With their first two picks, they picked two good Alabama players. They got lineman Jonathan Allen in the first and pass rusher Ryan Anderson in the second. Those were two need spots. Allen was really a steal at No. 17. They also got first-round talent in UCLA corner Fabian Moreau, who dropped because of a torn pectoral muscle. Fifth-round tight end Jeremy Sprinkle is an in-line tight end to go with Vernon Davis and Jordan Reed.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2016,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Buffalo gets a stout run defender in Lawson (No. 2 run grade among edge defenders in the class) who also showed the ability to get after the quarterback (No. 9 pass-rush grade at +25.9). He had a breakout 2015 season after a strong performance in limited snaps in 2014, and he'll step in to replace Mario Williams opposite Jerry Hughes on the edge. Once thought to be a first-round pick, Ragland fell to the second where his clean run-stopping ability makes him a solid pick. While there are questions about his athleticism in coverage, he can make plays in front of him in zone, and his pass-rush ability can help him find a role on third down (he is movable blitzer, and the Bills can isolate him on running backs). Washington is another strong pick from a production standpoint, as he played all over Ohio State's defensive front the last two years and he posted third third-best pass rush grade among the draft's interior defensive linemen in 2015. Jones has a cannon for an arm and he's worth a developmental shot, even though his accuracy between six and 30 yards is among the worst in the class. Jonathan Williams missed all of 2015, but his 101.9 elusive rating ranked fifth in the FBS in 2014. Listenbee is a nice late-round speed addition as he may be the fastest player in the draft and it showed on the field when he was healthy in 2014 (526 deep yards, 10th in the nation).",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2016,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Miami capitalized on the draft's biggest story by grabbing one of the best players in Tunsil at No. 13 overall. He turned away a top slate of pass-rushers last year to give up only five pressures, and he's an explosive run-blocker who is capable of moving defenders at the point of attack and finding targets at the second level. The film shows the potential with Howard, whose length and speed make him an intriguing option at outside corner, but there were enough bad plays on tape to give him the No. 16 coverage grade in the class. Drake has good straight-line speed and he can catch the ball out of the backfield (his 2.07 yards per route run ranked third in the class), while also adding kick-return value. Carroo was outstanding on only 363 snaps last year, leading the class with 4.11 yards per route run, dropping only two passes and taking over multiple games (Michigan State comes to mind). He can separate at the intermediate level to add another option to Miami's passing game. Carroo was drafted a day late as he's a good intermediate route runner with sure hands and he led all FBS receivers with 4.11 yards per route. Grant picked up more yards after the catch than any receiver in the class, and he adds a playmaking option from the slot. Duarte is a mismatch option of his own as a \"move\" tight end and his 1.99 yards per route ranked third in the class. Doughty is one of the draft's most accurate quarterbacks and a worthy late-round selection.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "With no pick in the first round, the Patriots went with two solid options in Jones and Thuney in the second round. Jones played outside cornerback at Alabama but he has the skills to play in the slot, and he's strong in both man and zone coverage, leading to a +12.6 coverage grade that ranked eighth among cornerbacks in the draft class. Thuney ranked as a top-20 guard in 2014 and a top-5 tackle in 2015, and he's only given up 14 total pressures in two years while bringing strong run-blocking and scheme versatility. Brissett is more of a developmental option at QB after posting the No. 24 overall grade in the draft class, and Valentine is more of a hold-the-point run-stopper at nose tackle. Mitchell should compete for snaps on the outside with his sharp intermediate route running that led to a +17.5 receiving grade (16th in the class). Lucien is another intriguing option on the outside and one of our draft sleepers at No. 92 on the PFF Draft Board.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2016,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "We don't hate Lee as a player, but we saw him as more of a second- or third-round player than a first-round option. His athleticism stands out, but it hasn't translated into the strong coverage ability in college everyone has projected for him in the NFL. He posted a negative grade in coverage in 2014, and an average mark in 2015. However, he's shown to be an excellent blitzer and that should be a weapon in head coach Todd Bowles' scheme, which blitzed 43.3 percent of the time last season, third in the NFL. It's no secret that we haven't been impressed with Hackenberg's on-field performance, and while many in the NFL believe in him to be a potential reclamation project, he never put together a stretch of strong play during his three years in college. He graded at -24.7 as a freshman, -41.0 as a sophomore and -12.1 as a junior, all among the worst QB grades in the nation. Hackenberg's accuracy has also been among the nation's worst, to all levels of the field, and he will have to make major strides to live up to his second-round value. As for Jenkins, he's a solid run-stopping outside linebacker (+14.9 run grade, ninth in the class in 2015), and he's had two strong years of production to provide an indication the he'll be a solid player in the Jets' scheme on the edge. Burris has good size and he was productive for NC State, surrendering only 0.71 yards per cover snap, good for ninth in the draft class. Shell only allowed seven pressures all year, but he struggled with the best of the SEC competition.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Laremy Tunsil controversy might have pushed the Ravens to take Stanley, but they still got one of the draft's best pass-protecting offensive tackles. The No. 16 player on the PFF draft board is a smooth-mover who rarely gets beaten cleanly in the pass game. He doesn't bring a lot of power to the run game (+9.3 grade, No. 19 in the class), but he should be a good fit for Baltimore's outside-zone scheme. One of the many pass-rush specialists in the draft, Correa doesn't bring power to the run game, but he can explode off the ball and get after the quarterback (impressive +16.3 pass-rush grade on only 236 rushes). Kaufusi is one of the most productive players in the draft, and he brings his +29.3 pass rush grade (fifth-best among interior defensive linemen in the draft) and strong run-defending ability to the 3-4 defensive end position in Baltimore. Young's 0.71 yards per cover snap ranked 10th in the class and he brings a nice option as a slot corner. Lewis is a favorite of offensive line coaches around the league, and he's better in pass protection at this point. Henry brings pass-rush potential after posting the No. 19 grade in the class at +19.0. Dixon was a steal in the fourth round after notching the top receiving grade among running backs in the class. Reynolds is an intriguing option as a QB-conversion after an outstanding career at Navy.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2016,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Our No. 2-ranked cornerback, Jackson is a steal for the Bengals. His size, speed, change-of-direction and on-field production could make him the best pure cornerback in this class in a few years. Jackson shows excellent ball skills, he can play in any scheme, and perhaps most intriguing is that there is still room for him to improve from a technique standpoint. Boyd ranked No. 10 in the class with a +20.2 receiving grade, although he'll disappear at times before breaking out some nifty-looking routes. Vigil was productive at Utah State, finishing with 136 run stops the last two years, but he struggles to defeat blocks. Billings is an early-round talent that fell through the cracks, but he has great potential after two strong years of grading. Just let him work downhill and destroy blockers. Westerman is one of the best pass-protecting guards in the class, and he adds great depth along the offensive line. Core was overlooked at Ole Miss, but his size and speed make him intriguing.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "After trading down from No. 8 overall, the Browns secured the same player I gave them in my final mock draft in Coleman. He's the top receiver on our draft board, as he can separate before the catch and take it to the house after it, all leading to an outrageously good (and best-in-class) 4.88 yards per route last season before his quarterback situation hurt his production (he finished third in that stat). With the No. 3 pass-rush grade in the class, Ogbah showed that he can win to the outside, but he does need to develop a counter-move and use his length better both as a rusher and in the run game. Nassib put together a monster senior season, including a dominant Senior Bowl, and he pushed the pocket and used his good hands to post the No. 2 pass-rush productivity in the class at 18.3. Coleman is a good developmental tackle after grading well in a friendly Auburn system (+27.5, sixth in the class). Kessler is as accurate as any quarterback in this draft (accuracy percentage of 78.2 percent, third in class), but he doesn't have a great arm and he can be slow to process in the pocket at times. Schobert was extremely productive in college, leading the class with a 22.7 pass rush productivity and slipping blocks with active hands. Payton was adept at getting open for UCLA, leading to the No. 7 receiving grade in the class at +22.2. Drango projects as a guard, but his +29.7 run block grade ranked second among the nation's offensive tackles. Higgins is a good route runner and he has a great feel for the game that allowed him to post the No. 3 receiving grade in the nation in 2014. Wright was excellent against the run with +34.5 grade that ranked second in the nation.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2016,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Burns is a curious fit for the Steelers, as he's more of a press-man corner and the Steelers played more zone coverage than any team in the league last year. He struggles to change directions, and while he's physical in press, his nine penalties were the third-most in the draft class. It all added up to a +2.8 coverage grade that ranked No. 42 among this year's CBs. He has good size and straight-line speed, but unless Pittsburgh is looking to incorporate more man coverage concepts on defense, this is not a good fit on paper. He ranked just No. 144 on our draft board. Another good athlete with a great size-speed combo, Davis played both safety and cornerback at Maryland with mixed results. His -3.6 overall grade ranked No. 96 among safeties in the draft class, as he struggled in coverage and has missed 25 tackles over the last two years. Hargrave brings a different body type to Pittsburgh's defensive line and he can win with a good first step. He graded well at both the East-West Shrine Game and the Senior Bowl. Hawkins surrendered 13 pressures on only 224 attempts in 2015, but he shows potential in the run game. Feeney's good burst and quick hands allowed him to finish with a 14.3 pass rush productivity, good for ninth in the draft class. Ayers is a sure-handed option in the slot with running back skills and only two dropped passes last season.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2016,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Houston jumped up to take Fuller, one of the best deep threats in the entire draft. His 4.32 speed shows up on the field, and over 50 percent of his yards came on deep passes, so whether or not he can become a viable all-around receiving threat is the big question with him. He ranked No. 116 and 113 in the nation in drop rate the last two years, so it's boom-or-bust with Fuller on a week-to-week basis. Houston filled a major hole at center with Martin, who is a good zone blocker who run-block grade ranked fifth in the class. He only gave up five hurries all of last season, good for a pass-blocking efficiency of 99.2 that ranked second in the class. Miller is an intriguing third-round pick, as he's dangerous with the ball in his hands (he forced eight missed tackles on just 28 catches) but has a lot of work to do as a route-runner. Ervin is a solid change-of-pace back that ranked second in the class with a +5.3 receiving grade. Reader has intriguing interior lineman as he has massive size and he had a monster +4.0 grade in the National Championship against Alabama.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2016,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Colts needed to address the center position, and they took the draft's top option in Kelly. Every offensive line coach we ran into during the draft process loved Kelly, who surrendered only 10 pressures all season. His balance and power is a good fit for the Colts' man-blocking scheme. The second and third round featured pure projection picks for Indianapolis. Green has excellent size and speed, but his -10.8 coverage grade ranked last among the safeties in the class. He may switch to cornerback in the pros, but either way he is a risk at this point in the draft. Clark has the size and length at tackle, but he struggled with speed rushers off the edge at times in college, and that got exposed further during Senior Bowl week. He did finish ninth in the class with a +14.4 run-blocking grade. Ridgeway is good value in the fourth round as he posted a +15.4 pass rush grade and a +17.9 grade against the run on limited snaps. Morrison brings attitude to the defense but he leaves far too many plays on the field, as evidenced by his 18 missed tackles on only 91 attempts.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2016,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "A perfect fit for Jacksonville's defensive scheme, Ramsey can play outside cornerback or in the slot, using his length and athleticism to compress the field in zone concepts. He also brings the top grade against the run among corners, adding to his value when playing in the slot. Ramsey can move around the defense and work as a defensive chess piece, but he also has the tools to develop into one of the best press cornerbacks in the league. Jacksonville hits the jackpot with Jack, gambling on his knee injury issues (the reason he dropped from a potential top-5 pick to the second round) to grab the top coverage linebacker in the draft (led the nation in 2014). He improved against the run in 2015, and if he stays healthy, he and Ramsey provide numerous options to slow opposing passing attacks. Ngakoue did little against the run at Maryland (No. 118 in nation in 2015), but he'll be a pass-rush specialist after posting the 13th-best grade in the class at +24.5. Day is an explosive interior disruptor that finished No. 2 overall among interior defensive linemen in 2015. Holmes impressed us with a monster +10.7 grade against North Dakota State and he showed well in East-West Shrine Game. Allen is a perfect backup quarterback and he had two monster games against the Mississippi schools on his way to a +32.5 passing grade that ranked eighth in the country.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "After moving down from No. 1 to No. 15, the Titans came back up to get Conklin, setting the tone for their draft that they wanted to get better in the trenches and in the running game on both sides of the ball. Conklin was the No. 4 run-blocker in the nation each of the last two years, and a good fit for their power scheme. We do not feel as strongly as others do about Dodd's abilities as a pass-rusher, but he can shed blocks and play the run (sixth-highest grade in the class). Johnson used his quick hands to post the No. 3 grade against the run in the class, and that gives him some pass-rush potential as well. Henry fits what Tennessee is trying to build with its downhill running scheme, and he forced more missed tackles than any running back in the nation (on the most carries) with 76, but his passing game contributions should be limited. Byard posted the seventh-best coverage grade among the safeties and his center-field ball skills are among the best in the class. Sharpe is a sure-handed receiver that dropped only three of 115 catchable passes last season. Tretola is one of the best run-blocking guards in the draft and a perfect fit for the power scheme Tennessee is trying to implement. We loved Reed as a Day 2 option and his ball skills are a great pickup at the back end of the draft.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Coming into the draft with a major need at quarterback, the Broncos grabbed the third-best option on the board in Lynch. His +30.5 overall grade ranked seventh in the class and he led the way with a 70.3 percent accuracy percentage when pressured. Memphis' scheme limited his time in the pocket, rolling him out on about one-fifth of his snaps and throwing a number of screen passes — all concerns when projecting him to the NFL. Lynch struggles with accuracy outside the numbers, and he lacks the ability to throw receivers open against tight man coverage, but the arrow is pointing up in his career, even if we'd rather see him as a second- or third-round pick. Gotsis was off to a monster season (+17.2 on only 377 snaps) before going down due to injury. His +13.8 pass-rush grade on 170 attempts makes him an intriguing upside option on the interior. Simmons is a sure-tackling safety (13th-best tackling efficiency in class), but he can struggle when isolated in man coverage. Booker is a good fit for Denver's outside zone scheme after posting the No. 3 run grade in the class at +25.6. Parks is one of our favorite picks in the draft after grading well in a safety/slot role for Arizona. He has the skills to play free safety in the NFL.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Jones has as much potential as any player in the draft, after posting the No. 2 pass-rush grade in the nation a year ago. In just over 1,000 snaps the last two years, he's graded among the best interior defensive linemen in the draft even though he still has technique issues to iron out. Give his strong hands, burst off the line of scrimmage, room for improvement and current on-field production, Jones could become one of the best players – and biggest steals — in this draft. Russell's -1.3 coverage grade ranked No. 94 among cornerbacks in the class, although he looks better playing the press coverage that the Chiefs favor rather than playing in zone, where his more deliberate movements had him a step late far too often. Murray doesn't excel in any one area, but he's solid all around and he didn't surrender a touchdown last season. Robinson's off-field concerns are valid but he knows how to separate and he's worth a mid-round opportunity. Hogan's progression in 2015 is also worth a shot in the mid-rounds, though his accuracy beyond 20 yards is among the worst in the class. Nicholas could stick as a pass-rush specialist after posting the 18th-best grade in the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "While Joseph was No. 30 on the PFF draft board, taking the top safety prospect in this class at No. 14 is still a good pick, as Joseph brings great versatility to the Raiders' secondary. He made plays all over the field in coverage early in 2015, whether playing center field, in the box or in man coverage — all part of his impressive 240-play sample before injury ended his season. Joseph can also work downhill in the running game, and the Raiders are hoping that his 17 missed tackles from 2014 are a thing of the past. Ward did little to inspire confidence at Illinois, although he could develop into a good run defender. He had the 69th-best overall grade among edge defenders in the class and the 100th-best pass-rush grade at -0.3. On the other hand, Calhoun ranked second in the nation with a +44.0 pass rush grade, and while he's not great in the run game, he can get after the quarterback early in his career. His 144 total pressures over two seasons were second only to No. 3 overall pick Joey Bosa (who had 145 for Ohio State). Cook is good value at the top of the fourth as he has a chance to at least become a tradable commodity down the road. He was ranked at No. 75 on the PFF draft board. Washington posted the third-best elusive rating in the class at 86.1, and he forced 67 missed tackles on 271 touches last season.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2016,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "There was little discussion that Bosa would be the pick for the Chargers at No. 3, because of a perceived lack of ideal scheme fit, but they took the top player on our draft board and he will immediately upgrade their weak defensive front. Our top-graded edge defender each of the last two years, Bosa is strong against the run and he topped the nation with a +44.1 pass-rush grade. Whether he sees snaps on the outside at linebacker or he bulks back up to play 3-4 defensive end doesn't really matter — Bosa simply defeats blockers in both phases of the game, and San Diego will take a major step forward with his addition. Ladarius Green has moved on, and Henry will fill his role as a pass-catching tight end. The sure-handed Henry didn't drop a pass in 2015, and he has the speed to work the middle of the field for QB Philip Rivers. Tuerk moves better than any center in this draft, pulling and locking onto targets with great athleticism. Before going down to injury last year, he had posted a monster +9.4 overall grade on only 113 snaps. Perry is a solid-all around linebacker and he's only missed nine tackles in over 200 attempts in the last two years. Brown is an athletic linebacker that can rush the passer (+23.9, first among LBs in class) and add value in coverage (+9.2, fourth in class). Watt posted the second-best grade among fullbacks in the draft class at +23.2.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The nation's top-graded overall running back in 2015, Elliott can run in any system, catch the ball out of the backfield, and he's excellent in pass protection (surrendered only one pressure on 102 attempts). While he's going to be a good player, I liked Ramsey here as a better option for the Cowboys, but adding a three-down presence to the Dallas offense will pay immediate dividends. Dallas rolls the dice with Smith, whose knee injury will likely keep him out for all of 2016. When healthy, he's an explosive playmaker, capable of running with receivers, tight ends and running backs out of the backfield. The No. 25 player on the PFF draft board is worth the risk at this point. Collins posted the No. 11 overall grade among interior defensive lineman in the class, using his quick burst to disrupt plays in the backfield. Tapper brings great athleticism on the interior and he can play all along the defensive front after grading at a balanced +13.8 against the run and +13.8 as a pass rusher. Prescott is one of the best running quarterbacks in the draft, though he's not a natural passer as his accuracy (ball location) ranked 14th of 19 qualifiers in the class. Frazier posted the sixth-best run stop percentage in the class and 14th-best tackling efficiency.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "After getting leap-frogged for Georgia OLB Leonard Floyd, the Giants go with Apple, who is one of the best press corners in the draft. Schematically, it's a curious pick, as New York played pure man coverage only 30.4 percent of the time last year, 21st in the league, so unless the Giants are going to increase that number, Apple's weaknesses playing in off coverage and in space may get exposed. We had two corners ranked higher on our board than Apple in William Jackson III and Mackensie Alexander. One of the best route-runners in the class, Shepard posted the top overall grade among the nation's wide receivers a year ago. He's a shifty slot receiver, but he has shown the downfield ball skills (caught 64.7 percent of his deep attempts) to win on the outside as well. Thompson is good value in the third, as he can complement last year's second-round safety, Landon Collins. He ranked fifth in college safety grades in the class. Perkins was one of the best picks on Day 3 as he led all running backs with an elusive rating of 114.7. Adams was our second-rated tight end in the class as he's the top inline blocker with good speed and route running to stretch the seam. The Giants did a nice job with their late picks.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "After the big trade with Cleveland to move up to No. 2, the Eagles got their man in Wentz. He has the big arm to drive deep outs and comebacks, and those skills should be put to use in a vertical passing system 15- to 25-yard range. He graded well on a snap-for-snap basis, but there are concerns with his timing, deep accuracy and ability to make plays under pressure. Wentz goes to a good situation with a coaching staff that is well-versed in developing various styles of quarterback. Seumalo is one of our favorite guards, as he rarely loses in the running game, and he only surrendered four pressures last year despite starting the last three games at left tackle. Smallwood is a good zone runner and he posted the 11th-best run grade in the class. Vaitai had the 16th-best grade in the tackle class in 2014, posting positives in pass protection and the run game, but his work in the run game took a step back in 2015. McCalister is a pass-rush specialist that picked up pressure to the outside at the seventh-best rate in the class, but he has no power to his game as a rusher or against the run.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Washington gets the No. 2 receiver on the PFF draft board in Doctson, who posted the top receiving grade in the nation last year at +28.9 despite playing only 582 snaps. He adds another dimension to a well-rounded group of pass-catchers in Washington, as he uses his outstanding body control to make plays down the field. He may end up as the most productive deep receiver in the class. Whether playing safety or linebacker, Cravens simply knows how to defeat blocks and make plays in both the run game (+10.8 grade, seventh-best in the class) and in coverage (+8.3, eighth in class). Fuller has some boom-or-bust to him, as he was solid in 2014 but struggled to a negative coverage grade before going down to injury early in 2015. Ioannidis notched 33 pressures last season, good for 11th in the class. He adds an interior pass-rusher to the mix. Daniels posted the top grade against the run among the nation's linebackers and he reads plays and blows them up as well as any linebacker in the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2016,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Chicago made the move to get Floyd, who brings a versatile threat to their defense. He can rush the passer off the edge (fifth-highest grade in the class at +28.9), and he showed well against the run at +18.4. Floyd played more of a traditional linebacker role early in 2015 and took to it well, and that should only add to his ability to line up all over the defense to create mismatches. A first-round talent on our draft board, Whitehair was the top-graded offensive tackle in the nation in 2015, and he can play any of the offensive line positions with his strong hands. Bullard posted the nation's top grade against the run at +51.5, and his athleticism gives him upside potential to increase his +7.8 pass-rush grade. Like Whitehair, he brings versatility, as he can line up all across the defensive line. Kwiatkoski can set up his teammates in the run game while showing adequate in coverage. His +29.8 overall grade ranked eighth in the class. Howard is a strong downhill runner, though he's capable of running in any scheme and his +21.8 run grade ranked fourth in the class. Braverman is one of the best slots in the draft, capable of creating separation and adding strong after-the-catch ability. His 3.27 yards per route from the slot led the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2016,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "We had a second-round grade on Decker, so we like him overall as a player, just not this high in the draft. He's a mauling run-blocker (eighth in the nation in 2014 in run-block grades), but two straight years of average grades in pass protection have us concerned. Robinson was getting first-round hype that we weren't sure was warranted due to his limited pass-rush production at Alabama, but this was a perfect spot for him and a good value for the No. 13 run-stopper in the nation each of the last two years. He hasn't shown that he can get after the quarterback effectively, but he's a classic 3-4 defensive end for early downs. Glasgow had a better year as a guard in 2014 than he did at center in 2015. He'll make some impressive blocks and some ugly ones, evening off to his +0.8 overall grade that ranked 28th in the class last year. Killebrew brings great range as an underneath zone defender, but he has to tie up some tackling issues. Dahl posted strong grades in pass protection and he should get a chance to stick as offensive tackle to see if he can learn to handle his kryptonite — the bull rush. Rudock had a fantastic second half and he's worth a look to see if it's sustainable after a terrible first half of the season. Zettel is an interior pass rusher (+17.7, 16th in class) who has to improve his strength at the point of attack.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2016,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Clark has great feel for disengaging blocks in the running game, capable of making plays up and down the line of scrimmage and grading at +43.9 overall last season, which ranked No. 12 in the class among interior defensive linemen. As a pass-rusher, he can push the pocket with the best bull rush in the class, although he needs to add more to the repertoire to maximize his potential. We had a second-round grade on him. Spriggs is an athletic tackle who should fit well in the Packers' zone-blocking scheme — his +6.6 pass-blocking grade ranked No. 10 in the class. Fackrell is a solid pass-rush option on the edge, as his 15.7 pass-rush productivity ranked sixth in the class. Martinez was a step slow in the run game in 2015, but he showed well in coverage and he can play the ball in front of him when playing zone. Lowry had the 10th-highest overall grade among edge defenders in 2015 and he projects as a defensive end in Green Bay's scheme. Murphy adds good late-round depth with starting potential after posting a +23.9 overall grade that ranked seventh in the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Minnesota was expected to target a receiver, and they took one in Treadwell whom we pegged as a being worth a late first-round pick. He's strong on underneath routes, particularly slants, and he should help in the red zone, but we have concerns about his ability to separate at the deep and intermediate levels. This doesn't pair well with a QB in Teddy Bridgewater who is less likely to take chances throwing into tight coverage than other QBs around the league. We saw Alexander as a first-round talent, especially when playing man coverage, although he has the movement skills to play zone. His 0.66 yards per cover snap ranked No. 10 in the class. He was a value here, as the No. 21 player on our draft board. Beavers' -46.0 overall grade ranked last out of 258 qualifying offensive tackles in the draft class. Brothers posted a +25.2 grade against the run that ranked second in the class and his 15.8 run stop percentage finished first. Morgan had the top run-blocking grade among tight ends and he can see the field early in a specialist role.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2016,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "With so much talent on the board in the middle of the first round, drafting a safety that earned just the No. 93 grade in the nation is a curious move. Neal is a big hitter who will likely try to fill the \"Kam Chancellor role\" in Atlanta's defense as a safety who spends a lot of his time in the box, but players with his skill set are littered throughout the draft. The Falcons wanted to add speed to their defense, and they certainly need it, but Jones gets blocked far too often in the running game, and he missed one of every 6.5 tackle attempts — the 105th-best rate in the nation. His speed does not always translate into good play in coverage. Hooper brings a solid run-blocking option to the tight end position, and he's capable of making spectacular catches down the field. Campbell's +7.4 coverage grade ranked ninth in the class in 2015, while Schweitzer quietly ranked 11th overall in the draft class at +18.8 and his movement skills project well as a zone-blocking guard.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2016,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Carolina adds another option at defensive tackle, as Butler is strong against the run (+32.1 grade, fifth-best in the class in 2015). He can play up and down the line of scrimmage, and his 2015 improvement as a pass-rusher will give him a chance to see the field early. The Panthers added size to their defensive backfield with their two Day 2 picks, as they look to replace Josh Norman, who signed with the Redskins after being allowed to become an unrestricted free agent. Bradberry graded out right around average during Senior Bowl week. Worley's coverage grade ranked No. 31 in the draft class. He struggles with speed and quickness, leading to some ugly plays on tape. Sanchez finished with a -1.6 overall grade in 2015, 96th in the draft class. Sandland is an athletic projection at tight end.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The draft fell to the Saints perfectly in the first round, as they get a top-10 talent in Rankins. He posted the No. 3 grade among interior defensive linemen in 2014, behind only Henry Anderson (Colts) and Leonard Williams (Jets), both of whom played well as NFL rookies last season, and he showed similar production in 2015. Whether lining up head-up and taking on blocks in a traditional 3-4 DE role, or shooting gaps into the backfield in a traditional 4-3 DT role, Rankins adds a scheme-diverse, productive player to a Saints defense that graded very poorly in 2015. A poor QB situation hurt Thomas' numbers at Ohio State, but he's one of the best route runners in the class and he adds another good intermediate weapon to the Saints' passing offense. Bell posted a solid +7.4 coverage grade that ranked 12th in the class, and while he's not a great tackler, he can make the necessary plays in two-high coverage while dabbling in center field if necessary. The Saints took two good athletes with their only Day 3 picks, as Onyemata had a great showing at the East-West Shrine Game, finishing with five pressures. Lasco missed most of 2015, but in 2014 his finished 18th in the nation at +14.0 overall.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2016,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "We had Hargreaves going to the Bucs in our mock drafts quite a few times, and on Thursday the Bucs were able to trade back and still get their guy. Hargreave's movement skills are exceptional, as he can close on the ball as quickly as any corner in the draft, and he's excellent when playing the ball in the air. He took a step back in 2015, but Hargreaves posted the No. 2 coverage grade in the nation in 2014. Spence may be the best pure pass-rusher in the draft after he dominated Senior Bowl practice and notched seven pressures in the game. He's not great against the run, but it may not matter if he's productive off the edge. It is an incredibly risky move to take a kicker in the second round, no matter how good they think Aguayo is, with so much talent still on the board. That they traded up to do it makes the move even worse. Smith had two passes defensed on six targets in his two games against FBS competition in 2015. Benenoch has good straightline speed but he has to block better to stick in the NFL (-1.3, 61st in the class). Bond showed well on his 439 snaps last season, grading at +8.0 against the run and +3.8 in coverage.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2016,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Nkemdiche has interior pass-rush potential after grading at +23.4 as a rusher, ninth in the class. He's not great against the run, but if he can line up over tight ends on early downs before kicking inside to rush the passer, the Cardinals can maximize his value. A pure projection pick, Williams is an athletic former running back who graded at -5.5 overall last season, 117th in among the cornerbacks in the draft class. His production simply didn't match his athletic reputation. Boehm struggled in pass protection as his -7.9 grade ranked 57th among 63 qualifiers in the class. Arizona rounded out the class with two small-schoolers who struggled at the Senior Bowl in Toner (-2.6) and Miller (-1.0).",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2016,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Rams made the move up to get their franchise quarterback, and they got the best QB in the draft in Goff. Our top-graded FBS quarterback brings a lot of translatable skills to the table, from intermediate and deep accuracy to his handling of pressure to his excellent pocket presence. Goff has improved every year, and he's still filling out his frame, so given his base of NFL skills, he should continue to get better. Off-field issues aside, Higbee originally had a second-round grade as his +7.9 receiving grade ranked third in the class. He's one of the most athletic options in the draft and he can become an intermediate weapon for new QB Jared Goff. Cooper can start out as a gimmick player, but he accelerates quickly and can become a vertical option from the slot, pairing well with Goff's skillset. Thomas is one of our favorite picks in the draft as the No. 38 player on the PFF draft board has great body control and he won contested catches at a higher rate than the other top receivers in the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2016,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "One of the best picks in the draft, the 49ers took the No. 2 player on the PFF draft board in Buckner, a he happens to be a perfect fit for their 3-4 scheme. He's a disruptive presence against the run, grading at +29.8 last season (eighth in the class), while leading the nation with a +43.8 pass-rush grade. Buckner rarely came off the field for Oregon, playing more snaps than any interior defensive lineman in the nation and he was able to maintain his production throughout the season. San Francisco then traded back into the first round to secure the top run-blocking guard in the draft in Garnett. He is excellent on the move and despite some question marks about his pass protection, he should be a good fit in Chip Kelly's scheme. Redmond is a solid zone defender who is quick to read and break on the ball, although that aggressiveness can get him into trouble at times. His +1.6 coverage grade ranked No. 56 in the class. Robinson didn't play in 2015, but his length and speed made him a coveted mid-round option. Blair's +42.7 overall grade ranked 13th in the draft class, as he can make plays against the run and as a pass rusher though he has to get stronger at the point of attack in the run game. Driskel took a huge step forward this year for Louisiana Tech as his +22.0 passing grade ranked 11th in the class and his athleticism is a good fit for Chip Kelly's system. His former teammate at Florida, Kelvin Taylor, made the most of subpar blocking at Florida to finish with the No. 7 run grade in the class at +19.4. Burbridge doesn't separate well, but he can make contested catches and he caught 64.0 percent of his deep targets, fourth-best in the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2016,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "We saw Ifedi as more of a mid-round developmental option, even though he has the size, length and athleticism that coaches covet. He had some ugly plays in pass protection, finishing with the No. 67 grade in that area in the draft class. He was better in the running game, ranking No. 23 in the class, but he has a ways to go to live up to his first-round selection. The Seahawks really need to improve their line play, as Russell Wilson was under pressure at the second-highest rate of any NFL QB last season. Reed posted the No. 2 grade against the run last year, disrupting blockers and making plays. He's technically sound and can see the field immediately on run downs. Prosise had an impressive performance at running back last year, earning the 10th-best grade in the class. Vannett offers value as a blocking \"move\" tight end, while Odhiambo's movement skills fit in at guard in Seattle's zone scheme – even though he did whiff on too many blocks in the run game (-2.2 run-block grade). Jefferson made plays against the run in 2015, finishing with a +17.8 grade that ranked 23rd in the class though he can get moved off the point by double teams. Collins graded at +16.1, good for ninth in the class and his 58 missed tackles forced ranked third. He does a nice job maximizing his blocking though he lacks breakaway speed. Hunt is an undersized center, but his good movement skills make him one of the better zone-blocking centers in the draft. His +26.5 overall grade ranked fourth in the class.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2016-nfl-draft-grades-for-all-32-teams",
    "playerGrades": []
  }
]