[
  {
    "teamName": "Arizona Cardinals",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They landed a future star in first-round pick Haason Reddick. He will add speed and versatility to their defense. I love second-round pick Budda Baker, the safety from Washington. He will help offset the loss of Tony Jefferson. Third-round pick Chad Williams, a receiver from Grambling, could be a steal where he was drafted, adding much-needed speed, and I love fourth-round pick Dorian Johnson. It was a really good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Falcons wanted to get an edge rusher, and they got a good one in UCLA's Takk McKinley in the first round, which was an outstanding pick. They came back and added a speed linebacker in LSU's Duke Riley in the second round and a much-needed guard in Sean Harlow from Oregon State, who should be the starting right guard. They got faster on defense, which is not a good thing for NFC South quarterbacks.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Did they really need a corner in the first round? I know they stuck to their board by taking Alabama corner Marlon Humphrey, but I thought they had bigger needs. They came back to make up for it by taking Houston edge rusher Tyus Bowser in the second round and Michigan defensive tackle Chris Wormley in the third. Fourth-round rusher Tim Williams could be a pass-rush star -- if he can stay out of trouble.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I think they made really good picks with their first two, trading down in the first before taking LSU corner Tre'Davious White, then landing East Carolina receiver Zay Jones in the second. Their other second-round pick, Dion Dawkins, will probably be the starting right tackle. Fifth-round quarterback Nathan Peterman could end up being a potential starter down the road.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They were linked to Stanford running back Christian McCaffrey in the first round, and it played out that way. I think it's too high to take him at No. 8, but he will help in a lot of ways. Second-round pick Curtis Samuel can do a lot of the same things, and will likely be their slot receiver. I love the pick of Texas A&M pass rusher Daeshon Hall in the fourth. He will develop into a quality pass rusher. Fifth-round corner Corn Elder will be a good nickel corner.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2017,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They made a strange move to give up so much to move up a spot to No. 2 overall and draft North Carolina quarterback Mitchell Trubisky. They could have stayed in their third spot and landed him, but gave up too much to move up a spot. If he's a star, they will be laughing at all us. But why give Mike Glennon that contract if this was what you planned to do? Second-round tight end Adam Shaheen from Ashland is a big, physical tight end. But this is all about Trubisky and that trade.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I thought the Bengals had as good draft as any team in the league. Taking receiver John Ross with the ninth pick is a bit of a risk, but you can't coach speed. They took a different type of risk with Oklahoma running back Joe Mixon in the second round, but the kid is the best runner in the draft. They clearly looked past the assault video to take him. They then landed two good pass rushers in Kansas State Jordan Willis and Auburn's Carl Lawson, two players who will compete to start at right end. Fourth-round receiver Josh Malone from Tennessee can fly. There are some risks here, but I think they will pay off big.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "For all the criticism of the analytics crew in Cleveland, they had a heck of a draft. Aside from trading down to get Michigan's Jabrill Peppers in the first round, they added a lot of really good players. They had a lot of picks and did some good things. They got the top player in the draft in Myles Garrett with the first pick, and then continued to do a nice job. Tight end David Njoku was a nice add with their third first-round pick. This draft, though, will be defined by how well second-round quarterback DeShone Kizer develops. If he is their starter for a long time, this will be a great draft. Right now, it's a damn good one.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They needed help up front, so taking Michigan defensive end Taco Charlton makes sense, but I think there were better options at that point. I think they bounced back and got two good corners in the next two rounds in Colorado's Chidobe Awuzie and Michigan's Jourdan Lewis, which help a position of need. Taking Ryan Switzer in the fourth round could mean Cole Beasley may be out next year when his contract is up.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They needed help up front on the offensive line and landed a solid left tackle in Utah's Garett Bolles. He is older at 25, and he is raw, but he plays with a nasty streak. Second-round defensive lineman Demarcus Walker will be a nice addition up front. It's clear they want receiver help, taking two in the first five rounds, and I like third-round receiver Carlos Henderson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2017,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "First-round pick Jarrad Davis is a nice three-down linebacker who will fill a major need, so that pick is solid. But this is a team that had major pass-rush issues last season, and they waited until the sixth round to take a defensive lineman. That's not wise in a division with Aaron Rodgers. Second-round corner Teez Tabor was a reach at that spot. I just didn't think it was a good haul for the Lions.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Some general managers seem to always do it right in the draft, and Green Bay's Ted Thompson is one of those guys. He had another good draft, trading out of the first round and still landing a lot of good players. He took Washington corner Kevin King in the second round, and he will be a big-time player. Second-round safety Josh Jones is a nice player who helps offset the loss of Micah Hyde. I love third-round defensive tackle Montravius Adams. Fourth-round running back Jamaal Williams will be a 1,200-yard rusher in a season at some point in his career.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2017,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They made the bold move to go up in the first round to No. 12 to get quarterback Deshaun Watson from Clemson, which is a smart move -- but a risky one. How will he fit in Bill O'Brien's offense? It's smart to take the shot. Second-round linebacker Zach Cunningham was a nice hit after being a big-time player in the SEC. They added some line help later on both sides of the ball. This draft will be all about Watson. If he is what they think he can be, it's a major hit. If not, it will be a big whiff.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They needed to get defensive help, and they used their first three picks on that side of the ball. First-round safety Malik Hooker is a rangy player in the Ed Reed mold, which they needed. Second-round corner Quincy Wilson is a nice cover player who will start right away, and third-round defensive end Tarrell Basham should help the pass rush. I like fourth-round running back Marlon Mack a lot. He has big-play ability.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Leonard Fournette, their first-round pick, is a nice player, but I just don't think you take backs as high as No. 4. After that, they did a nice job trading up for tackle Cam Robinson in the second, and third-round pick Dawuane Smoot will be a steal. Fourth-round receiver Dede Westbrook will add speed to a pass-catching group that needs it, but he does have baggage.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "I think Texas Tech quarterback Patrick Mahomes will be the best quarterback in this class, so from a talent standpoint making the move up in the first round to get him makes sense. Second-round defensive end Tanoh Kpassagnon from Villanova is a raw player, but they need down help. I really like third-round running back Kareem Hunt from Toledo. Fourth-round receiver Jehu Chesson will help the passing game. This is a draft that will be all about Mahomes, but we won't know that answer until years in the future.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I didn't love taking receiver Mike Williams that high in the first round, but I think they had a really good draft in the next four rounds. Williams doesn't separate enough for my liking. They upgraded their offensive line with Forrest Lamp and Dan Feeney and added two other weapons for Philip Rivers and two quality safeties. Nice job. Taking Williams too high drops it down from an A for me.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2017,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They traded their first-round pick last year to get quarterback Jared Goff, so they had to wait until the second round to pick. When they did pick, they seemed to focus on helping Goff. Their second-round pick was tight end Gerald Everett, and they followed that up with Eastern Washington receiver Copper Kupp in the third and Texas A&M receiver Josh Reynolds in the fourth. They didn't take an offensive lineman, which was strange.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Dolphins did a nice job with their draft, landing pass rusher Charles Harris in the first round. He fills a need, and he's a productive player. Linebacker Raekwon McMillan brings some speed to a group that needs it. Adding corner Cordrea Tankersley in the third round and guard Isaac Asiata are also good picks and fill needs. It was a good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2017,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They didn't have a first-round pick after trading it last year to get quarterback Sam Bradford, but they got a first-round talent in the second round in running back Dalvin Cook. If he can stay away from the issues that had many dropping him down, he will be a steal. Upgrading their offensive line with Ohio State center Pat Elflein in the third round was a good pick. They added some weapons with a chance to help the passing game in the later rounds, including fifth-round receiver Rodney Adams from South Florida.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They didn't have a pick in the first or second round, since they traded them away to get receiver Brandin Cooks and pass rusher Kony Ealy. They are part of this class, which will bring up the grade. They got a solid pass rusher in Youngstown State's Derek Rivers in the third and tackle Antonio Garcia will be the guy who takes over for Nate Solder next year when his contract is up. They also gave up a fifth-round pick to sign Bills running back Mike Gillislee as restricted free agent. If Ealy can get them 8-10 sacks, this will be a good haul with their picks. If not, it will be just solid.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They probably thought they had no chance to get Ohio State corner Marshon Lattimore when the draft started, but they end up getting him in the 11th spot. That was a nice pick of the top corner. I didn't love the pick of Wisconsin tackle Ryan Ramczyk with the 32nd pick -- he has some medical issues and is that really a major need? -- but they added some nice players later in Utah safety Marcus Williams in the second and pass rusher Troy Hendrickson in third. I also think third-round linebacker Alex Anzalone from Florida has a chance to a long-time starter if he stays healthy. That's a big if, based on his career.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2017,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They used their first-round pick on tight end Evan Engram, a nice weapon for Eli Manning, but they needed help up front. I would have gone with an offensive lineman. I love second-round pick Dalvin Tomlinson, a defensive tackle from Alabama. I also like Davis Webb as a potential starter, but I think this team is built to win now with Manning's years coming to an end. Why not take another player who can help now? Fifth-round pass rusher Avery Moss is intriguing and has a lot of ability.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2017,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They landed a gem in first-round LSU safety Jamal Adams, but why come back and take safety Marcus Maye in the second? There were other needs. They did get two receivers with their next two picks, and I really like Cal's Chad Hansen in the fourth. Sixth-round runner Elijah McGuire could be a steal in that spot. I expected more out of this class.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "There was some risk in them taking Ohio State corner Gareon Conley in the first round with his legal situation pending, but he is a top talent and could pay off big. The next three picks could also be big-time steals. Second-round safety Obi Melifonwu had first-round talent, and if UCLA defensive tackle Eddie Vanderdoes can keep his weight in check he will be a good player. They needed some help up front, so he made sense.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I really like the choice of pass rusher Derek Barnett in the first round. He might be the best pass rusher in this class. They took a risk with Washington corner Sidney Jones in the second, but it could be a big-time payoff if he comes off a torn Achilles tendon healthy. They added some young weapons for Carson Wentz in the later rounds. Fifth-round receiver Shelton Gibson can fly.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "First-round pick T.J. Watt is a player who is a perfect fit for the Steelers' scheme. His best football is in front of him. I thought second-round pick JuJu Smith-Schuster went a little high, but third-round corner/safety Cam Sutton was a really nice pick. The best story of the draft is the pick of third-round runner James Conner out of Pittsburgh. This is a kid who overcame cancer. Love that.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "First-year general manager John Lynch killed it in his first draft, trading down one spot with the Bears in the first round and picking up a bounty of picks. That was a fleecing. Then they took Solomon Thomas with the third overall pick, and he is a future star. They next traded back into the first to get linebacker Reuben Foster with the 31st pick, and he will be a steal. I thought taking quarterback C.J. Beathard in the third was too high, but it was good first draft for the 49ers. Watch out for sixth-round defensive tackle D.J. Jones from Mississippi. He could be a steal.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They traded out of the first round and added picks, then general manager John Schneider did a really god job with the extra ones. They had a nice couple of days. Second-round pick Malik McDowell has first-round talent, and will be a nice addition. Second-round offensive lineman Ethan Pocic can play a bunch of spots, which they like up front. They then sent messages to the Legion of Boom by drafting a corner and three safeties. Schneider knows how to keep a handle on his roster by making moves like that. One knock: Maybe one more offensive lineman would have helped.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They landed perhaps the cleanest player in the draft with their first pick in tight end O.J. Howard, giving Jameis Winston another top weapon. Second-round safety Justin Evans will push to start right away, and third-round receiver Chris Godwin can fly. Fifth-round running back Jeremy McNichols from Boise State is a good runner who could be a nice surprise.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Titans wanted to get a receiver and corner with their first two picks, and they did that. They got the best receiver in the draft in Western Michigan's Corey Davis with the fifth overall pick. They then came back and got USC corner Adoree Jackson with their second first-round pick. It was a nice one-two hit. They added another receiver (Taywan Taylor) and a tight end (Jonnu Smith) to give Marcus Mariota some more weapons.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Although they don't have a true general manager, the Redskins had a nice draft haul. With their first two picks, they picked two good Alabama players. They got lineman Jonathan Allen in the first and pass rusher Ryan Anderson in the second. Those were two need spots. Allen was really a steal at No. 17. They also got first-round talent in UCLA corner Fabian Moreau, who dropped because of a torn pectoral muscle. Fifth-round tight end Jeremy Sprinkle is an in-line tight end to go with Vernon Davis and Jordan Reed.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-grades-for-all-32-teams-five-earn-as-and-two-fall-short-with-ds/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Instead of taking Patrick Mahomes as the quarterback of the future, they moved down 17 spots in the first round, allowing Kansas City to make the pick. They received a third-round pick this year and a future first-rounder for the move down. Buffalo selected a good corner in White with the 27th pick to take over for Stephon Gilmore, meeting a dire need. Well done. Buffalo certainly required help at the receiver position, and Zay Jones was the best value at the spot. In fact, they thought enough of Jones to swap a third- for a fifth-round pick in the process. They found excellent value in guard/tackle Dion Dawkins, who deserved to be picked higher. The Bills found an excellent quarterback in round five, as Nathan Peterman should have gone a round or two earlier. Sixth-round pick Tanner Vallejo is a special teams ace and will find his way on the field on defense.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Miami definitely needed to get younger in its pass rush, so seeing Harris on the board was a godsend. He'll need to improve against the rush to be an all-around player on the edge, but the pick will still be very good if he can make an impact attacking the quarterback sooner than later. Finding a linebacker of Raekwon McMillan's stature in the second round was a steal. Clemson's Cordrea Tankersley has a chance to start in Year Two for the Dolphins, as well -- he was an excellent pick. With Laremy Tunsil moving outside in 2017, the Dolphins found an immediate starting guard in Isaac Asiata in the fifth round. Godchaux bolstered the defensive line depth on Day 3.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They chose Derek Rivers from Youngstown State, an exciting pass rusher with stand-up/hand-down versatility. Troy's Antonio Garcia is a project guy who should help once Nate Solder moves on. Brandin Cooks is as good of a player as any pick they'd have found with the No. 32 pick that they traded to the Saints. However, if they don't re-sign him to a long-team deal, then giving up a first-round pick was not a wise investment. New England used its fifth-round pick to pick up restricted free agent Mike Gillislee, adding to the running back committee. The value of that pick will be determined by the number of carries he actually sees -- there's a lot of bodies there. Deatrich Wise fits the Pats' defense very well, and should succeed if putting forth consistent effort. Moving up in the sixth round to pick tackle Conor McDermott was a great move; he'll at least be a solid swing tackle.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Jamal Adams is an excellent, hard-nosed stud who presents great leadership qualities. He was best player available early in the first, and they made the right call. The Jets apparently weren't happy with their safety group, as they picked up the ultra-talented Marcus Maye in the second round. The question is, did they need to pick another safety when the team has many other needs? Finding a starting receiver in ArDarius Stewart in the third round will be viewed as a good pick sooner than later. Former Cal receiver Chad Hansen made amazing catches in 2016, but will he be physical enough against veteran NFL corners? That pick was probably a round early, especially with other needs still on the table. Selecting tight end Jordan Leggett in the fifth was a good move, even if he is more of a straight-line runner than elite in his agility. They finally addressed cornerback later on, but it was a bit late. Also, they didn't address the quarterback position or the offensive line.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Ozzie Newsome once again went back to his old school, picking cornerback Marlon Humphrey. The corner's physical play and better-than-expected long speed locked up a mid-first-round pick. Tyus Bowser isn't known nationally, but he has great athletic ability and can rush the passer -- something the Ravens need with Terrell Suggs aging. The Ravens picked up a great five-technique prospect in Chris Wormley in the third round. Coaching up Tim Williams to become the pass-rusher talent his potential portends would make him a third-round steal like Justin Houston. Nico Siragusa was such a Ravens pick; he's a future starter (maybe immediate) at guard. Jermaine Eluemunor has potential inside, as well. The team didn't select any receivers, though, which they could use.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Ross is a talented, extremely fast receiver (4.22 40), but given Ross' injury history, it's tough not to consider that when making him a top-10 pick. Nonetheless, adding Ross to play alongside A.J. Green and Tyler Eifert makes quarterback Andy Dalton smile. It wasn't a surprise to see Joe Mixon land in Cincinnati, given that they've taken on players with character concerns before. Jordan Willis fell to the middle of the third round, and the Bengals took full advantage. He's a damn fine player who should have went earlier. The Bengals again selected a talented player with question marks in linebacker Carl Lawson; his injuries and inconsistency made him fall, but as a designated pass rusher he'll be just fine. Adding speedy receiver Josh Malone to Mixon and Ross makes the team dangerous; Andy Dalton is a happy man. They went with a solid football player in Glasgow in the late fourth; he could play offensive (like his brother, Graham) or defensive line. Getting a reliable kicker was a good move in the fifth round, and J.J. Dielman will be a long-time pro who can play anywhere on the offensive line.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Picking Myles Garrett as the difference-maker on defense made a world of sense. When looking at the second first-round pick, however, one has to remember that the Browns passed on Carson Wentz to acquire the pick. They did get an excellent safety in Jabrill Peppers. He'll be a team leader for the Browns with the athleticism to handle nickel and safety. Njoku is a playmaker, and they picked up a 2018 first-round pick in a trade on Day 1. That's a great night for Browns fans. Instead of picking a quarterback on Day 1, the Browns took a potential starter in the second round in DeShone Kizer. It's a good long-term investment worthy of the pick. Larry Ogunjobi is a very quick tackle who will earn the respect of interior offensive linemen in a hurry; I'll be interested to see if he can play three downs. Cleveland continued to find talent in Rounds 4-5. Cornerback Howard Wilson is a confident corner, though his athleticism is only average. Left tackle Roderick Johnson's length will serve him well once he builds strength to go along with it.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The fact that T.J. Watt was available for the Steelers was amazing. He's a war daddy, and Pittsburgh can play him inside or outside for years. This was one of those picks where everyone will wonder in four years how Watt dropped this far. Many Steelers fans told me the team wouldn't take a receiver early; well, Kevin Colbert thought differently. JuJu Smith-Schuster is a very strong receiver who will be the physical pass-catcher the team needs. They could have used a pick on defense again, however, and found another receiver late in the draft. Colbert did get a corner/safety in Cameron Sutton who should become a starter down the line. It's hard not to be happy for cancer survivor James Conner, but defenders won't be happy when trying to tackle this Steeler running back. I love the pick of Joshua Dobbs in the fourth round, with Big Ben going year-to-year from here on out. Cornerback Brian Allen is the next long, tall Utah cover guy with great potential, and getting long, athletic Western Michigan pass rusher Keion Adams late in the seventh will pay dividends.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2017,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Deshaun Watson was an excellent college quarterback, and the Texans are hoping he becomes a great NFL quarterback. I'm with Bill O'Brien on this one, even though Houston parted with a 2018 first-round pick in trade up to get him. With Houston's defense playing well, they needed a leader and playmaker to get the offense rolling. Houston found the inside linebacker of the future with Zach Cunningham, a Daryl Washington-type defender who should be around for a while. They needed to find a running back, so they headed to Austin to pick up D'Onta Foreman, who could be a force if his weight is under control. The Texans need immediate offensive line help. Davenport might be a year or two away from that, but it was a solid value in the fourth round. Carlos Watkins is a talented defensive lineman with a good motor, and could play five-technique as well as inside for Houston. The Texans found an interesting long, physical corner in Treston Decoud; they desired depth at corner coming into the event.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "In the first round, the Colts got the rangiest safety prospect since Earl Thomas. They got very good value at No. 15 at a major position of need. It's a big win for the Colts' defense. Indianapolis had to be thrilled to get Quincy Wilson to help out Hooker in the secondary. Tarell Basham is a pass rusher who can covert power to speed on the edge; getting him in the third was a good deal. Indianapolis made very good back-to-back picks in the late fourth with running back Marlon Mack (slasher with more power than you'd think) and defensive tackle Grover Stewart (nose tackle with good footwork). Zach Banner was a stretch in the fourth round, though he could be a D.J. Fluker or Orlando Franklin-type guard. In the fifth, Anthony Walker provides strength in the middle of their defense. This was a well-executed draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Blake Bortles' development will be aided by Fournette's. Fournette's injury history is a bit worrisome, but the same was said about Adrian Peterson -- that turned out well. But will he be able to succeed like last year's No. 4 pick, Ezekiel Elliott, without a similarly talented offensive line? Cam Robinson is a beast, and will be a longtime starter inside or outside for Jacksonville; giving up a sixth-round pick to get him in the second round was no sweat. Duwuane Smoot from Illinois has strength and flashed off the edge, a solid pick in the early third round. Dede Westbrook is elusive and fast, but he fell to the fourth round due to off-field issues and a slight build. He's not contact-shy, though -- he'll play tough. The Jags got faster with linebacker Blair Brown and corner Jalen Myrick.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Corey Davis is a really good player who deserved to be picked early. However, anytime you pick a player with an injury (Davis is coming off ankle surgery) at No. 5, there is a slight concern (thus the A-minus). Still, I expect he'll be a big-time receiver. Jackson has some work to do at cornerback, but he can learn and he's explosive as a returner. Taywan Taylor adds solid hands in the receiving corps for the Titans, who apparently wanted to re-make their receiving corps at the expense of other positions. They continued to help the offense with tight end Jonnu Smith, another Jordan Reed-type match-up issue. Smith was likely picked a bit early. The Titans picked up an athletic linebacker in Jayon Brown, who can play inside in coverage. Corey Levin and tackle Brad Seaton were fine interior line depth selections from small schools in the sixth and seventh rounds -- they both have starter qualities. Taywan Taylor adds solid hands in the receiving corps for the Titans, who apparently wanted to re-make their receiving corps at the expense of other positions.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Garett Bolles is an athletic, tough-minded player. He's also an older prospect who has lived through a lot. Some teams have concerns about his ability to handle complex line adjustments. The team certainly needed a left tackle, but Ryan Ramczyk was also available here. It will be interesting to compare the careers of those two players. Though DeMarcus Walker didn't get a lot of love after his big first week in 2016, his power and hustle make him a great pass rusher. They got a good receiver in Carlos Henderson in the third round, one of the toughest pass-catchers to tackle in the draft. Bolstering the team's cornerback depth was a major need, so picking up intriguing former FBS cornerback Brendan Langley was worthwhile. Denver ended the draft with a bang -- taking Chad Kelly at Mr. Irrelevant. Kelly's potential makes him a non-irrelevant selection. There's no reason not to make that pick given his arm strength and football acumen -- if he can calm himself and focus on the task at hand. The Broncos' first pick of Day 3 was the top selection in the fifth round, tight end Jake Butt. He should be a solid starter when he recovers from his bowl game injury. They picked up an extra fifth from Cleveland in an earlier deal. Late-round running backs De'Angelo Henderson and Matt Dayes will make an impression in training camp.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Chiefs GM John Dorsey and head coach Andy Reid saw Brett Favre in Green Bay, and they have to see some of that gunslinger attitude in Mahomes. There is a risk factor here given his penchant for throwing the ball anywhere and from any arm angle (which will turn into interceptions in the NFL), and they have up a future first-round pick to get him. But if anyone can get Mahomes to adjust and succeed, it's Reid. Villanova doesn't put out a lot of top football players, but the Philadelphia crowd love seeing Tanoh Kpassagnon get picked. He's a very good five-technique with a lot of upside. The Chiefs got a starter in Kareem Hunt, an all-around player who can do it all. Patrick Mahomes has all of the tools to be a great quarterback. The Chiefs continued to move up and down the board on Day 3. Jehu Chesson was inconsistent in his senior year, so I might have waited a bit to pick him given the other receivers available. They also gave up a fifth-round pick to pick him, which isn't a premium selection, but would have helped with depth. Kansas City didn't select a cornerback with some size, which would have helped this season.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Mike Williams is a physically dominating receiver who will make life easier for Philip Rivers. He has enough speed to make plays, as well. Keenan Allen's injury forced the team's hand, as well. It will be interesting to see where second-round pick Forrest Lamp plays for the Chargers; he would be an excellent center. It was an excellent value pick. The Chargers again bolstered the interior of the line with Dan Feeney, who will play guard to protect Philip Rivers and block for Melvin Gordon. Hitting two interior linemen that early is a bit of a knock, as they need safety and linebacker help. The Chargers' safety group needed an upgrade. Desmond King (fifth round) and Rayshawn Jenkins (sixth) should help in that effort. Finding an aggressive swing tackle in Sam Tevi in the sixth was a nice find, and adding versatile 3-4 lineman Isaac Rochell in the seventh was a solid pick.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "As long as Conley's off-field issues are cleared up, the Raiders got the long, agile, ballhawk they needed. If he gets in trouble, then GM Reggie McKenzie will have to answer for the pick. The Raiders are in love with long, athletic secondary members. Obi Melifonwu is a hard-hitting guy with nice speed that Al Davis would have loved. If Oakland gets the junior-year Eddie Vanderdoes, they'll like his interior push; if he's the 2016 Vanderdoes, they might not like what they see. Oakland needed to get better on the offensive line, but David Sharpe must prove he can move with NFL-caliber players on a down-by-down basis. If he can, his length and size make him tough to get around. They met their inside linebacker need with Marquel Lee from Wake Forest in Round 5. Oakland didn't ignore the running back position despite signing Beast Mode -- Elijah Hood is a banger, as well.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Dallas had a choice between Charlton and T.J. Watt. Either could have fit their bill, and the need was certainly there. I had Watt with a higher grade, but Charlton's length and agility are impressive. He'll be a very good player for Jerry Jones and Jason Garrett. The Cowboys found another corner/safety combo in Chidobe Awuzie, and got great value in doing so. They again helped the secondary with a tough-minded slot starter in Jourdan Lewis; this makes sense given the team's interest in trading Orlando Scandrick. Dallas picked up Cole Beasley 2.0 in Ryan Switzer.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Jerry Reese continued to add to Eli Manning's arsenal with tight end Evan Engram. He's a Jordan Reed clone who will make plays, but will he outshine another intriguing tight end, David Njoku? That will be the question going forward. The Giants picked quarterback Davis Webb, who is at worst a solid backup for Manning, and possibly a future starter (for the Giants or someone else via trade). The team loves big bodies with good motors; picking Dalvin Tomlinson fits that bill, though time will tell whether he'll be enough of a playmaker to earn a second-round slot. Wayne Gallman isn't great at any one thing, but is a tough guy who will do well with Giants fans for his strength. He and Paul Perkins could be a nice duo in the future. Giants fans will like what Avery Moss can do off the edge at defensive end. Adam Bisnowaty should help their tackle situation, though he's not elite in his pass protection skills.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Even though the Eagles gave up their 2017 first-rounder for quarterback Carson Wentz, they were a beneficiary of Minnesota's need for a quarterback, as they got back into the first round by trading Sam Bradford last year. The way Wentz played this year showed they didn't really miss Bradford. They got the second-best pure edge rusher in the draft in Barnett at No. 14. In the second round, Philly got a first-round value in Sidney Jones, who might have to half-redshirt the year as he recovers from injury but will be a good corner down the road. Rasul Douglas is another long corner who will be on the field right away. Mack Hollins is very good downfield receiver, and a very good special-teamer as well. That's the prototypical fourth-round pick. He and Shelton Gibson (fifth round) add receiver depth. Pumphrey's electric with the ball, not unlike veteran Darren Sproles (though not as thick and powerful). Elijah Qualls was a fine selection in the seventh round.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Allen's shoulders might be an issue six or seven years from now, but the Redskins needed a big-time talent up front right now. Excellent value. The Redskins went back-to-back 'Bama defenders in the first and second, picking up Ryan Anderson in the second. While he's not the most athletic linebacker in the class, Anderson is all hustle and plenty quick enough to corral ball carriers outside. Good pick. Next, they took a value pick in the mid-third with Fabian Moreau, a cornerback who was injured at his pro day but has starter traits. Washington did well building off former GM Scot McCloughan's draft board. It was a fitting fourth-round pick when they got a thick, short-area quickness power back like Perine, given that RB Matt Jones is on the trade block. Don't sleep on sixth-round, large-framed receiver Robert Davis. They didn't pick a quarterback, though, when Nathan Peterman and others were available -- which could cause issues if Kirk Cousins leaves.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2017,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Bears weren't satisfied with Mike Glennon as their quarterback of the future, so they picked up Mitchell Trubisky. They gave up a 2017 third- and fourth-rounder, and a 2018 third-round pick to get him. That's not terrible in terms of what other teams have given up to get their quarterback of the future; other teams have given up first-round picks to pick their guy. They had to move up one spot to get him, though, because other teams were looking at that pick -- or at least that's what San Francisco told them. Adam Shaheen wasn't a big name, but older Bears fans might think of Mike Ditka's game when they see the young man blow up defenders. Chicago took a chance on Alabama safety Eddie Jackson early in the fourth, hoping he returns from injury and can improve his tackling. Tarik Cohen is a tough tackle at running back, and it will be interesting to see if he gets special teams work.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2017,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Lions were desperate for an upgrade at linebacker, and they got a very good one in Davis. His athleticism and toughness are evident. If he can stay healthy and be an instinctive leader in the middle, Detroit is set at the position for a while. Teez Tabor is a first-round player with a third-round 40-yard dash, so picking him up in the second round made a lot of sense. Kenny Golladay is an interesting receiver, but was probably selected a round early, maybe two. Adding Reeves-Maybin brings quickness to the second level of the defense, though we'll see if he can stay healthy enough to earn a fourth-round selection. Detroit gets a red-zone target in tight end Michael Roberts. Jeremiah Ledbetter will give the Lions some pass rush. Good flier on Brad Kaaya in the seventh -- it's a \"Why not?\" pick.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Browns presented Green Bay excellent value in a trade out of the first round, so the Packers took it. Instead of trading down for more picks, Ted Thompson stayed put and got the difference-making cornerback he needed in Kevin King. Then they selected safety Josh Jones, who will play in the Micah Hyde role for the Packers despite being a solid 220 pounds. Bulking up the defensive line with Montravius Adams is a big help, as he can play nose tackle or five-technique. He's an excellent value at No. 93. On Day 3, Green Bay continued to improve the defense. Vince Biegel is a solid inside/outside linebacker, which they needed. They also found an excellent replacement for power back Eddie Lacy in Jamaal Williams, and then hit the position twice more with UTEP's Aaron Jones and Devante Mays. That's probably overkill for a position where there will be plenty of undrafted free agents available. Receiver DeAngelo Yancey was one of the hottest names among prospects who weren't invited to the combine this year.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Vikings traded their 2017 first-rounder for Sam Bradford last year. He didn't lead the team to the playoffs despite a pretty good defense, but he was a solid pickup considering the situation the team was in after Teddy Bridgewater's injury. With better weapons around him, Bradford could be even better -- if he stays healthy. Minnesota didn't have many picks to start with, and then they traded a fourth-round pick to move up to get Dalvin Cook. Cook's talent was worthy of a top pick, so it's hard to blame Rick Spielman for this move. Without Adrian Peterson, a bold move was needed. Hopefully, the concerns that dropped Cook to the second were much ado about nothing. Pat Elflein will provide strength in the middle of the offensive line for years to come. Getting Jaleel Johnson early in the fourth is a smart move. He'll control the line of scrimmage -- just like fifth-round future starting guard Danny Isidora. Bucky Hodges is a receiver/tight end 'tweener, but his hands are great and he can win vs. linebackers; that's a good sixth-round pick. Elijah Lee presents inside and outside talents at linebacker, another excellent late-round selection.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Takkarist McKinley and Vic Beasley will make it difficult for Tom Brady (or anyone else) to pick apart the Falcons' defense in the second half as he did in the Super Bowl. They chose to given up a third round pick, but it's hard to blame them with the Cowboys, Steelers, and Packers ahead of them -- they were all looking for edge guys. Duke Riley joins former teammate Deion Jones in the linebacking corps, a good pick-up to keep the speed coming. It was a good Day 3 for the Falcons. Sean Harlow is an agile and strong guard who will start right away (which they need). Damontae Kazee is a great value in the fifth round as a tough slot corner. Getting a pass-catcher like tight end Eric Saubert could pay off in a year or two.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Christian McCaffrey is a great football player, not just a great receiver or running back. The Panthers got their guy and didn't have to move up to get him. Curtis Samuel is another versatile player for the Panthers, whether he plays at running back or receiver. Offensive tackle was a big need for Carolina, and Western Michigan's Taylor Moton is one of the better right tackles in the draft. Daeshon hall is a pass rusher who fits the Panthers' mold. They gave up a fourth-round pick, though, to get him, which might not have been necessary. Getting Corn Elder in the fifth round of the draft was an absolute steal; he's a competitive, tough corner who plays bigger than he appears.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Lattimore is the best cover man in the draft, and a no-brainer at No. 11. Then, instead of continuing to bolster the defense, they improved the offensive line by picking up-and-coming left tackle Ryan Ramczyk. But should they have helped their defensive front instead? The Saints got a safety to own the back half in Marcus Williams, an athletic and hard-hitting player from Utah, and then they found running back Alvin Kamara waiting for them. They traded away a future second-round pick to get him, though. Not sure I love the future pick trade, though Kamara's a very good player. Alex Anzalone has great potential as a cover linebacker and blitzer, but he needs to stay healthy. New Orleans' pass rush got an upgrade with a hustling, powerful guy in Trey Hendrickson. He was a good value in the third round. New Orleans had only one pick on Day 3: Al-Quadin Muhammad, who is an underrated pass rusher, which the Saints truly need.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The fact that O.J. Howard was on the board for the Buccaneers was ridiculous. He's a future Pro Bowler, and will make life much easier for quarterback Jameis Winston as a great safety valve. He and Cameron Brate will be a tough duo. Safety Justin Evans made a big splash early in his senior year, then fell off with some missed tackles. He could be a good player, but I think it's a round early for him. Adding Chris Godwin to the receiving corps was nice, but other needs should have taken precedence. Selecting LSU's Kendell Beckwith helped out the linebacker group. He should be a fit on the strong side. They only gave up a sixth-round pick to get him, and would have paid more if waiting until Saturday morning to make that move at the start of the fourth round. The Buccaneers addressed their running back need with Boise State's Jeremy McNichols, a potential Jordan Howard-type impact player. There was no help for the offensive line or pass rush, though, which was a bit surprising.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Haason Reddick is a very good linebacker and gives the Cardinals an infusion of youth at a position where they needed it. With the top receivers off the board, the Cardinals chose the best player available. Reddick can also be an effective pass rusher from outside or on inside blitzes. Budda Baker is an excellent football player who can cover and tackle, but they gave up three picks to land him. That lowers the grade a little, but putting him with Tyrann Mathieu is going to be a lot of fun to watch. Grambling receiver Chad Williams might have been a top-50 pick if he played at a major college, so it might be a bit of a gamble, but it's one worth taking. I believe fourth-round selection Dorian Johnson will be a long-time starter at guard, but there is a bit of risk given his health situation. They got good value on Day 3, but not selecting a quarterback is a bit perplexing -- hopefully they'll find a developmental prospect as a free agent.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2017,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Tight end was a need position for the Rams, and Gerald Everett's ability to get off the line smoothly is quite impressive. They might consider him a receiver. It might have been a tick early for him, however -- not unlike when they chose Lance Kendricks a bit early in 2011. Cooper Kupp's feet are as quick as any in the draft, even if his 40 time wasn't great. Third-round safety John Johnson is liked by scouts for his ability to handle multiple roles in the secondary. The Rams couldn't help but build up their offense with a solid receiver in Josh Reynolds, and got a potential pass-rush specialist in Samson Ebukam -- two solid picks. Getting fullback Sam Rogers in the sixth will help Todd Gurley and the special teams units. The Rams needed to find a cornerback (or two), but couldn't meet all their needs in eight picks. Jared Goff will be given the opportunity to excel with this talent around him.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2017,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "In Round 1, the 49ers got their guy at No. 3, and picked up two thirds (one future) and a fourth in the process. That's a big win. They picked the second-best player in the draft in Solomon Thomas. Then Reuben Foster was sitting there just waiting for someone to grab him, so they traded a fourth-round pick to Seattle to get him. If Foster's shoulder is OK, he'll be another Patrick Willis in the middle. GM John Lynch found a much-needed cornerback in Ahkello Witherspoon, a long and lean player who will need a bit of time to get ready. In the late fourth, they picked up Iowa quarterback C.J. Beathard, a solid backup pick-up. That's a bit early for him, going over Joshua Dobbs and Nathan Peterman. Running back Joe Williams is a blur, and couuld be a great value. Nose tackle D.J. Jones and receiver Trent Taylor are short, but active and productive. They'll compete. I would have liked to see the Niners get offensive line help, but they could get that after the draft. GM John Lynch found a much-needed cornerback in Ahkello Witherspoon, a long and lean player who will need a bit of time to get ready. In the late fourth, they picked up Iowa quarterback C.J. Beathard, a solid backup. That's a bit early for him, though, going over Joshua Dobbs and Nathan Peterman.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2017,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Like Green Bay, Seattle made a great trade to move out of the first round. Sure, they lost they chance at a fifth-year option on a player by taking the deal but that's OK. They're not looking to lock up a quarterback, so they'll make do. John Schneider switched spots with Jacksonville in the early second round, picking up a sixth-rounder. They picked up the defensive lineman they were eyeing in the first round, Malik McDowell, so chalk that up as a win. Picking Pocic gives them inside-outside versatility, though I wonder how he'll handle NFL defenders at his height. Shaquill Griffin is a little-known corner from Central Florida who brings physicality and athleticism. Schneider got a safety in Delano Hill later in the third round. He gives them special teams help and an aggressive attitude. Nazair Jones is a tall, long tackle/end combo who fits Seattle quite well. They picked up a solid receiver in Amara Darboh, who parlayed his excellent senior year into a third-round spot. Picking Tedric Thompson in the fourth round helps build depth at safety, though his tackling and history of concussions are concerning. Justin Senior is a potential swing tackle that impressed at times in the SEC. Chris Carson in the seventh is a good backup for Eddie Lacy.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/final-2017-nfl-draft-quick-snap-grades-for-all-32-teams-0ap3000000805312",
    "playerGrades": []
  }
]