[
  {
    "teamName": "Baltimore Ravens",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Look at this Ravens roster. Where are the holes? Definitely middle linebacker. Maybe wide receiver. Probably a guard to replace Marshal Yanda. But that's it. So I liked that the Ravens got an off-ball linebacker at No. 28 whom Lamar Jackson called \"Ray Lewis Jr.,\" and I liked that they didn't have to move up to get him. Patrick Queen started only 16 games in his LSU career, but his talent bursts on the tape. He's a fit as a long-term C.J. Mosley replacement. (By the way: Baltimore has now drafted three linebackers in the first round: Lewis in 1996, Mosley in 2014 and Queen. Those first two were/are pretty good.)\n\nThe Ravens entered this draft with three picks in the first two rounds, and they ended up with five total picks on Day 2. Here are those picks, along with where I had them in my overall rankings:\n\n55. J.K. Dobbins, RB, Ohio State (27 on my board)\n71. Justin Madubuike, DT, Texas A&M (42)\n92. Devin Duvernay, WR, Texas (64)\n98. Malik Harrison, LB, Ohio State (74)\n106. Tyre Phillips, OT Mississippi State (83)\n\nSo as you can see, all five of them were at least 20 spots higher on my final Big Board. That's outstanding value. Baltimore fortified the middle of its defense -- it gave up 4.4 yards per carry last season, most in franchise history -- got a playmaker to help Jackson in the slot, and picked a tackle with guard experience who could compete to take over for Yanda, along with fourth-round pick Ben Bredeson (143). I'm also a big fan of James Proche (201), a super-productive pass-catcher who could fill a role, and safety Geno Stone (219) could be a special-teams menace as a rookie. Getting him in the seventh round is stellar.\n\nGeneral manager Eric DeCosta had another really strong draft. Expect Baltimore to be a Super Bowl contender again.",
    "sourceName": "ESPN",
    "sourceUrl": "https://www.espn.com/nfl/draft2020/insider/story/_/id/29056681/2020-nfl-draft-grades-mel-kiper-all-32-classes-best-picks-steals-sleepers",
    "playerGrades": [
      {
        "playerName": "Patrick Queen",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Patrick Queen started only 16 games in his LSU career, but his talent bursts on the tape. He's a fit as a long-term C.J. Mosley replacement."
      },
      {
        "playerName": "J.K. Dobbins",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "55. J.K. Dobbins, RB, Ohio State (27 on my board)"
      },
      {
        "playerName": "Justin Madubuike",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "71. Justin Madubuike, DT, Texas A&M (42)"
      },
      {
        "playerName": "Devin Duvernay",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "92. Devin Duvernay, WR, Texas (64)"
      },
      {
        "playerName": "Malik Harrison",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "98. Malik Harrison, LB, Ohio State (74)"
      },
      {
        "playerName": "Tyre Phillips",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "106. Tyre Phillips, OT Mississippi State (83)"
      }
    ]
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "It's easy to forget that the Colts have made the playoffs only once in the past five seasons. Heading into last season, there was some buzz around this team. But then Andrew Luck shockingly retired, Jacoby Brissett took over at quarterback and Indianapolis' holes were exposed in a 7-9 year. Still, general manager Chris Ballard has done a good job of stocking the roster with talent since he took over in 2017. The Colts have some young stars, highlighted by a tremendous 2018 draft class, and Ballard dealt the No. 13 overall pick in this draft for defensive tackle DeForest Buckner, who has emerged as one of the best interior defenders in the league. Ballard also has a new starting quarterback, with veteran Philip Rivers taking the reins for at least the next year, and he also has an extra second-round pick from Washington, which traded up into Round 1 in last year's draft.",
    "sourceName": "ESPN",
    "sourceUrl": "https://www.espn.com/nfl/draft2020/insider/story/_/id/29056681/2020-nfl-draft-grades-mel-kiper-all-32-classes-best-picks-steals-sleepers",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2020,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "A lot of the Arizona Cardinals' offseason has been centered on how good the offense can be. They brought back Kenyan Drake and acquired DeAndre Hopkins, and Kyler Murray will enter year two of his career with plenty of firepower. The Cardinals defense was the big winner of Day 1 in the draft, though. Isaiah Simmons will join the Cards as an elite athlete after doing a little bit of everything for Clemson. For those who think Simmons will be a safety in the NFL, general manager Steve Keim had a different take on how he sees his new star. \"The only guy I could think of, with similarities, was Brian Urlacher when he came out,\" Keim said on the Cardinals' draft livestream. \"He was a safety at New Mexico, for the most part ... not quite as fast, but a guy who became a great player and who made that ascension to playing more in the box.\" The Birds didn't have a pick in the second round because it was the centerpiece of the deal that brought them Hopkins. They spent their third-round selection on a tackle who was getting first-round hype throughout the predraft process in Josh Jones. If he comes anywhere near his ceiling, he's the steal of the third round. The Day 3 selections were largely spent filling out the depth chart in the front seven. Eno Benjamin is an intriguing pass-catching back who could find a role as a Drake backup. There's a lot to love about Arizona's performance.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Atlanta Falcons general manager Thomas Dimitroff didn't end up with the big flashy trade that was being reported as a possibility before the draft. Those expectations cast a shadow on a solid class. The Falcons had to get better on defense, and that's what they did. A.J. Terrell wasn't the consensus third-best corner on the board, but his athleticism and ability to press receivers at the line makes him a fit in head coach Dan Quinn's defense. Marlon Davidson is an interesting prospect. Everyone talks about versatility in the secondary, but he is a 300-pounder who primarily played defensive end in a four-man front at Auburn. So he's built like a 3-technique but played on the edge in college. He'll be an interesting fit alongside Grady Jarrett on the inside. Matt Hennessy continued the \"solid\" theme with this class. He's unlikely to be a perennial Pro Bowler but should become a consistent starter. Not a lot to hate in this group, but there isn't much to love either.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Another year, another great draft for the Baltimore Ravens. Lamar Jackson has to feel fantastic about his future with an organization that clearly knows how to maximize its title window with him at quarterback. Baltimore kicked off Day 1 by patiently waiting and snagging a player in Patrick Queen who is arguably the best linebacker not named Isaiah Simmons in the whole draft. J.K. Dobbins doesn't fill a need, but the running back does make their offense more terrifying. As much as the Ravens run the ball, Dobbins' explosiveness makes him an especially good fit. Having four selections in the third round gave the Ravens the luxury of taking Dobbins in the second, as they still addressed important needs. Justin Madubuike could become a disruptive force in the middle, Devin Duvernay may be constrained to the slot, but that doesn't matter in the third round. Malik Harrison is limited in coverage but could do damage as a blitzing linebacker in the Ravens' blitz-happy defense. Ben Bredeson and Tyre Phillips were rated similarly on Matt Miller's big board, so Phillips may have been a bit of a reach, but both will bring new blood to an offensive line that needs it on the interior.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The best thing the Buffalo Bills did regarding this draft was trade their first-round pick (among others) for Stefon Diggs. They needed a true No. 1 receiver for Josh Allen to find out if he can be the quarterback of the future. With their second-round pick, they got a guy who was widely considered a first-rounder in A.J. Epenesa. The edge-rusher's production at Iowa was great (22 sacks, 30.5 tackles for loss over the past two seasons), but concerns about his athleticism caused him to drop. His testing wasn't ideal and revealed him to be an almost purely power rusher. How that translates to the NFL is questionable. There aren't many Frank Clarks in the league. Zack Moss will offer depth in the running back rotation with Frank Gore out of the picture. Jake Fromm was an interesting choice given Allen's profile as a big (6'5\", 237 lbs), strong-armed quarterback, and the 6'2\", 219-pound Fromm certainly isn't that. If you're of the thinking that Epenesa is a steal, then this class looks good. If you buy that his draft stock was probably commensurate with how he projects to the NFL despite his production, then there isn't a lot of excitement.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Matt Rhule and the Carolina Panthers have been tasked with essentially building the team from the ground up, and he made it clear what was important: defense. Carolina's new head coach made draft history with the most picks spent exclusively on that side of the ball. It all starts with Derrick Brown, who should be an anchor on the defensive line for years. He may never become the disruptive pass-rusher you'd like to see with this high of a pick, but he has a safe floor. Day 2 was friendly to the Panthers. Yetur Gross-Matos' fall out of Round 1 was more in line with his skill set, but the edge-rusher fills a need. Jeremy Chinn at the end of the second round was a steal. At 6'3\", 221 pounds, he can play safety but has the size and frame to play in the box and help against the run. In an NFC South with the Saints, Buccaneers and Falcons, having a strong defense is a must. The Panthers took a big step toward that goal and gave Rhule's leadership a definitive direction.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "We can all aspire to love something in this life like Chicago Bears general manager Ryan Pace loves tight ends. The Bears spent their first pick of the draft on Cole Kmet, who is one of 10 tight ends on Chicago's roster. Kmet was widely viewed as the best tight end in a bad class of them, so the pick itself seems like it was made at the right time. It's just a questionable fit. They won't carry 10 tight ends into the season (probably?), but there are still a lot of them. The Khalil Mack trade and other moves left the team without a ton of picks, so the haul itself was always going to look unimpressive. Fortunately, Jaylon Johnson redeems their draft a bit. He fills a need at corner and has an argument as the best value of the second round. The trio of fifth-round picks consists of lottery-ticket types with high upside. If just one of them is a productive contributor, they will have done a good job on Day 3.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Cincinnati Bengals continued a great offseason with a draft in which they attacked needs through all three days. The obvious highlight is Joe Burrow. He was the no-brainer No. 1 pick, and the team didn't mess it up. Tee Higgins is a perfect pairing as the second-round choice. He may struggle to get separation, but he can win at the catch point and will be a big target (6'4\", 215 lbs) alongside A.J. Green and Tyler Boyd. From there, they pivoted to defense. Doubling up on linebacker was a good decision, as both Logan Wilson and Akeem Davis-Gaither have potential to develop into three-down linebackers, and the Bengals D was bad last season (29th overall). It would have been good to invest in offensive line help earlier, but Hakeem Adeniji was a good pick in the sixth round. He has the potential to stay at tackle (6'4\", 302 lbs) but the build to kick inside and provide good pass protection if he doesn't pan out on the outside.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Cleveland Browns had a simple task in the first round: Take one of the top four tackles. The position was the team's biggest need, and the top prospects were a perfect match. General manager Andrew Berry got off to a great start by taking Jedrick Wills at No. 10. The team continued to target positions of need into Day 2 and 3. The Browns traded back three spots in the second round and earned an additional fifth-round pick while still winding up with a safety. Grant Delpit was a draft darling a year ago, but his performance while injured (high ankle sprain) in 2019 dropped him into the second round. The Browns once again traded down in the third round, picking up a 2021 third-rounder from the Saints to move from No. 74 to No. 88 and take defensive tackle Jordan Elliott. He was the only Power Five defensive tackle with a 90.0 grade against the run and pass, per PFF. The ability to get an additional third and still take one of the better defenders in the round put this class over the top. Day 3 picks who stand out include Harrison Bryant and Nick Harris. Bryant gives Kevin Stefanski—a coach known for utilizing multi-tight end sets in Minnesota—another weapon. Harris played center at Washington but can also kick to guard and compete with Wyatt Teller for playing time.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "There comes a point when a team gets on the clock and even though a prospect doesn't fit a pressing need, he's too good to pass up. It seems simple, but a lot of teams never grasp the concept. Fortunately, Dallas did when CeeDee Lamb was available at No. 17. The Oklahoma receiver stands out as one of the highest-value picks in the first round and gives the Cowboys' grade a huge boost. After the defensive line lost Maliek Collins and Robert Quinn, Neville Gallimore made a lot of sense. Trevon Diggs doesn't have great long speed, but the corner's ability to press receivers at the line should make him a good fit in Dallas after the team lost Byron Jones. The Cowboys got one of the best Day 3 hauls to round out the class. Tyler Biadasz fills a need after the retirement of center Travis Frederick and likely dropped because of injury concerns. He had hip surgery in 2019 but is a top center prospect. Bradlee Anae was highly productive at Utah (27.5 sacks over the last three years) and isn't the best quick-twitch athlete, but in the fifth round you'll take a guy with his skills. The Cowboys got impact players in the early rounds who can help immediately and rolled the dice on Day 3 prospects who have shown good things.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Drew Lock should send John Elway a box of chocolates or something. The Denver Broncos clearly made him and the offense a top priority in the draft. The general manager said after the event he wanted to add speed and explosiveness, and he did just that with his first two picks. Jerry Jeudy was the Biletnikoff Award winner (top receiver in the nation) among an incredibly gifted crop of pass-catchers last season. K.J. Hamler's ceiling as a versatile burner is a great complement to the crafty route running and consistency of Jeudy. Perhaps just as important was the third-round selection of Lloyd Cushenberry III. He could presumably slide into the center spot and let free-agent addition Graham Glasgow play guard. The team is poised to see what it has in Lock over the next two seasons. There's no reason for him to not reach his potential with what the Broncos are putting around him.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "With Darius Slay in Philadelphia, the Detroit Lions were fortunate to find the perfect replacement in Jeff Okudah. The Ohio State corner was the no-brainer best player at his position in this class and has all the makings of a shutdown corner. The D'Andre Swift pick is good in a vacuum. He was arguably the best running back in the class, but Kerryon Johnson and Bo Scarbrough weren't the biggest problems on the team last season. Addressing either the offensive or defensive line at No. 35 would have been better. At least they did that with the next three picks. Julian Okwara can develop into a good pass-rusher under head coach Matt Patricia. Both Jonah Jackson and Logan Stenberg should compete for playing time on an offensive line that was mediocre and lost Graham Glasgow.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2020,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "In an ideal draft, a team should come away with one or two immediate starters, two or three part-time players who could become starters and three or four developmental players with upside. The Green Bay Packers traded up for Jordan Love. The Utah State quarterback may be good enough to be an NFL starter, but he isn't supplanting Aaron Rodgers in the next two years. Running back Aaron Jones is in the final season of his contract, but AJ Dillon isn't taking his job this year. Josiah Deguara is not a traditional tight end but is an H-back type who was the 11th-ranked tight end on Matt Miller's big board. So the odds that he takes over as the team's No. 1 tight end are low. To recap, that's zero immediate starters, two part-time players and one developmental player with upside in the first three picks. It was good to see them invest in the offensive line with their Day 3 selections, but if even one of them becomes a starter, it will be a win.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2020,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Houston Texans don't just receive a less than ideal grade because they didn't have many picks—Bill O'Brien's questionable decision-making extended into the draft. Second-round defensive tackle Ross Blacklock was the team's first selection. He's a huge gamble given his upside. At his best he is a disruptive penetrator on the inside, but the injury concerns he carries are legitimate. He was a freshman All-American at TCU before missing all of 2018 with a torn Achilles. He rebounded in 2019, but others in the draft fell because of previous injuries, and the Texans didn't get a discount. Jonathan Greenard was productive at Florida (10 sacks, 16 tackles for loss in 2019) but didn't show the athleticism you'd like to see in an edge-rusher at the combine. John Reid was a good selection in the fourth round. He was the No. 100 player on PFF's big board and could be a great fit as their nickel corner.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Indianapolis Colts were without a first-round pick because of the DeForest Buckner trade with the San Francisco 49ers but still left the draft with a good haul of impact players. Michael Pittman Jr. might not have been the best receiver on the board, but he was the best fit for what the Colts needed. He could be the big-bodied (6'4\", 223 lbs), jump-ball target they were hoping to get when they acquired Devin Funchess before last year. They traded up three spots with the Browns in the second round to get Jonathan Taylor. His blend of size (5'10\", 226 lbs) and speed (4.39-second 40-yard dash) makes him a great potential replacement for Marlon Mack, who is entering his fourth season with the team. Safety Malik Hooker hasn't lived up to the hype as the No. 15 pick in 2017, so even though Julian Blackmon was a reach, he was at least a reach that made sense in terms of roster construction. The best value of all may have been the 6'6\", 231-pound Jacob Eason. It's amazing that a team didn't reach on the quarterback given the NFL's fascination with size and arm strength. However, if he ends up being Philip Rivers' successor, finding him on Day 3 is an incredible value.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Jacksonville Jaguars entered the draft as one of its most intriguing teams. With two first-round picks and a borderline need at quarterback, they could have shaken things up. Even though they essentially pledged their allegiance to Gardner Minshew II by eschewing a first-round QB, they still shook up the first round a bit when they made CJ Henderson a top-10 pick. Henderson was one of the most athletic prospects at corner, so it's easy to see why they fell in love with him even if he struggled to cover explosive routes last season, per CFB Film Room. He'll be aided by K'Lavon Chaisson, who is one of the most explosive pass-rushers in the draft class. Laviska Shenault Jr. could be a steal in the second round. If it weren't for injury concerns, he would have been a first-round talent. He's a receiver with running back skills after the catch, which should make life easier for Minshew. Ben Bartch on Day 3 is a great example of an upside project who could pay off in a big way. He's a former tight end who moved to tackle and has the frame (6'6\", 309 lbs) to develop into an NFL tackle. As a fourth-round pick, he can sit for at least a year as he makes the jump from Division III football and might become a starter.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The defending Super Bowl champions pulled a mild surprise when they took Clyde Edwards-Helaire to close the first round. He was the No. 4 running back and the 44th overall player on The Athletic's consensus big board. He makes sense within the context of the Kansas City Chiefs offense, but an elite running back hardly seems like their biggest concern. Their Day 2 picks redeemed their overall grade. Willie Gay Jr., at 6'1\", 243 pounds, looks the part of a modern NFL linebacker. His size and speed (4.46 40) combination makes him the kind of elite athlete you need in the middle, and the Chiefs' linebacker room is underwhelming. Lucas Niang is a great long-term fit. He could be a replacement for Mitchell Schwartz or Eric Fisher down the road but could slide in at one of the guard spots as early as this year. The fact that they waited to address the defensive backfield until the third day drops their grade a bit. The Chiefs are much more likely to lose a playoff game because their secondary wasn't up to par than the lack of an elite running back.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2020,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Jon Gruden and Mike Mayock did it again. The Las Vegas Raiders have become one of the more difficult teams to predict (and understand) regarding the draft. They had multiple picks in the first round and sprung surprises each time. Last year it was Clelin Ferrell, Josh Jacobs and Johnathan Abram. This year, it was Henry Ruggs III and Damon Arnette. Ruggs is an incredibly gifted athlete who showed steady hands at Alabama. He was also the team's No. 3 receiver throughout his time there, so it's surprising he was the first wideout taken—even over teammate Jerry Jeudy. You'd be hard-pressed to find a mock draft with Arnette in the first round, but the Ohio State cornerback did showcase some toughness while playing with an injured wrist for a large portion of 2019. Lynn Bowden Jr. is the modern-day Kordell Stewart or Antwaan Randle-El, depending on what era you'd like to look back on. He played quarterback in college but will be a receiver/gadget player for the Raiders. Bryan Edwards is a talented receiver but dealt with a knee injury that probably dropped his stock. Almost every Raiders pick was a high-risk, high-reward play. They could make this grade look dumb or generous in a few years, depending on how many of their bets hit.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Los Angeles Chargers have staked their entire draft on two players: Justin Herbert and Kenneth Murray. Once they sent the 37th and 71st picks to the Patriots so they could move into the first round and take Murray, they were left with nothing but Day 3 selections. Maybe at least one of that group becomes a starter or rotational player. Receiver K.J. Hill stood out Ohio State, which is not an easy place to do so. But if you're banking on a Day 3 guy to become a starter so you can come out of a draft with three total, that's not a good place to be. Obviously, if Herbert becomes the man, none of this will matter. It will simply be the draft where the Chargers got their franchise quarterback. But is anyone that excited about Herbert? If it weren't for Tua Tagovailoa's hip injury, Herbert would be the clear-cut third-best quarterback prospect in the class. Murray is a do-it-all linebacker who should be a starter immediately, but it's questionable if he was worth giving up another potential starter in the third round for.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Los Angles Rams have quickly gone from NFC champions to a team that might be in need of a rebuild—having compromised their draft capital in 2021 and 2022 to do it. So getting good pieces in this draft was incredibly important. The results were mixed. Cam Akers is an intriguing running back in part because he played behind a horrendous offensive line at Florida State. Daniel Jeremiah of NFL Network said he could \"walk down the street here outside my house, and I can promise you I could find a very similar offensive line to the one he ran behind at Florida State.\" Yet, Akers still ran for over 1,144 yards and 14 touchdowns. He will continue to run behind a bad line, as the Rams had the 31st-ranked unit at PFF last season. Swapping out Todd Gurley for Akers won't fix the running game, even if it does help their wallet. Wide receiver Van Jefferson will be much cheaper than Brandin Cooks ($8 million in 2020). However, the pick was a questionable value at No. 57. Jefferson was a four-year player at Florida but never offered elite production, topping out at 657 yards receiving last year. He's a good route-runner but offers little athletic upside. The team's best picks came in the third round. Terrell Lewis was one of the higher-upside pass-rushing specialists in the draft. He has the length, athleticism and technique to be a double-digit sack artist. He presumably dropped down boards because of injury concerns. Terrell Burgess is a versatile defender on the back end. It wouldn't be surprising to see both Lewis and Burgess in rotational roles as rookies and full-blown starters soon thereafter.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "For better or worse, this draft will shape the Miami Dolphins for years. After trading Minkah Fitzpatrick, Laremy Tunsil, Kenny Stills and Kenyan Drake for picks in this class and tanking for Tua, they had to nail the picks. Mission accomplished with their first selection. Taking Herbert over Tua Tagovailoa would have been drafting not to lose. Tagovailoa shows they're willing to risk the injury that comes with the winner they could be getting if the Hawaiian southpaw can stay healthy. It's easy to like the positions they drafted in each slot, even if there are some potential reaches in there. Offensive tackle Austin Jackson didn't look great when facing the top edge-rushers on USC's schedule. Noah Igbinoghene was far from a first-round lock, although stocking up on corner, with Xavien Howard and Byron Jones already on the roster, isn't a bad strategy. He'll have time to develop. Robert Hunt and Raekwon Davis may have been reaches, but they show that building in the trenches is a priority. And it was shocking that Curtis Weaver made it all the way to Day 3, considering his production at Boise State (47.5 tackles for loss, 34 sacks in three seasons).",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "After the mass exodus of cornerbacks in free agency and trading of Diggs, the Minnesota Vikings had to find corners and a receiver in this draft. They did just that with their duo of first-round selections in Justin Jefferson and Jeff Gladney. Jefferson was primarily a slot receiver at LSU but is likely to produce wherever he lines up. Gladney will bring attitude to a cornerback room that is in for an overhaul and will need confidence. Cameron Dantzler will join him as a guy who gets early playing time. His length and size (6'2\", 188 lbs) make him a good complement to Gladney (5'10\", 181 lbs), who is smaller and more physical. Offensive tackle Ezra Cleveland must get stronger to handle the bull rush he will see in the NFL but was a good pick in terms of need and draft capital. Regarding Day 3 picks, D.J. Wonnum seems like a reach, but getting Oregon linebacker Troy Dye makes up for it. His abilities in coverage give him the upside to develop into an every-down linebacker if he can get more physical against the run. The Vikings did well to utilize their treasure trove of picks to fill roster holes—and they'll need a lot of them to contribute right away.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Patriots gonna Patriot. This draft was classic Bill Belichick. While many expected New England to take a quarterback to replace the departing Tom Brady, or at least a receiver to make life easier for Jarrett Stidham, the team did neither. Instead, it traded out of the first round and spent its first three picks on defense. The ultra-athletic Kyle Dugger will join the Patriots secondary. They surprised everyone by making the small-school standout the second safety off the board ahead of Antoine Winfield Jr. and Grant Delpit. They followed him with two very Patriots picks in Josh Uche and Anfernee Jennings. Both needed to be put in defensive systems that could play to their strengths and cover their weaknesses, and few teams are as good at doing that as New England. Back-to-back picks at tight end once again confirmed the importance the team places on the position. Even if the Patriots didn't get any production out of the spot last season, the additions of Devin Asiasi and Dalton Keene point toward their commitment to developing it. Overall, it was a draft that few could have predicted but makes strange sense for the Patriots.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The New Orleans Saints walked away with one of the smallest draft hauls, but that's a product of their win-now status. They don't have many holes and should be looking for specific players to put them over the top. That's why Cesar Ruiz made sense as their first selection. They brought back Andrus Peat, but Ruiz gives them another player who can start on the interior of the offensive line immediately. He was a center at Michigan but played a few games at guard and should easily slide over to one of the guard spots if necessary. Zack Baun saw a sharp drop from his No. 32 ranking on Matt Miller's big board. Some of that is likely because he's a tweener. He was primarily used as a rush linebacker off the edge at Wisconsin, but Saints head coach Sean Payton believes Baun can play both the \"Mike\" and \"Sam\" in New Orleans. It takes some projection to envision how his game translates to the NFL, so his draft spot might make more sense than his predraft perception as a first-round talent. The Saints paid a hefty price to move up and get Baun. They sent the 88th pick and a 2021 third-round selection to Cleveland for him. Then they traded up again to get one of the best tight ends in a shallow class of them in Adam Trautman. His blocking should allow him to make a quicker contribution than most rookie tight ends.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "New York Giants general manager Dave Gettleman gets a lot of flak for his decision-making, but this draft should be cause for pause there. The decision to take Andrew Thomas may be questionable to some, but he has all the makings of a franchise left tackle. Their choice to pass on Isaiah Simmons—who would've been a flashier pick—was vindicated further in the second round when they made Xavier McKinney the first safety off the board. Alabama's McKinney was one of the most versatile defenders in college football behind Simmons, playing snaps in the box, at slot corner and free safety for the Tide. The Giants went to the offensive line well once again in Round 3 with Matt Peart. Taking a shot on a developmental tackle such as Peart is always good, because even if he doesn't pan out on the outside, there's a good chance he can still provide value as a guard down the line. With early picks spent on quarterback Daniel Jones and running back Saquon Barkley over the past few years, it was smart to spend draft capital on the offensive line. Say what you want about Gettleman, but this is a strong class with a good opportunity to age well.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "New York Jets general manager Joe Douglas definitely has a type. If you are big and/or fast, there was a good chance the team at least thought about taking you. New York started by selecting hulking tackle Mekhi Becton. He sealed his early first-round hype with a 5.10 40-yard dash at 6'7\" and 364 pounds, which should be illegal. Tristan Wirfs, who went two picks later, may end up being the better pass protector, but you can't fault a team for going with Becton's potential. At 6'3\" and 207 pounds, Denzel Mims is not a small receiver, but he has the speed of one. He had first-round hype after running a 4.38-second 40-yard dash at the combine, and while he didn't go that early, the Jets should be happy to get him after trading down in the second round. He's raw but has all the physical tools to become a legitimate threat for quarterback Sam Darnold. Ashtyn Davis and Jabari Zuniga continued the trend of athleticism over everything for the Jets. Davis was a Pac-12 champion hurdler at Cal in addition to playing safety on Saturdays. Zuniga was in the 74th percentile or higher in all of his workout metrics on Player Profiler. James Morgan is an interesting Day 3 quarterback prospect, while cornerback Bryce Hall could be the biggest steal of the day. All of the Jets' picks have nagging questions about their ability to put it all together, but drafting the best pure athletes possible isn't the worst strategy.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Philadelphia Eagles' selection of Jalen Reagor in the first round launched a debate over the merit of taking him over LSU's Justin Jefferson, but that's overblown. Reagor wasn't nearly as productive in 2019, but he also played with a freshman quarterback in Max Duggan, and only 30.7 percent of the receiver's targets were accurate, per PFF. Meanwhile, Jefferson was playing with Burrow, Ja'Marr Chase and Edwards-Helaire and doing his damage almost exclusively from the slot. The second round is where things got baffling. Jalen Hurts was the biggest surprise pick of the draft because it's hard to even come up with a precedent. Hurts was a productive quarterback at Oklahoma and Alabama, but taking him in the second round with Carson Wentz on the roster doesn't make much sense at first (or even second glance). If the Eagles are just planning on his being a backup, it makes no sense. If they are planning on utilizing him in an enlarged Taysom Hill role, it's hard to grade because we've never seen a team try to make a second quarterback a part of its every-week scheming. Linebacker and offensive line might have been better needs to address with that pick, which they did in later rounds. Davion Taylor has the athleticism to be a good coverage linebacker but needs to develop his run-stuffing skills, which is better than having good skills in the run game and needing to develop the ability to cover. K'Von Wallace, John Hightower and Prince Tega Wanogho are as good a trio as a team could hope for on Day 3. Wallace can play in the slot. Hightower is a high-upside receiver, and Wanogho offers upside as a road-grading tackle.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Pittsburgh Steelers were without a first-round pick because of the Minkah Fitzpatrick trade. They likely aren't regretting that given the 23-year-old's age and production (five interceptions, nine pass deflections). There's a lot to like about the work that the franchise did with its Day 2 and 3 picks, though. Chase Claypool is an interesting receiver who fills a need. At 6'4\" and 238 pounds with 4.4 speed, he is a massive receiver who can go up and get 50-50 balls. He is physical enough that there was speculation he would need to move to tight end until he ran at the combine. Alex Highsmith didn't face the greatest competition at Charlotte, but he has the bend and athleticism to offer upside as a pass-rusher. With Bud Dupree set to play on the franchise tag this season, Highsmith could be a big part of their defensive plans. Anthony McFarland Jr. is a nice change-of-pace running back to pair with James Conner. He is on the smaller side at 5'8\", 193 pounds but should play the Tarik Cohen role as a pass-catching back with big-play potential. Kevin Dotson is a great fit as far as Day 3 picks go. He could be a starting guard before his rookie contract is up.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "With two picks in the first round and no picks again until the fourth, the San Francisco 49ers were in a position trade down from No. 31 to get more Day 2 selections. Instead, they moved up to get wide receiver Brandon Aiyuk at No. 25. With their first two picks, the Niners made up for two of their most important losses. Javon Kinlaw's potential as a disruptive pass-rusher gives him a ceiling that is as high—if not higher—than Derrick Brown's. He'll need to replace DeForest Buckner. Aiyuk is the replacement for Emmanuel Sanders. The veteran receiver left for the Saints in free agency, and head coach Kyle Shanahan felt Aiyuk wouldn't be available by the time they were on the clock at No. 31. It's hard to fault an organization for going after a guy it really likes, but this receiver class was so deep it's tough to believe Aiyuk is that much better than Pittman, Shenault, Hamler or some of the receivers who fell to the second round.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2020,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "DK Metcalf and Russell Wilson drew a lot of attention away from the fact that the Seattle Seahawks appear to have whiffed on their first two draft picks last year. L.J. Collier and Marquise Blair were both nearly invisible on defense last season. The Seahawks might be once again calling on their third pick to carry the draft class. Trading up for Damien Lewis to upgrade the interior of their offensive line might be the best move they made. Seattle is no stranger to taking risks in the draft, and selecting linebacker Jordyn Brooks one pick ahead of Patrick Queen certainly qualifies. This edge-rusher class wasn't much to get excited about, but Darrell Taylor is a second-round project who may never help. The success of the franchise and Wilson's ability have hidden the fact that the Seahawks haven't been that great in the draft recently. That trend continued over the weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "There was a lot of debate in the predraft process concerning the top four tackles in this class. Realistically, you could make an argument for any of them. The Giants took Andrew Thomas fourth. The Tampa Bay Buccaneers were fortunate enough to only have to trade up one spot, to No. 13, to grab the last one in Tristan Wirfs. With the Tom Brady era getting started in Tampa, the Bucs couldn't have asked for a better scenario. The offensive line is the last piece of the puzzle, considering the skill they have around TB12. Wirfs' floor seems to be that of one of the league's best guards. Antoine Winfield Jr. was the Wirfs of the safeties. He was in the same class as the rest of the second-rounders at his position, and the Bucs were once again fortunate that he made it to their next pick. He can do a little bit of everything in the defensive backfield and should provide a great return on the investment. Ke'Shawn Vaughn may have been a bit of a reach in the third round, but the Bucs needed to add to their running back rotation. Receiver Tyler Johnson is not great at any one thing but has an awful lot of polish for someone taken on Day 3. Great value all over the place for Tampa. It keeps winning the offseason.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Tennessee Titans pulled off a rare feat: It's not often that that a team's first- and second-round picks could be flipped and you wouldn't be surprised, but here we are. Isaiah Wilson is Mekhi Becton-light. As much as a man who is 6'6\" and 350 pounds can be the light version of someone else. He is somewhat smaller than the 6'7\", 364-pound Becton and a little less proven and athletic. He's a projection pick, but one who could pay big dividends. Meanwhile, second-round selection Kristian Fulton has the talent of a first-rounder and had success against some of the best the SEC had to offer last season. Yet, an ankle injury probably forced him down the board. Considering where they selected each of the two, it's a good pairing of value, as Fulton makes up for the reach on Wilson. Running back Darrynton Evans is a good changeup to Derrick Henry. The ground game is an important part of what Tennessee does, so investing in a speedster like Evans in the third round made sense. As long as he can pick up pass protection, he should be a regular third-down back relatively soon. Cole McDonald is an interesting backup quarterback to develop, as he has good arm strength.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Washington Redskins were quietly big winners on draft weekend, as they found value and filled needs. Chase Young somehow seemed to go under the radar as a No. 2 pick. Every week, teams had to scheme how they would block Young with help from running backs, tight ends and whoever else could be made available. He saw triple-teams at times. He still had 16.5 sacks and 21 tackles for loss. He should be the favorite for Defensive Rookie of the Year. The Redskins didn't have a second-round pick but made smart choices with what they did have. Antonio Gibson was one of the most explosive players in college football on a per-touch basis last year. Playing running back and receiver for the Memphis Tigers, he scored 13 touchdowns on 94 total touches, including returns. Saahdiq Charles stands a chance at becoming a serviceable offensive tackle. Antonio Gandy-Golden was an underrated receiver prospect with good physical tools who may have been undervalued because he played at Liberty. The Redskins didn't have great capital but should be applauded for what they did with what they had.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2889008-2020-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Cardinals had a great draft, especially if you count them trading a second-round pick to get DeAndre Hopkins and a fifth-round pick to get running back Kenyan Drake. They added bulk on both lines, which they needed to do as well.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Josh Jones",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round tackle Josh Jones will be a steal for the Cardinals. He will begin on the right side, but will eventually be a good left tackle someday."
      },
      {
        "playerName": "Isaiah Simmons",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "It's hard to find one, but I didn't love the pick of Isaiah Simmons in the first round. He's a good player, but where does he play? How they figure that out will ultimately decide if it's a good pick."
      }
    ]
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Terrell and second-round pick Marlon Davidson, a defensive end from Auburn, will both help the defense and fourth-round safety Jaylin Hawkins could be a steal. They definitely filled some major needs in this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Matt Hennessy",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Third-round center Matt Hennessy should be the one to take over for Alex Mack when he's done. For now, he can compete at left guard."
      },
      {
        "playerName": "A.J. Terrell",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I know they needed a corner, but did they force the pick on A.J. Terrell a bit? I might have taken a different corner there, but it definitely fills a need."
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Ravens, as usual, did a heck of a job. They had six picks in the first three rounds, maneuvering with trades to do so, and they added a lot of good players. I loved the pick of first-round linebacker Patrick Queen. Eric DeCosta has taken over where Ozzie Newsome left off – by understanding what it takes to stock a roster. Keep an eye on sixth-round receiver James Proche. He could be a steal.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Devin Duvernay",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round receiver Devin Duvernay can fly. Adding him to the explosive offense as a slot receiver will help open up the passing game."
      },
      {
        "playerName": "J.K. Dobbins",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't like the pick of running back J.K. Dobbins in the second round. They have a few good runners and Lamar Jackson is a big part of that run game."
      }
    ]
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They traded their first pick to land receiver Stefon Diggs from the Vikings, but they did a nice job with the picks they had. Zack Moss in the third will be a nice complement to running back Devin Singletary. This team has a really nice talent base now.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "A.J. Epenesa",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Second-round defensive end A.J. Epenesa isn't one to test well. But he is a good player who will play end and can slide inside on passing downs. He's a solid pick in terms of adding depth to a pass rush."
      },
      {
        "playerName": "Jake Fromm",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "Georgia quarterback Jake Fromm is a project who will be nothing more than a backup at best. Yes, it was just a fifth-round pick, but is he better than Matt Barkley, the current backup?"
      }
    ]
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They killed it in the first three rounds of the draft. Getting Brown, second-round pass rusher Yetur Gross-Matos and third-round safety Jeremy Chinn is coup for the Panthers. That defense now has some top-flight talent, which it needed.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Derrick Brown",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": "It was first-round pick Derrick Brown. He will be a force in the middle of their defense and might end up being the best defensive player in this draft."
      },
      {
        "playerName": "Troy Pride",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "It's hard to find one, but I will be nitpicky and go with fourth-round corner Troy Pride. He has the ability, but just needs to fine-tune some things."
      }
    ]
  },
  {
    "teamName": "Chicago Bears",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't have a first-round pick as part of the Khalil Mack deal, but still landed a few nice players. Kmet is a good player, but was it a need? Johnson will be a star, and keep an eye on fifth-round pass rusher Trevis Gipson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Jaylon Johnson",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "I love second-round corner Jaylon Johnson. He had a shoulder injury, but he will be ready for the season. He is a long corner who will push for a starting job as a rookie."
      },
      {
        "playerName": "Cole Kmet",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": "Second-round pick Cole Kmet is a good player, but they have 100 tight ends on the roster and they've addressed it some by signing Jimmy Graham. There were other needs, although I do like Kmet as a player."
      }
    ]
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This is a team whose draft will be decided by Burrow, and I think he's going to be really good. Getting linebacker Logan Wilson in the third round is also a move that will pay off. The Bengals are coming.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Joe Burrow",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": "That one is easy: First-overall pick Joe Burrow will be a star. The Bengals will go to a Super Bowl with him as their starter."
      },
      {
        "playerName": "Tee Higgins",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "I know they needed a receiver, but I think there were better options on the board when they took Tee Higgins in the second round. He's a good player, but his speed worries me a bit."
      }
    ]
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They have a lot of questions in this draft, but if they work out it will be a good one. Can first-round pick Jedrick Wills move from right tackle to the left side? Will Delpit revert to his old ways of playing? There are several others. If the answers are yes, this will be a good draft",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Nick Harris",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Fifth-round center Nick Harris is undersized, but he will fit into their scheme perfectly. They need a center who can move and he can wait with J.C. Tretter in as the starter."
      },
      {
        "playerName": "Grant Delpit",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Which Grant Delpit are they getting? He was outstanding in 2018, but didn't play as well in 2019? He didn't tackle that well for LSU. He could be a boom-or-bust guy in the second round."
      }
    ]
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Cowboys ended up looking good by passing on a corner in the first round and then having Trevon Diggs fall to them in the second. Lamb is a good player, but, like the guys they have, he isn't a burner. Fourth-round corner Reggie Robinson could be a steal.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Neville Gallimore",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Third-round defensive tackle Neville Gallimore reminds me of Falcons interior player Grady Jarrett. He isn't big, but he can push the pocket and he plays with quickness."
      },
      {
        "playerName": "CeeDee Lamb",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I really liked all their picks, but I will be a bit nitpicky and say first-round pick CeeDee Lamb. He will be a good player, but he is a lot like Amari Cooper, who they just paid. Like I said, nitpicky."
      }
    ]
  },
  {
    "teamName": "Denver Broncos",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "John Elway has taken a lot of criticism for his drafts, and rightfully so, but I think this was a good one. Getting Jeudy and Hamler will help Drew Lock and they added some other players who will contribute -- and maybe start. I love Agim and third-round center Lloyd Cushenberry.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "McTelvin Agim",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Third-round defensive tackle McTelvin Agim is a player I really enjoyed studying in the lead up to the draft. He played on a bad defense at Arkansas, but he was impressive."
      },
      {
        "playerName": "K.J. Hamler",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "I will go with second-round receiver K.J. Hamler. Why? Because they had a lot of other needs and took receiver Jerry Jeudy in the first round. Hamler can fly, so it's hard to doubt him. It's just they had some other needs at the time."
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I know they needed a corner, but I would have taken Derrick Brown over Jeff Okudah in the first round. Taking a running back second was a luxury as well. I just didn't love this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Jonah Jackson",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Third-round guard Jonah Jackson is a physical mauler who will help in the run game. He is a battler who will push for time right away."
      },
      {
        "playerName": "D'Andre Swift",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't like the pick of running back D'Andre Swift in the second round. With other needs, taking a back that high was a luxury. Good player, but not the right pick."
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2020,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "After an outstanding offseason in 2019, the Packers flubbed this draft. Taking Love for a team on the cusp of the Super Bowl is absurd, and then taking a back in the second in A.J. Dillon was just as bad. Did they get one starter for 2020 in this draft? I don't think so, which isn't a good thing for Rodgers and gang.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Jon Runyan",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Sixth-round guard Jon Runyan played tackle in college but will move inside to guard. He is a tough guy who should make a nice transition."
      },
      {
        "playerName": "Jordan Love",
        "grade": "D-",
        "gradeNumeric": 0.7,
        "text": "It was their first one, trading up to take quarterback Jordan Love. Why do that when Aaron Rodgers can still play at a high level and they have other needs?"
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't have a lot of picks but I liked the pick of Blacklock. He will take over for D.J. Reader. Third-round pass rusher Jonathan Greenard should help that front as well.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Ross Blacklock",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Second-round defensive tackle Ross Blacklock fills a major need. I think he will be a better pass rusher on the next level than he was in college."
      },
      {
        "playerName": "Laremy Tunsil",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "Was it the move to trade away the first in this draft to get Laremy Tunsil? That's to be determined. It also cost them a lot of money. We shall see."
      }
    ]
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They traded their first-round pick – 13th overall – to the 49ers for DeForest Buckner, so they didn't pick until No. 34 when they took receiver Michael Pittman. They did need a receiver, but taking Taylor was a luxury pick with Marlon Mack on the roster. This draft was just OK for me.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Jacob Eason",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fourth-round quarterback Jacob Eason came in the right spot. He has the big arm and he can learn to be a pro from Philip Rivers. It was worth the shot."
      },
      {
        "playerName": "Jonathan Taylor",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't like the idea of trading up in the second round to take running back Jonathan Taylor. He's a good player, but they have Marlon Mack and other needs."
      }
    ]
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They filled a lot of needs with their first four picks, adding three defensive players in that group. In Henderson and first-round pass rusher K'Lavon Chaisson, they get two good defenders in that round. Second-round receiver Laviska Shenault will need to contribute right away. Keep an eye on quarterback Jake Luton.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "C.J. Henderson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Taking corner C.J. Henderson first overall was the right move. He is an outstanding cover player who does need to improve his tackling. They had a major need."
      },
      {
        "playerName": "Ben Bartch",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Fourth-round tackle Ben Bartch is a project. He isn't big naturally and comes from a small school. It will take time for him to play."
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They took Edwards-Helaire in the first round, which is always high for a back, but he will fit their offense. Gay could be a steal and keep an eye on fourth-round safety L'Jarius Sneed from Louisiana Tech, who can also play corner. I was surprised they didn't take a true corner earlier.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Willie Gay Jr.",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Second-round linebacker Willie Gay Jr. can be a major steal. He has first-round talent, but had some off-field issues at Mississippi State. The Chiefs did have a need there."
      },
      {
        "playerName": "Clyde Edwards-Helaire",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "First-round running back Clyde Edwards-Helaire is a good player, but I think they could have gotten by with Damien Williams and waited to take a back."
      }
    ]
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Mike Mayock had an outstanding first draft in 2019, so it's hard to doubt him. But after Ruggs, this draft has some questions. Why did they take two more receivers in the first three rounds? I did like corner Damon Arnette, their second first-round pick, better than most.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Henry Ruggs",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It was their first one, receiver Henry Ruggs. I think he will be a lot like Tyreek Hill, which is downright scary for the AFC West."
      },
      {
        "playerName": "Lynn Bowden",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of slot receiver Lynn Bowden in the third round. He is a bit of a project, although he has talent, and they did take Ruggs in the first."
      }
    ]
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "This draft will be defined by what first-round quarterback Justin Herbert becomes. They took him sixth overall and he has to become a star to warrant that. He has the skills, but he's inconsistent. Murray is a nice player, but there were other options at linebacker down the road. The rest of the draft doesn't matter because this is all about Herbert.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Joshua Kelley",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Fourth-round running back Joshua Kelley from UCLA will look like a major steal in a few years. He is a tough inside runner who would be a nice complement to Austin Ekeler."
      },
      {
        "playerName": "Kenneth Murray",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I like linebacker Kenneth Murray, who they traded back up into the first round to get, but I am not sure I would have made that move. They could have landed a linebacker later."
      }
    ]
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They didn't have a first-round pick after trading it away to the Jaguars in the Jalen Ramsey trade. But they did a nice job with what they did have. I think they got great value in the third round, taking defensive end Terrell Lewis and safety Terrell Burgess.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Van Jefferson",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "I love the pick of second-round receiver Van Jefferson. Some will say it was too high, but he is one of the best route runners in this draft. Jared Goff will love him."
      },
      {
        "playerName": "Cam Akers",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "Did they really need a back in the second round? I like Cam Akers a ton, but it wasn't really a major need."
      }
    ]
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Dolphins had a ton of draft capital and did a nice job with it. They took Alabama quarterback Tua Tagovailoa with their first pick. He could end up being a star, but the medicals are concerning. The rest of the draft was filled with a lot of quality picks. Second-round guard/tackle Robert Hunt will be a steal and fifth-round defensive lineman Jason Strowbridge will be a good player. The Dolphins will have a monster draft if Tua is what they think he will be.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Noah Igbinoghene",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I loved first-round corner Noah Igbinoghene, who I think can be a star with a little time. He is a fast and competitive. Nice pick."
      },
      {
        "playerName": "Austin Jackson",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "I didn't love the choice to take Austin Jackson in the first round. I think there were better tackle options. He's a project – one with a lot of talent, but it may take some time."
      }
    ]
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Vikings had 15 picks in this draft and did a nice job of using most of them. Rick Spielman knows how to use the draft to get what he needs. First-round receiver Justin Jefferson fills an immediate need and Gladney could be a star if he stays focused. Keep an eye on fourth-round linebacker Troy Dye, who can fly.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Ezra Cleveland",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Second-round offensive tackle Ezra Cleveland was a player I thought the Vikings would take in the first round. To get him in the second round is big-time value. He will be a long-time starter."
      },
      {
        "playerName": "Jeff Gladney",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Corner Jeff Gladney has the tools to be a good starter, but he's had some character concerns, according to some teams, that have to be overcome."
      }
    ]
  },
  {
    "teamName": "New England Patriots",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They traded down out of the first round to land second and third-round picks to give them 10 over three days. They seemed to be loading up on defenders and took two tight ends – or a tight end an H-back – with those 10 picks. The Pats appear to be in rebuilding mode in a big way.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Devin Asiasi",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Third-round tight end Devin Asiasi might have seemed like a reach until you pop on some tape. He can run and personnel people really liked him."
      },
      {
        "playerName": "Josh Uche",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "Second-round edge Josh Uche went a little high for my liking, but he does seem to fit the type of player Bill Belichick wants on his defense."
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They had just three picks before trading back into the seventh for a quarterback, and I like the players they took, but Ruiz in the first was a little off. Baun and third-round tight end Adam Trautman should be early contributors.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Zack Baun",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Third-round linebacker Zack Baun will be a good player -- a nice versatile one for the defense. He can play outside and inside and is tough. They traded up to get him, so he better be good."
      },
      {
        "playerName": "Cesar Ruiz",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I love the center/guard Cesar Ruiz as a player. But was he really needed by this team right now? I know Larry Warford is in the final year of his deal at right guard, but I think Ruiz would be better suited to playing center."
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They had to improve the offensive line, and they did. Landing Thomas and third-round tackle Matt Peart will give them a pair of bookends down the road. Second-round safety Xavier McKinney is a playmaker who will help the defense.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Andrew Thomas",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It was their first one. Taking tackle Andrew Thomas fourth overall was the right move. He was the best tackle in this class."
      },
      {
        "playerName": "Xavier McKinney",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Second-round safety Xavier McKinney is a playmaker who will help the defense."
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They filled a major need taking tackle Mekhi Becton in the first round and then added receiver Denzel Mims in the second to fill another. Davis is a good player and good be a message that Adams might be on the move. It was a solid first draft for Joe Douglas.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Ashtyn Davis",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round safety Ashtyn Davis is one of my favorite players in this draft. With Jamal Adams and Marcus Maye, it's a pick for the future, although defensive coordinator Gregg Williams could get creative with him."
      },
      {
        "playerName": "Jabari Zuniga",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Third-round pass rusher Jabari Zuniga has some ability, but that might have been a tad high for my liking."
      }
    ]
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "First-round receiver Jalen Reagor will be a big-time player in their offense. I also liked the trade to land Marquise Goodwin from the 49ers to add another speed dimension. The pick of Hurts is puzzling. It's a pick based on the starter getting hurt, which is a terrible mindset. Keep an eye on fourth-round safety K'Von Wallace as a potential steal.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Davion Taylor",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round linebacker Davion Taylor is a freakish athlete who was a track star. That tells you about his speed. He will fit perfectly with the way the game is played now."
      },
      {
        "playerName": "Jalen Hurts",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "I really don't understand the pick of quarterback Jalen Hurts in the second round. They had other needs and he is basically a backup to Carson Wentz. Why?"
      }
    ]
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They traded away their first-round pick to land safety Minkah Fitzpatrick, which was a good move. I didn't love the Claypool pick, but I did like Dotson and third-round linebacker Alex Highsmith.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Kevin Dotson",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Fourth-round guard Kevin Dotson will become a good player. He is a tough, physical guard who can maul people at the point of attack."
      },
      {
        "playerName": "Chase Claypool",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of Chase Claypool in the second round. It's hard to argue with their receiver picks based on recent history, but this isn't one I love."
      }
    ]
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They did add two good players in defensive tackle Javon Kinlaw and Aiyuk in the first round. Some scouts love Kinlaw, while others thought he played too high. The trade to land left tackle Trent Williams from the Redskins to fill the spot of retiring Joe Staley was a nice move.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Brandon Aiyuk",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "First-round receiver Brandon Aiyuk will be a playmaker in their offense. He's got explosive run-after-the-catch ability. Plus, he's a Sun Devil."
      },
      {
        "playerName": "Javon Kinlaw",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "It's not a pick, but a decision. Why didn't they take a corner? They have issues at that spot and should have addressed it at some point."
      }
    ]
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Even though he isn't an immediate need, first-round linebacker Jordyn Brooks has future-star potential. He fits their defense perfectly. Taylor was probably taken a little high, but third-round guard Damien Lewis could be an early starter in his career. I didn't love this draft, but it's hard to doubt John Schneider.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Colby Parkinson",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Fourth-round tight end Colby Parkinson will be a nice red-zone target in their offense. He is 6-7 and can really go up and get the ball."
      },
      {
        "playerName": "Darrell Taylor",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Darrell Taylor has the length and speed teams like, but he disappeared at times in his career. He's more of a project and they need edge-rush help now."
      }
    ]
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They traded up one spot to land first-round tackle Tristan Wirfs, which they had to do. He will be an immediate starter on the right side. Getting Winfield was a nice pickup as well.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Antoine Winfield Jr.",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Second-round safety Antoine Winfield Jr. adds a nice piece to a back end that is young and needed help. He has the range teams love."
      },
      {
        "playerName": "Ke'Shawn Vaughn",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Third-round running back Ke'Shawn Vaughn is a good runner, but I think there were better options on the board when he was taken."
      }
    ]
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "I liked the first two picks, getting tackle Isaiah Wilson and Fulton in the first two rounds. Taking a back in the third is a luxury, but they do like to run the ball and Darrynton Evans is a good player. What's the future for Derrick Henry?",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Kristian Fulton",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "They got great value on second-round corner Kristian Fulton. I thought he had a chance to be their pick in the first round. Nice pick."
      },
      {
        "playerName": "Larrell Murchison",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Fifth-round defensive tackle Larrell Murchison was is just OK in my book. But it was only a fifth, so it's worth taking the chance."
      }
    ]
  },
  {
    "teamName": "Washington Commanders",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "After Young, they did a nice job landing running back Antonio Gibson from Memphis and tackle Saahdiq Charles with their next two picks. Both guys were on my Better-Than team. Fourth-round receiver Antonio Gandy-Golden has a chance to be a solid player.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2020-nfl-draft-grades-for-all-32-teams-vikings-among-four-to-earn-an-a-packers-given-lowest-mark/",
    "playerGrades": [
      {
        "playerName": "Chase Young",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": "It has to be their first pick, defensive end Chase Young. He is a big-time pass rusher who will become a Pro Bowl edge player early in his career – maybe even as a rookie."
      },
      {
        "playerName": "Montez Sweat",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "They didn't have a second-round pick because they traded back into the first round to get pass rusher Montez Sweat last year. They better hope he becomes a good one."
      }
    ]
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Landing Diggs, Epenesa and Moss with their first three picks feels like a giant victory for an ascending team that could pounce in the post-Brady AFC East era. The Bills have a smart scouting staff with a deep talent-evaluation bench, and they made the most of their remaining picks after the trade with Minnesota. If Moss can keep his body right, he could be outstanding in a timeshare with Devin Singletary. The Day 3 receivers both came at great values, Fromm was too good to pass on that late and Jackson was far better than DBs taken before him. Get on board now, folks, as this team is going places.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2020,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The draft lost steam after the thrilling Tagovailoa pick, but the team added a lot of talent over the weekend. Jackson can work into a starting role. Igbinoghene could be the starting nickel and top returner. Hunt might be ready to mash people now, and Kindley gives Miami another mauler. Davis and Jones were not personal favorites, but they're dirty-work players for head coach Brian Flores, a man who loves those types. Day 3 values came in the form of Strowbridge and Weaver, and Perry will be a fun training-camp story who might squeeze his way into the picture.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "General manager Joe Douglas' first draft with the Jets appears to be a nice haul overall. Becton over Tristan Wirfs was a debatable call, and I made my very soft case against Zuniga, a picking of nits here. The Jets needed talent influxes all over, and they checked a number of boxes while mostly maximizing value. A few of the players they picked are wait-and-see projections, but we're confident there isn't a high bust factor to this class unless Becton's weight becomes an issue. The later picks of Morgan, Clark, Hall and Mann were smart. There's a lot to like overall in this group, and they smartly used the extra draft ammo traded for vets Leonard Williams and Darron Lee.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "In a bizarre coincidence, the Patriots' first five picks landed eerily close to my overall rankings. I had Dugger 41st (he went 37th), Uche 60th (nailed it on the head), Jennings 82nd (went 87th), Asiasi 101st (went 91st) and Keane 108th (he went 101st). Don't know what that means, but it was the strangest thing I've seen doing this for a few years now. We need massive flow charts to track all of busy-as-ever New England's trade movement involving their 2020 picks, but the Patriots seemed to do well to make up for trade mistakes (Mohamed Sanu so far anyway, and Michael Bennett) to gather depth. The only person not worried about the QB depth seems to be Belichick, and he's good at coaching. So transitively, we're not worried. Uche could be the sneaky star here, and both tight ends were massively underused in their teams' inconsistent passing games, so there might be untapped receiving reserves. The picks from Herron on were basically throwaway picks in that the Patriots have few actual roster picks open. Was this a banner group? I doubt it but it's not stunning they went this direction, even if the approach confuses some.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Every year, the Ravens seem to sit back and let great value come to them. A trade here and there, but this year everything lined up beautifully. And their draft haul already was strong before they made a 2020 selection, essentially flipping two fifth-rounders and Kenny Young for Marcus Peters and Calais Campbell. So nabbing two veterans, plus a tremendous haul in the first four rounds and some quality late picks (Proche and Stone in Round 7, are you kidding me?!), makes this a home-run effort by Eric DeCosta and his crew in Year 2 running the Ravens' draft.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bengals were quiet on the trade front, just sitting back and making picks of players they liked. It proved to be a sound approach. Ignoring the offensive line early might be something they regret, but maybe Adeniji turns into a serviceable guard. Kareem is a nice piece. Bailey was a great gamble late; if he's healthy, that dude can play. And let's face it: This puppy comes down to Burrow thriving or not. He can be special, even if the early results might be frustrating. He has a chance to lead this franchise out of the darkness, and the remainder of the class reads like a solid haul to help that effort.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "We've said it before in past draft weekends, but the Browns helped themselves. Four of the first five picks carried some notable value and Bryant and Harris were worth fifth-round fliers despite a lack of size for both. They each bring tenacity and a football-first mentality that will serve them well. This class really is about the trio of Wills, Delpit and Elliott helping early on. There was a point where I could have made a case for all three being in the first-round picture. Hard not to like what Cleveland did.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Factor in the Minkah Fitzpatrick trade, plus the move up to land Devin Bush a year ago, and this draft class already has paid big dividends. Landing an athletic playmaker and special-teams demon in Claypool was a smart first pick, and Highsmith is a fascinating project. This class isn't sexy but we're fans of most of what Kevin Colbert and crew accomplished.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2020,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "For as strange as some of the Texans' veteran moves are, they can surprise us with their sneaky draft effectiveness. That's a good thing when you trade away first-round picks. They found some solid players across the board, with Blacklock, Greenard and Reid (a smart, plucky nickel corner) possibly able to come in and aid the defense early. Coulter is also one to watch, with some eye-opening tape against better competition, even if he's raw. Don't forget, the Texans can rightfully count Laremy Tunsil, David Johnson and Brandin Cooks as unofficial members of the 2020 draft crop, but no rose-colored spin can remove the mouthstank that was the DeAndre Hopkins trade.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Their first-rounder netted DeForest Buckner, and we might be having a Buckner-Javon Kinlaw debate in a few years. For now, the Colts came out with the immediate contributor they wanted, plus a draft class with some other game-changers on offense in Pittman and Taylor. Eason could take this from a strong class to a huge winner if he develops, and if not? Well, the investment was small enough where we can still justify them taking the shot where they did. The Colts had several Day 3 fliers, and 2-3 of them could help out. A typical Chris Ballard class that likely won't feature many true busts.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Jaguars quietly had a successful weekend. Flipping Jalen Ramsey for two first-round picks (one this year, one next), plus a fourth-rounder in 2021, will almost certainly be a big win. Shedding the contracts of A.J. Bouye and Nick Foles for a pair of fourths also feels like the smart approach for a rebuilding team. Perhaps they could have gotten more for Calais Campbell. But make no mistake: They'll be in the Trevor Lawrence sweepstakes next year, so there's a long-term value in this year's draft class that must be accounted for. And on top of that, they drafted three players with first-round ability — Henderson, Chaisson and Shenault — and followed them up with some other solid picks (especially Bartch, who could start a year from now). All in all, a nice weekend for the Jags, who drafted 12 players and it wouldn't be stunning if 10 or more made next year's opening roster.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They took a player I might have drafted in Round 2 in the first round. And then they used a second-round pick on a player I could have considered late in Round 1. So it sort of evens out? Evans profiles as a fun, quicker complement to Derrick Henry, and Murchison at least gives them some depth up front after trading Jurrell Casey. McDonald was a \"why the heck not?\" pick late. All in all, it was an uninspiring lot. Not bad, but not special. The Titans earned our highest post-draft grade in 2019, but that won't be the case this year.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2020,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Not having to move up for Jeudy was a coup, and every pick seemed to have sound reasoning and value. Strnad was a steal in Round 5, and Muti could be highway robbery if he can stay healthy, but that's a big question. Overall, the Broncos added speed on offense and depth on defense and the o-line. It looks like a fine little class.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Chiefs had a good draft after winning the Super Bowl. They didn't take a corner until Round 7, which was interesting, but Keyes was good enough to go much earlier. Still, the meat of this draft comes down to the first two picks and the potential for Niang to be a steal. Edwards-Helaire will be a standout immediately, and Gay — whom we mocked to the Chiefs in Round 1 — could be special if he stays focused. A nice group overall.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Some panned the trade up for Murray, but we love his athleticism, energy and leadership. Behind that defensive line, he could blossom as a playmaker more than he did in college. Herbert can be brought along at the proper pace, with no need to throw him out there before he's ready for Anthony Lynn. And really, they plucked a few good skill-position values, including Kelley, late. Overall, there's a safe feel to this crop, even with the value picks late.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Even with the Raiders' plan to move Bowden — a college receiver who was forced into QB duties out of need — to running back, we still see a little bit of overlap here with him, Ruggs and Edwards. They're all different styles, but getting early returns from all three could be tough. Simpson was a nice pick late who should outplay his draft status, along with Robertson. It's a top-heavy crop, with no picks after Round 4. Did the Raiders land enough high-end impact players overall? With the book closed on the Khalil Mack trade, that question will be asked more.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Cowboys could not have hoped for better. Maybe if you're one of those need-over-everything people, you could bemoan the lack of a safety or a tight end or something. Maybe a linebacker. We're not really \"need\" people. Besides, their first six picks addressed areas that were softer than others on the roster. Lamb steps right in, Diggs enters the CB mix, Gallimore will make the most of his snaps, and Robinson was one we had our eyes on at the Senior Bowl. Hall of Famer Aeneas Williams volunteer coached the Bengals DBs that week and mentioned Robinson to us. Anae and Biadasz were well worth their draft slots. Take a bow, Cowboys. Can't do much better than this.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "A solid little class. Not too much flair, most holes filled somewhat. If Thomas thrives and becomes the backbone of the line, the class is a respectable success. McKinney also should be a core piece. Peart will be a reserve to begin, and Holmes at best might make a run at the nickel spot. Brown is intriguing, with his long, lithe build and playmaking instinct. It doesn't feel like a class with a ton of upward mobility, even factoring in the pick traded for Leonard Williams. A bit … circumspect maybe?",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The most telling moment of general manager Howie Roseman's media draft briefing was when he was asked what the best-case scenario was for the Hurts pick, and Roseman didn't have a great answer. I'll answer it for him: Hurts succeeds for a short spell as a replacement starter and can be traded for value elsewhere. But using second-round picks on developmental QBs with the hope they'll be worth a first-rounder in a trade one day is a leap of faith. Hurts and Reagor can be used in some fun packages, and two late speed receivers — Hightower and Watkins — were smart lottery tickets to scratch. Taylor's speed is intriguing, but he's raw. Even if one of their late dart throws cash in, there's an incomplete feel with this crop.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Young, along with the pick used on Sweat, is the key to this draft. If those two rushers thrive, it's a win. If not, did they miss an opportunity bypassing Tua Tagovailoa? Would things have been different under normal offseason conditions? They got this right. The rest of the class is a mixed bag, with Gibson a potential specialty weapon and some interesting picks later (Gandy-Golden, Hudson, Curl, Ismael and Smith-Williams). It's not a one-man class, but one man — Young — will determine if this group is great or not.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "It was a typically strange Bears draft, but there's nothing offensive about any of the selections. Kmet was taken a little ahead of where we thought he should go, and Johnson a little before — he's a good player if his shoulders hold up, which was a concern for some teams. And don't forget, the Khalil Mack trade sunk its teeth into this draft-pick allotment, and the Bears potentially landed their starting QB – Nick Foles – for a fourth-rounder, so there's hidden value. Overall, it's not the most inspiring collection.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Not being able to move down from No. 3 — something they badly wanted to do — rates as a minor loss. But nabbing Okudah was the best possible fallback option, and landing Swift was a smart play in Round 2. They added some blue-collar toughness in Jackson, Stenberg and Penisini, and Okwara — reunited with his brother in Detroit — could be a feel-good story if he comes back from injury. The loss-of-value quotient after trading Darius Slay and Quandre Diggs must be factored in here, but Okudah and Duron Harmon offset that a bit.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Any grades before the players put on the pads are highly speculative to begin with, but this one especially. Love could make or break this class — in five years, our grade easily could end up an A or an F. Maybe it was a sign that a 13-3 team that was a game away from the Super Bowl doesn't think it's expecting to make that kind of run again in 2021. Or perhaps it's reflective of how much Love impressed Brian Gutekunst and Matt LaFleur, and that they couldn't let him get away. Not taking a true tackle or a wide receiver — in one of the deepest talent collections at that position in recent memory — can be questioned. But the Day 3 carpet-bombing approach to collecting interior OL depth and the Round 7 steal of Garvin was like a fine Baked Alaska following a meat-and-potatoes main course.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2020,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This class was like Rod Carew batting practice: one sharp line drive after another. In time there might be a discussion about the wisdom of the largest draft class in recent memory (15 picks!), especially given that they already own 10 picks in 2021 and could receive more in compensatory selections. Who cares that much about it now? They landed talent and value throughout and left nary a stone unturned. There might not be a star among the group, but it's a cast of middle- and upper-middle-class performers who give this roster some nice reinforcements at several positions — especially those that were considered needs.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They turned the bonus pick acquired for Mohamed Sanu into Hayden Hurst, so that needs to be factored into the equation, and their first four picks and Hofrichter — if he wins the punting job, as expected — could all contribute early on. This was not the fireworks draft some expected, especially given all the talk of a bold trade up into the draft's upper reaches, and we assumed they might snag a slot receiver or some RB depth. All in all, it reads as a workmanlike collection of talent that's neither offensive nor thrilling.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Do you like defense? Well, you better if you're a Panthers fan, because the next offensive draft pick Rhule and Co. make will be the first. Rhule is starting fresh here and building up his defense in a division made up of savvy old quarterbacks. He'll try to win games 16-13 early but could have a nice foundation here with 2021 in mind. We're on board with this class and are excited to see the long-term results.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Few teams value the interior offensive line like the Saints, which made the Ruiz pick a smart one. Erik McCoy could move to guard, or perhaps Ruiz could; either way, they have a strong bulwark inside, and it's the way they've built that unit year after year under Sean Payton. Trading four picks for Trautman seems high when you phrase it that way, but our 59th overall prospect shouldn't have fallen out of the top 100. The top three picks all made good sense and will provide value, even if it all might not be fully realized until 2021.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2020,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Wirfs was the highlight, and Winfield was an inspired second-round choice. The overall class has its bright spots. Calais might prove the better value over Vaughn, and Johnson can prove his draft doubters wrong by coming in as an unsung fifth-rounder. Did they regret passing on a QB? Is the lack of an early defensive lineman concerning? Those are questions we're left with, but that wasn't anything too worrisome.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2020,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They led off the draft with three straight home runs — Simmons in the first, DeAndre Hopkins as the de facto second-rounder and Jones a shocking fall to Round 3. We always saw Jones as an early second-rounder, not the top-20 pick some pegged him as in mock drafts. Fotu and Lawrence are terrific grunts up front, and the final selection of Benjamin even had us smiling. We also wonder if he might bring up this game to Weaver when they're eventually allowed to cross paths: What a tremendous weekend for the Cardinals, building on the excitement of the Kyler Murray pick one year ago. They're contenders now.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Akers was 45th overall on our board. He was held back by an unimaginative system at FSU and some horrendous blocking. The first won't be an issue in L.A., but he still could be hamstrung if the Rams' offensive line isn't improved. We didn't love the Jefferson or Fuller picks, but the rest of the selections made sense. General manager Les Snead has counted on his good scouting staff to find talent without first-round picks (get used to it, too), and for the most part they did a respectable job.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2020,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Seattle does things its own way, public perception be damned, and you have to respect that approach. The staff is immune to outside influence and knows exactly what Pete Carroll wants in a prospect. Does it always net the Seahawks the best value? That's debatable. But this isn't the dumpster fire of a draft class some will say it is. Taylor and Robinson have moldable pass-rush ability if their character concerns have been diminished, and Lewis, a few of the late pass catchers and Dallas (a good pass blocker) should help out Russell Wilson.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2020,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Time will tell whether swapping Buckner for Kinlaw and trading up for Aiyuk were the right calls, and we're willing to wait to pass judgment. Landing Trent Williams following the retirement of Joe Staley could prove to be a masterstroke, and there are some redeemable late picks in this draft class that could stick. It was always going to be an uphill climb with the lack of picks, but the 49ers made lemonade from lemons.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2020-nfl-draft-grades-054820886.html",
    "playerGrades": []
  }
]