[
  {
    "teamName": "Los Angeles Chargers",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Chargers' top two needs headed into this draft were clearly defined: a left tackle to protect Justin Herbert and a starting-caliber corner. General manager Tom Telesco hit both of those early, and he didn't have to reach. Rashawn Slater (13) was a popular fit for mock drafts, and there were some teams that had a higher grade on him than Penei Sewell. He has the potential to be an All-Pro left tackle. Now, with the additions in free agency of Corey Linsley and Matt Feiler, this offensive line is suddenly one of the league's 10 best. Herbert was pressured a whopping 217 times last season. I said it on Thursday -- this pick is a dream come true for the Chargers. I thought cornerback Asante Samuel Jr. (47) would go earlier than he did, but he could play in the slot or outside as a rookie. L.A. upgraded with both of these picks. Wideout Josh Palmer (77) averaged 21 yards per catch in 2018, and his numbers would have been better if he had consistent quarterbacks throwing to him. Tight end Tre' McKitty (97) wasn't used much as a receiver in his lone season at Georgia, but he can block a little bit. Versatile linebacker Chris Rumph II (118) was one of my top available prospects for Day 3, and I'm curious where he'll fit in Brandon Staley's defense. Larry Rountree III (198), my eighth-ranked running back, put up 3,720 career rushing yards at Missouri. Again, Telesco didn't reach to fill two big voids, and so this class is one of the best of the year. This team absolutely got better.",
    "sourceName": "ESPN",
    "sourceUrl": "https://www.espn.com/nfl/draft2021/insider/story/_/id/31344964/nfl-draft-grades-mel-kiper-picks-steals-sleepers-favorite-2021-classes-all-32-teams",
    "playerGrades": [
      {
        "playerName": "Rashawn Slater",
        "grade": "A",
        "gradeNumeric": 4,
        "text": null
      },
      {
        "playerName": "Asante Samuel Jr.",
        "grade": "A",
        "gradeNumeric": 4,
        "text": null
      }
    ]
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Considering they used a top-10 pick last year on Isaiah Simmons, I would have preferred to see the Arizona Cardinals address a bigger need in Round 1. It's unfortunate Jaycee Horn and Patrick Surtain II were off the board at cornerback, but loading up at off-ball linebacker seems odd when Caleb Farley and Greg Newsome II could have been had, potentially even with a trade down. At No. 16, Zaven Collins isn't even a great value pick—he ranked 24th on the B/R Scouting Department's final big board. And while flashy wide receiver Rondale Moore represented a lot more value in Round 2, that meant ignoring their top need (corner) until they took Marco Wilson in Round 4. Wilson needs to develop more, and while Collins and Moore are intriguing athletes, they don't address major needs. Throw in a lack of quantity (they made just three picks in the top 200) and it's extremely difficult to get excited about this draft class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Few would argue that tight end Kyle Pitts isn't one of the top five players in this draft class, and he should make the Atlanta Falcons better in 2021. That said, there's a chance they'll eventually regret not lining up soon-to-be 36-year-old quarterback Matt Ryan's replacement with that No. 4 overall selection. That brings their grade down a little, as does the fact safety Richie Grant was a major reach with the polished Trevon Moehrig still on the board in the second round. They got good value and addressed a major need with third-round guard Jalen Mayfield, who yours truly viewed as a potential first-round pick, but it's silly they didn't take a cornerback or edge defender until grabbing Darren Hall in Round 4 and Adetokunbo Ogundeji in Round 6. Pitts could be a Hall of Famer, though, and I like Ogundeji's ceiling after three years of steady progress at Notre Dame. They also loaded up with nine selections in the first six rounds, which is nice because this whole thing is a crapshoot. Those factors salvage Atlanta's grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Baltimore Ravens needed help at wide receiver and on the edge and they addressed both areas without significantly reaching in Round 1. Rashod Bateman easily could have gone off the board earlier than 27th, and pass-rusher Jayson Oweh is a physical marvel who at pick No. 31 lands in an ideal environment to develop as a rookie. Beyond that, the interior offensive line has been shaky since the end of the Marshal Yanda era, so I have no qualms with the Ravens spending a third-round pick on the mountainous Ben Cleveland at guard. That afforded Baltimore the luxury to take a project in enticing cornerback Brandon Stephens with their other third-rounder, and they loaded up on depth with a total of eight picks in the first five rounds. They smartly doubled down on receiver and the edge, and fourth-round wideout Tylan Wallace was a particularly strong value pick. He's tough, dynamic, versatile and polished enough to make an immediate impact if needed. Put it all together and it was an ideal draft haul for a contending team that merely needed to tweak and patch.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Buffalo Bills were in a similar situation, and they also smartly hit a position of need early and often by grabbing edges Gregory Rousseau and Carlos Basham Jr. in the first two rounds. Some might have been clamoring for a running back or a cornerback, but drafting backs early has been proven to be a faulty strategy and the Bills at least have Tre'Davious White and Levi Wallace at corner. Rousseau in particular might need time, but he'll get it in Buffalo because Jerry Hughes and Mario Addison are there for now. I say \"for now\" because those two are 32 and 33 years old, respectively. The Bills need fresh blood beyond A.J. Epenesa on the edge, and they need as many pass-rushing weapons as they can find in order to get to Patrick Mahomes and Lamar Jackson in the quest for AFC supremacy. However, third-round offensive tackle Spencer Brown didn't address an immediate need at all and came off the board with plenty of really intriguing corners available. In fact, they didn't hit corner until grabbing Rachad Wildgoose and never hit running back at all. This particular class will need more time than most, but the good outweighs the curious for now.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Look, Jaycee Horn has the ability to become a phenomenal NFL cornerback and the Carolina Panthers also get credit for landing potential first-round receiver Terrace Marshall Jr. late in Round 2. But they took a risk drafting Horn over Patrick Surtain II and there's still a hole at left tackle in Carolina. Are they really comfortable with Greg Little and Cam Erving battling for the right to protect quarterback Sam Darnold's blind side in what should be a make-or-break season for the incoming signal-caller? They shouldn't be, which is why I would have given them a better grade for taking offensive tackle Rashawn Slater instead of Horn ninth overall. This looks a lot better if third-round offensive lineman Brady Christensen can make an early impact, especially if that comes at left tackle. But that's a huge question mark and Horn's technique isn't quite there yet either. Throw in that they really didn't need a receiver and tremendous Day 3 value picks Daviyon Nixon and Chuba Hubbard can't save the Panthers. At least they loaded up on quantity with 11 selections in total.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "This was the football version of going all-in, and considering that Khalil Mack, Akiem Hicks and Allen Robinson are running out of time in their respective primes, I was OK with the Chicago Bears trading up twice to land potential franchise quarterback Justin Fields and potential Week 1 starting right tackle Teven Jenkins in the first two rounds. They might have sacrificed some depth, and trading up is usually a bad idea on paper, but Fields represented tremendous value outside of the top 10 anyway and Jenkins easily could have been a first-round pick. The former has every tool required to become an NFL star, and the latter is a relentless and versatile pass protector who should be set to make a difference on a line that began to crack in 2020. The Bears did make five more picks, although all came beyond Round 4 and none dramatically change their grade. That said, back Khalil Herbert should be able to contribute in support of David Montgomery, Dazz Newsome could make it easier to move on from Anthony Miller at slot receiver and sixth-round steal Thomas Graham Jr. might soften the blow associated with Kyle Fuller's release at corner.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The top priority for the Cincinnati Bengals in this draft should have been to add as much support as possible for young franchise quarterback Joe Burrow. They did exactly that by taking potential star receiver Ja'Marr Chase in Round 1 and potential Week 1 starting interior offensive lineman Jackson Carman in Round 2. That said, trading down in the second round and settling for Carman was a mistake, especially after they gambled to an extent by selecting Chase over blue-chip tackle Penei Sewell. The Round 2 trade with New England cost them a chance to grab highly-rated offensive linemen Teven Jenkins and Liam Eichenberg in that spot, and the Patriots added insult by securing great value for defensive lineman Christian Barmore with that pick. That, however, is my only qualm. The Bengals drafted eight players in the next five rounds, including high-value add Joseph Ossai as a pass-rusher in Round 3. In fact, six of those final eight picks (and seven of their 10 overall) were trench players. That's a good way to rebuild, even if a bad team has no way to justify using a fifth-round pick on a bloody kicker.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2021,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "There's so much to love about the Cleveland Browns' first \"home draft\" that it's hard to decide where to start. They addressed their top need in Round 1 without reaching for cornerback Greg Newsome II. Round 2 selection Jeremiah Owusu-Koramoah might have been the best-value add of the entire draft. They didn't sacrifice quantity with seven picks in the first five rounds. Third-round wide receiver Anthony Schwartz brings some much-needed speed to the offense and they again got tremendous value with their Round 4 selection of interior defensive lineman Tommy Togiai. The B/R Scouting Department had Togiai in the top 100, but what's really wild is that same big board lists Owusu-Koramoah as the second-best defensive player in the entire class. The guy never should have dropped that far, and Browns general manager Andrew Berry deserves a lot of credit for moving up to grab him.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "You can't be too hard on a team for having bad luck, and that was the case for the Dallas Cowboys when the Panthers and Denver Broncos unexpectedly took corners Jaycee Horn and Patrick Surtain II eighth and ninth overall. But the Cowboys reacted smartly by collecting an extra third-round pick from the rival Philadelphia Eagles to move down two spots, where they picked the player they likely would have selected regardless, linebacker Micah Parsons. At certain points during the lead-up to the draft, the ferocious and athletic Parsons was considered a potential top-five pick. The Dallas defense simply needed more talent, and they got that with Parsons before grabbing their corner with the versatile Kelvin Joseph in Round 2. That said, Joseph is a risky pick as a result of a small college sample and potential off-field concerns (before transferring from LSU to Kentucky, he was suspended from a bowl game for violating team rules), and I'm dinging them for passing on the potentially awesome Asante Samuel Jr. in that spot. Ultimately, I love that they went to town with six picks in Rounds 3, 4 and 5. Their first six picks were defenders, but none jumped out at me except Parsons and massive corner Nahshon Wright, who was probably a Round 3 reach along with defensive linemen Osa Odighizuwa and Chauncey Golston (all were ranked outside of the top 100 by the B/R Scouting Department). All told, this draft contained a nice balance of quantity and quality, even if a few of the Cowboys' middle-round picks were strange.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2021,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "Maybe it was because they're satisfied with Drew Lock and Teddy Bridgewater, maybe it was because they thought they could still land Aaron Rodgers, or maybe it was because they simply love cornerbacks. Regardless, the Denver Broncos didn't need to spend a top-10 pick on Patrick Surtain II. Surtain could become a great NFL player, but they already added Kyle Fuller and Ronald Darby to work with Bryce Callahan and Duke Dawson Jr. It simply wasn't a major need for a team coming off four consecutive losing seasons, especially with Justin Fields, Micah Parsons, Rashawn Slater and Alijah Vera-Tucker on the board. Then, with Melvin Gordon and Royce Freeman on the roster, they trade up in the second round for a back? With all due respect to Javonte Williams, that's ridiculous. And from that point forward, there was nothing Denver could do to earn a strong grade. There's a lot to like about versatile third-round linebacker Baron Browning, and I'm totally down with the idea of letting fifth-round safeties Caden Sterns and Jamar Johnson battle for the right to eventually team up with Justin Simmons, but too much potential damage was done earlier.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "With Taylor Decker and Halapoulivaati Vaitai on the roster, the Detroit Lions didn't need an offensive tackle, but that doesn't change the fact they got tremendous value for No. 7 overall pick Penei Sewell, who could become dominant. Plus, Vaitai is just fine inside. The risk there was passing on a bigger need at wide receiver. And while DeVonta Smith would have been a nice addition for a team that was gutted at that position in March, they made up for that to a degree by getting fantastic value for fifth-round wideout Amon-Ra St. Brown. The USC product was the 70th-highest-rated player in the class on the B/R big board, and the elite route runner is polished enough to play an immediate role in the slot for the Lions. Beyond that, there was an obvious effort to bulk up and become nastier on the defensive side of the ball in particular, which isn't surprising considering that Dan Campbell runs the ship now. Aside from Sewell, St. Brown and steady fourth-round linebacker Derrick Barnes, I'm not sure anyone else from this class will make much of an impact early on. That's not enough for an A grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I mean, we're all sort of enjoying dumping on the Green Bay Packers for the Aaron Rodgers mess and the fact that they keep passing on good receivers early in drafts. But Amari Rodgers is actually a strong, high-value wideout selection in Round 3 and there's a chance they found a replacement for the departed Corey Linsley with Josh Myers in Round 2. Those are quality picks and they at least addressed a need with slight first-round reach Eric Stokes at cornerback. Corner, center and receiver were Green Bay's top three needs and general manager Brian Gutekunst addressed all three on the first two days of the draft. Aaron Rodgers might be insulted they continue to refuse to use a first-rounder on a wideout, but let's not pretend that was a dire need with Davante Adams, Allen Lazard, Marquez Valdes-Scantling, Equanimeous St. Brown and Robert Tonyan in the pass-catching corps. That said, Stokes is a first-round risk who might need time the contender Packers can't afford to give him and none of their Day 3 picks jump off the page. It was a smarter draft than most are giving them credit for, but it wasn't exactly bold.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Anyone gonna bother reading this one or should I move on to the Indianapolis Colts? This draft was basically Laremy Tunsil for the Houston Texans, who didn't get on the clock until Round 3 and made just five picks mainly as a result of their 2019 trade for the veteran left tackle. The worst part, of course, is the Texans were so bad last year that they could have landed Kyle Pitts or Ja'Marr Chase as well as a second-rounder like Christian Barmore or Teven Jenkins with the selections they sent to the Miami Dolphins. They also had to use a third-round pick on quarterback Davis Mills, likely because of the uncertainty surrounding Deshaun Watson. It's just a mess, and it has to be reflected in this grade to some degree, as does the fact fellow third-rounder Nico Collins was a mild reach at wide receiver (he ranked 122nd on the B/R big board). Still, Collins and fifth-round tight end Brevin Jordan fill needs, and the intriguing Jordan could easily turn into a major steal. That at least gets Houston a passing grade under brutal circumstances.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2021,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "Indianapolis Colts top pick Kwity Paye is an imperfect prospect from a weak class of edge defenders, but when he's on top of his game he looks like a potential elite pass-rusher and there was plenty of buzz he would be a top-12 pick. Landing him 21st overall is at least a mild coup for a Colts team that was in desperate need of pass-rushing help. Still, I don't love that they doubled down on the edge in Round 2 with Dayo Odeyingbo, who is unlikely to factor in as a rookie due to a torn Achilles. It's basically now or never for this Indy team, but they didn't draft a single player besides Paye who can be reasonably expected to make a significant impact in 2021. Most critically, the Colts either failed or made no effort to fill a void on new quarterback Carson Wentz's blind side before Round 7. Maybe they have something up their sleeve in post-free agency there, but right now, it looks borderline negligent. Throw in a lack of attention paid to wide receivers and Colts GM Chris Ballard has me scratching my head.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "I suppose the Jacksonville Jaguars get credit for not overthinking the first overall pick and taking potential superstar quarterback Trevor Lawrence. But that didn't require a PhD in draftology, and a lot of those brownie points were withdrawn when a team with a cheap, undrafted sophomore back coming off a 1,000-yard season used its other first-round pick on a freakin' running back. Travis Etienne is a phenomenal player, but he isn't worth a top-25 selection when you've got James Robinson and as many holes as the Jags, who ignored the safety position twice more in Round 2 and are likely to regret passing on Trevon Moehrig. They did at least address the secondary twice on Day 2, but it was weird they started with corner Tyson Campbell considering what they've invested in CJ Henderson and Shaquill Griffin at cornerback. Third-rounder Andre Cisco hits that safety need but is not refined and coming off a knee injury. Second-round offensive tackle Walker Little is a huge risk considering his injury history and sample size. There isn't much to be excited about beyond that in what was a pretty disappointing draft for a team that held five of the first 65 picks.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Kansas City Chiefs have rebuilt their offensive line after learning in 2020 that you can't be too sure about the line when protecting Patrick Mahomes. Center remained the weakest link before they used one of their two second-round picks on Creed Humphrey. The Oklahoma product should have a chance to push Austin Blythe right away, which is a good thing. And with their other second-rounder, they got solid value and addressed a need with linebacker Nick Bolton. None of it was sexy and they already used their first-rounder to land new left tackle Orlando Brown Jr. from the Ravens, but when you add it all up that's a nice haul on the first two days. Toss in that physically awesome fourth-rounder Joshua Kaindoh could be a massive steal if he blossoms as a situational pass-rusher and this was quietly a superb draft for Kansas City.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The draft can be so damn weird. If I told me Thursday afternoon that the Las Vegas Raiders would come out of the first two rounds with safety Trevon Moehrig and offensive lineman Alex Leatherwood, I would have said Moehrig was a bit of a reach in the middle of Round 1 and Leatherwood was a bit of a reach in the middle of Round 2 but both address needs and it isn't a bad start. Of course, it played out differently and the former was a steal in Round 2 while the latter was a laughable reach in Round 1, which drew more attention and made the Raiders' draft look worse than it was. I'm more concerned with the Raiders reaching the rest of the way, doubling and tripling down on off-ball defenders in Rounds 3 and 4 despite plenty of other needs. Third-round edge defender Malcolm Koonce has an extremely low ceiling for a Day 2 pick, fellow third-rounder Divine Deablo joins a huge crowd in the box and fourth-rounder Tyree Gillespie will have trouble differentiating himself as well. Throw in that they only made seven picks and it's hard to be inspired by this draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Los Angeles Chargers' draft was simple, smart, efficient and encouraging. First-round offensive tackle Rashawn Slater presented great value at 14 and is the perfect cherry on top to complete an offensive line rebuild for young quarterback Justin Herbert's sake. Second-round cornerback Asante Samuel Jr. was considered a potential first-rounder and addressed another major need for a secondary in transition. And then they gave Herbert two more weapons with third-round pass-catchers Josh Palmer and Tre' McKitty. Those last two Day 2 picks don't look like steals by any means, but they were a good indication of what the Chargers are focused on. If this is going to work, they have to support the heck out of Herbert. And with the Melvin Ingram III era seemingly over, they found a nice situational pass-rusher to replace him with fourth-rounder Chris Rumph II. With a solid nine picks in total, it was a strong haul in terms of both quality and quantity.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "It's almost as if the Los Angeles Rams are not legally allowed to possess a first-round pick. The last time they used their first-round pick was 2016, and because of multiple trades the next time they'll pick in the first round again is 2024. That puts more pressure on Les Snead and Sean McVay to nail their Day 2 selections, and it's difficult to get fired up about miniature wide receiver Tutu Atwell and stiff, one-dimensional linebacker Ernest Jones. Jones addresses a key need. Atwell? Meh. Dude is 155 pounds and was taken with former LSU standout Terrace Marshall Jr. still on the board. And both of those guys were ranked outside of the top 145 by the B/R Scouting Department. They at least loaded up with seven Day 3 selections, and it's easy to get excited about fourth/fifth-round physical marvels Robert Rochell at cornerback, Jacob Harris at wide receiver (the bizarro Atwell) and Earnest Brown IV on the edge. That said, there's no way the big picture is worth an overly positive grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Jaylen Waddle could easily become the best wide receiver in this class, while Jaelan Phillips is the No. 2 Defensive Rookie of the Year favorite at DraftKings. Both are now members of the Miami Dolphins, who addressed needs with both selections without reaching. In other words, they nailed Round 1. Beyond that, they got good value and completed their offensive line with second-round offensive tackle Liam Eichenberg, and added a perfect complement to Mike Gesicki at tight end in third-rounder Hunter Long. I thought second-round safety Jevon Holland was a bit of a reach with Trevon Moehrig available, but the Oregon product's versatility should make him a nice fit in Miami, so that's a nitpick at this point. And yeah, they made only seven total selections, but at least five of those came on Day 1 and 2. This draft wasn't about adding depth but instead putting the roster over the top. Waddle, Phillips and Eichenberg just might accomplish that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "After a trade with the New York Jets, the Minnesota Vikings essentially ended up with offensive tackle Christian Darrisaw and tantalizing project quarterback Kellen Mond with their first-round pick, which is unreal considering Darrisaw would have been a tremendous selection before they traded down from 14 to 23 in Round 1. That was a coup, and they addressed a weak offensive line again in satisfactory fashion when they used the other third-round pick they received from the Jets on potential steal Wyatt Davis at guard. The Ohio State product was a borderline first-round pick by the B/R Scouting Department's standards. Beyond that, they also found space to use two Day 2 picks on front-seven defenders Chazz Surratt and Patrick Jones II. The former could play a role right away and the latter might need time but nonetheless put up 17.5 sacks his last two years in college. There were some reaches along the way, but the Vikings crushed it off the top and added 11 draftees in total. It was a promising weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Mac Jones could very easily bust at the NFL level, but there was chatter he could be a top-five pick and a New England Patriots team in need of a quarterback landed him 15th overall without a trade-up. That's ideal. As was grabbing this class's best interior defensive lineman, Christian Barmore, in Round 2. The first-team All-SEC defensive lineman and College Football Playoff National Championship Defensive MVP recorded eight sacks, 9.5 tackles for loss and three forced fumbles as a sophomore in the best conference in college football last year. The Pats should be thrilled with that Alabama 1-2 punch to kick off the draft. They also got good value for former Oklahoma pass-rusher Ronnie Perkins in the third round, added a unique tool to the offense with large fourth-round back Rhamondre Stevenson and doubled down on some needs throughout Day 3. I would have liked to see them get in on the receiver party earlier than Round 7, but that's about the only bone I'd pick here.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "You can't earn a top grade with a six-player draft class that includes no selections in the top 25 and a reach in Round 1. That's where the New Orleans Saints stand after taking the B/R Scouting Department's 106th-highest-rated player with the 28th overall pick. That player—former Houston edge defender Payton Turner—could turn into a solid NFL pass-rusher, but it appears they could have had him a lot later on Day 2. Second-round linebacker Pete Werner was also viewed as a third-round pick by B/R, and third-round corner Paulson Adebo was considered to be worthy of only Day 3. The Saints generally draft well so these might not all turn out to be reaches. At least they addressed key needs with each of their Day 1 and 2 selections, and I'm OK with spending a fourth-rounder on wild-card quarterback Ian Book. Still, this was a pretty underwhelming draft haul.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "I'm all for the Giants landing an extra first-round pick next year and extra middle-round picks in 2021 and 2022 in exchange for a nine-pick drop from 11 to 20 in Round 1, but I was disappointed to see them reach a bit for a slot-oriented gadget-type wideout in that spot. Kadarius Toney makes them better on offense, but he doesn't address a glaring need and he was ranked 60th in the class by the B/R Scouting Department. With potential top-12 picks Kwity Paye and Christian Darrisaw still on the board at edge defender and offensive tackle, respectively, the Toney pick is a huge risk at 20. They did address the edge with golden second-round selection Azeez Ojulari, who has the polish and explosiveness to make an immediate impact and could have been a top-20 pick. Third-rounder Aaron Robinson could help out in slot coverage right away as well. But they drafted just three players the rest of the weekend and none jump out at you. This class could easily rock or flop, but the lack of quantity is at least balanced by the fact that they gained more 2022 draft capital.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Nobody will suggest the New York Jets didn't get a lot better this weekend, but I don't think they fully capitalized on their immense draft capital. No. 2 overall pick Zach Wilson is a huge risk at quarterback after one good season in college, and they might regret passing on the much more established Justin Fields. They essentially sacrificed a strong Day 2 selection in order to move up for offensive linemen Alijah Vera-Tucker, only to discover that the similarly-rated Christian Darrisaw made it to their original pick at 23. And while second-round pick Elijah Moore has a high NFL ceiling, it was a slightly odd selection considering the presence of Jamison Crowder. I would have been all over a player like Asante Samuel Jr. in that spot, but the Jets didn't take a corner until Round 5 and that position is still a joke on their depth chart. But they did take two safeties and a running back before selecting that cover man (Jason Pinnock), for some reason. OK, I actually like the Michael Carter pick (the back, not the safety they drafted with the same name), but backs are generally pretty easy to find and the Jets were neglecting the cornerback spot at that point. It's still neglected.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Did the Philadelphia Eagles really need to trade up in the first round for a receiver one year after drafting a wideout in Round 1? In the process they passed on Justin Fields, who would have widely been viewed as a significant upgrade over Jalen Hurts at quarterback. I mean, the No. 12 overall pick and a third-round selection is a lot to pay for the undersized DeVonta Smith, especially with Jalen Reagor, J.J. Arcega-Whiteside and Travis Fulgham on the roster and plenty of receiver talent (as always) available on Day 2. I'd absolutely take Fields and Rondale Moore or Terrace Marshall Jr. over Smith and injury-prone project offensive lineman Landon Dickerson (who Philly took in Round 2). There's a lot to love about the athletic and versatile Milton Williams as a third-round defensive lineman, and they addressed a need with underrated corner Zech McPhearson in Round 4, but that and a high quantity of picks in the later rounds doesn't make up for some questionable decisions early.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The way the Pittsburgh Steelers dug in with Le'Veon Bell a few years ago indicates they understand that it's easy to find good running backs these days. That's why it's so odd a team that suddenly has several glaring weak spots felt it had the luxury of using a top-25 selection on a back. Najee Harris has all the tools to become a Pro Bowl player, but none of the NFL's top seven rushers last season were first-round picks. A team hasn't used a high pick on a back and then won a Super Bowl thanks in large part to that player's impact since the turn of the century. The Steelers instead should have been all over an offensive lineman like Teven Jenkins or Liam Eichenberg or a pass-rusher like Gregory Rousseau or Azeez Ojulari. They could have even traded back for one of those guys. They did make eight picks beyond that, but second-round tight end Pat Freiermuth was also a luxury selection that didn't address a major need. They did get solid value for potential offensive line starter Kendrick Green in Round 3, though, and sixth-round edge Quincy Roche has an intriguing ceiling. That's just not enough for them to earn a good grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2021,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "To be clear, the San Francisco 49ers paid two first-round picks and a third-round selection just for the right to draft Trey Lance. The pick itself is part of the investment, which means a quarterback who barely played in 2020 and threw just 318 passes at the FCS level in his college career cost the 49ers three first-round picks and a third-rounder. Considering the high quarterback bust rate in Round 1, that's ludicrous. The 49ers could have paid so much less for the much more proven Justin Fields. At least they had three more selections on Day 2, but second-round guard Aaron Banks seems like an odd fit for the 49ers' zone stretch. Third-rounders Trey Sermon and Ambry Thomas are good fits and address needs at running back and cornerback, respectively, but neither of them were ranked in the top 150 by the B/R Scouting Department (the latter wasn't ranked at all). It'll likely come down to whether or not Lance succeeds, but the odds aren't in this class' favor.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2021,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "This is basically an \"N/A\" because the Seattle Seahawks drafted just three players, thanks mainly to their trade for star safety Jamal Adams. Sub him in for their first- and third-round spots, making speedy second-round wide receiver D'Wayne Eskridge their only selection before Round 4. Eskridge doesn't fill a major need and ranked 141st on the B/R big board. The Seahawks left the significantly higher-ranked Terrace Marshall Jr. on the board with that selection. The front seven also needed some attention but Seattle took no defensive linemen or linebackers and it reached for fourth-round corner Tre Brown. That said, the Seahawks got good value for the massive and overlooked Stone Forsythe as an offensive tackle prospect in Round 6. Meh.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "When your roster is stacked and without holes and you pick last in Round 1, nobody expects waves. That said, edge Joe Tryon was a reach in the 32nd spot with intriguing defensive linemen Christian Barmore and Azeez Ojulari on the board for the defending Super Bowl champion Tampa Bay Buccaneers. They could, however, afford to try to line up quarterback Tom Brady's potential successor. And while I think Kellen Mond has the most upside among the second-tier options at that position, I won't fault them for giving a shot to Kyle Trask. The Florida product is a big, proven Heisman Trophy finalist who very well could make it possible for the Bucs to remain afloat if Brady goes down or even extend a window beyond Brady's retirement in 2035. The rest of their picks were purely for depth, but don't be surprised if fourth-round receiver Jaelon Darden factors in as a \"slot machine.\"",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Considering that Tennessee Titans 2020 first-round pick Isaiah Wilson is already off the roster, I expected the Titans to take a more conservative approach in the first round this year. Nope. Tennessee is making a pretty large gamble on cornerback Caleb Farley, whose injury history is a concern. He also opted out in 2020, so there's some murkiness about his durability. That said, the Virginia Tech product is 6'2\" and 207 pounds with sub-4.4 speed, which makes him a major outlier at that position. He also intercepted four passes and allowed completions on only 36 percent of the passes thrown his way in 2019, per PFF. If he lives up to that in the NFL, he'll be a steal 22nd overall. And since he addresses a need, I'm OK with the risk. That said, it was shocking that the Titans didn't get in on receiver action until reaching for our 262nd-rated player, Dez Fitzpatrick, early on Day 3. And they essentially replaced the Wilson pick in Round 3, but I think Jalen Mayfield would have been a safer O-line pick than Dillon Radunz. Overall, they did at least load up on depth in the first four rounds, and they got a good deals for their second cornerback draftee, third-round Washington product Elijah Molden, as well as fourth-round edge Rashad Weaver. It was a mixed bag that has a higher variance than most classes.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "If I ran the Washington Football Team, I would have taken Jeremiah Owusu-Koramoah over fellow linebacker Jamin Davis 19th overall. But JOK dropped all the way into the bottom half of the second round, so it's clear a lot of other teams disagree. Regardless, Davis fills a need and isn't a reach because, despite being a bit of a project, he has the tools to become an All-Pro off-ball presence in D.C. They also got great second-round value for prototypical left tackle Samuel Cosmi, although he also may need some time. And beyond Round 2, they at least swung the bat on eight more picks, with the highlight coming when they stole exciting vertical threat Dyami Brown with No. 82 overall selection. I would have preferred to see the WFT make more picks that have a higher likelihood of paying off right away because the team is in such quality shape defensively. However, that doesn't change the fact they found lots of value and addressed some glaring soft spots.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2942511-2021-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Their first two picks will both make an immediate impact. Zaven Collins will start at the Mike linebacker, while Moore will be their slot player. They didn't have a third- or fourth-round pick because of the trades to help land receiver Deandre Hopkins and center Rodney Hudson. This team helped itself in a big way this offseason.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Getting Pitts will define this draft, and I love him as a player. Second-round pick Richie Grant will be a ballhawk on the back end. Getting offensive line help was also smart. Solid draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They had two first-round picks, and I didn't love either one of their selections. In addition to Bateman, they took Penn State edge Odafe Oweh, who has tools but didn't have a sack last year. It's hard to argue with their track record drafting, and Eric DeCosta is one of the best, but I didn't love this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They wanted to address their issues on the edge, so their first two picks make sense. To beat the Chiefs, you have to pressure Patrick Mahomes, so it works. If Rousseau can show that he can play like his 2019 tape at Miami, they will have a much better grade down the road.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Landing corner Jaycee Horn in the first round fills a major need, and it tells you they believe in Sam Darnold. I like the move. They added some other players I like, including Tremble and left tackle Brady Christensen.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bears were aggressive, and it was the smart thing to do. This regime needs to win now, and they drafted like it. They don't care about the future — even if they wouldn't admit it. Getting Fields will define this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They opted for receiver Ja'Marr Chase in the first round over tackle Penei Sewell, which I wouldn't have done, but I get it. Carman better be good. I did like them drafting edge players in the third and fourth round since they have a nice history of developing edge players from rounds 2-4.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They needed to help the defense, which they did with their first two picks. Corner Greg Newsome II is a good player, while linebacker Jeremiah Owusu-Koramoah is a hybrid who will also help. I really like their later picks, especially Schwartz, fifth-round linebacker Tony Fields and sixth-round running back/receiver Demeric Felton.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They clearly wanted to upgrade their defense, which they did by using their first six picks on that side of the ball. First-round linebacker Micah Parsons can fly, while fifth-round linebacker Jabril Cox is a thumper. This serves notice to Jaylen Smith — who could be let go after the season— and the rest of the linebacker group. They also took two corners and two down players. It was a good haul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I really like what the Broncos did. They landed the best corner in Surtain and then continued to load up on good players. Their later-round picks were impressive. I really like fifth-round safety Jamar Johnson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Lions went big, big, big with their first three picks, which is the right way to build a team. With Chris Spielman and Dan Campbell calling the shots along with GM Brad Holmes, you knew they would pick big players. I like it.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They didn't draft a receiver to appease Aaron Rodgers in the first two rounds, which I respect. They took a corner in the first, but they did help Rodgers with two offensive linemen and receiver Amari Rodgers with their next three picks. Did it make Rodgers happy enough?",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2021,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They didn't have much capital to work with, so it's hard to really gauge this draft. I like the move to get Mills, and fifth-round tight end Brevin Jordan has some talent and could end up being a good player.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They had to improve the pass rush, so they took shots with their first two picks, which made sense. After that, it wasn't a great haul, so this depends on Paye becoming a star.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They took some risks, taking two players — Andre Cisco and Walker Little — who have had ACL tears, but this is a draft that will be defined by how good Lawrence becomes as a quarterback. If the other risks pay off, this is a home-run draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They traded their first-round pick to get left tackle Orlando Brown and followed that by taking two players in the second round in Bolton and center Creed Humphrey who will push for time as rookies. Counting Brown, it's a solid draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2021,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They over-drafted Leatherwood, but bounced back with a nice pick of Moehrig. But why take two more safeties in your first five picks? What in the hell? The Raiders have struggled to draft with Jon Gruden running things.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "By trading their first-round pick to get Jalen Ramsey, they had to wait to get into the action. But without using first-round picks the last five years, it puts more pressure to find good players. They really need Brown and fourth-round corner Robert Rochell to become starters in a year or two.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I love their first three picks. In addition to Palmer, they took tackle Rashawn Slater in the first and corner Asante Samuel Jr. in the second. Both should start as rookies. Third-round tight end Tre McKitty will help down the road when Jared Cook is done.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I love their draft. Chris Grier did a great job, starting with Waddle and adding a lot of quality players after that. The key will be how well edge Jaelen Phillips, their second first-round pick, shows up in the pass rush. Getting a right tackle in Liam Eichenberg was big, too.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They had a lot of picks by virtue of trading down and they landed a lot of good players. Rick Spielman and gang had three really good days. They fixed the offensive line with Darrisaw and Wyatt Davis and added some defensive talent in the later rounds. Keep an eye on sixth-round pick Jalen Twyman.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Patriots, despite the perception, haven't been a great drafting team lately. That changed here. Jones and second-round defensive tackle Christian Barmore will really help this team, Barmore right away and Jones down the line. Third-round edge player Ronnie Perkins is an impressive player. Bill Belichick has had a good offseason.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They reached on two players in the first two rounds with Werner in the second and Payton Turner in the first. Both have talent, but they went too high. Taking Notre Dame quarterback Ian Book in the fourth is an interesting pick.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I really like what Dave Gettleman did. He moved down, picked up a nice receiver in Kadarius Toney, and added picks, including a first-round pick next year. Then getting Ojulari was an added bonus. Keep an eye on fourth-round edge Elerson Smith.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Jets took Zach Wilson with the second pick and then spent much of the draft building the offense around him. I love the pick of receiver Elijah Moore in the second round. He adds a speed threat in the slot. This is all about Wilson — no matter what any of the other players do. I didn't like him as much as Justin Fields.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I liked the pick of DeVonta Smith in the first round to amp up the passing game, but I think waiting until the fourth round to take a corner was a mistake. Taking two edge players late was smart.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They wanted to improve the run game, so they picked a back early. They did balance it out by taking two offensive linemen in the next three rounds, which was smart. Sixth-round pass rusher Quincy Roche is a perfect Steelers pick.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "This draft is all about the move up to take Lance. If he's a star, which the 49ers have to think will be true, it's a big hit. If not, it will be a major fail. I do like Banks, and third-round running back Trey Sermon will help. I just think they gave up too much for Lance.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2021,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They didn't have a lot of picks because of trades — their first- and third-round picks went to the Jets in the Jamal Adams trade — but I didn't love what they did with the three picks they had. It was just OK.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They were clearly drafting for the future with all 22 starters back from the Super Bowl team. That's a heck of a luxury. First-round pick Joe Tryon gives them a nice potential replacement down the line for Jason Pierre-Paul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Jon Robinson has done a nice job in the draft since taking over, but this isn't one I love. If Farley can stay healthy — big if — it can be a hit. They did add a nice player in Fitzpatrick and second-round tackle Dillon Radunz is a good player. Keep an eye on fourth-round pass rusher Rashad Weaver.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Their first four picks were all outstanding. First-round linebacker Jamin Davis will be a star. They followed that with a lot of good players at positions of need, highlighted by Brown.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2021-nfl-draft-grades-for-all-32-teams-dolphins-among-three-to-earn-a-raiders-part-of-worst-trio/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A very workmanlike haul. The first three picks addressed the lines of scrimmage heavily and with population, helping bolster for the future. Applaud this approach. The Bills might be tantalizingly close to competing for a Super Bowl, but teams that sell out for the immediate needs tend to lose out in the end. Doyle was good late value, either as a right tackle or right guard. And Stevenson was well worth the late dart throw. Another strong, deep class for GM Brandon Beane and his staff, even with a risky Round 1 pick in Rousseau.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Dolphins' 2020 draft had a safe feel to it. They went for fit and reached on a few picks. There were very few trades once the draft process was in motion. In 2021, however, Miami got aggressive up high. The Waddle and Phillips picks are swings for the fences. Phillips, in particular, carries big risk, but we get the upside if his character and medical evaluations were thoroughly vetted. Day 2 was more passive, and the picks were more conservative. Overall, Miami filled holes but might have left a few shells in the chamber in not grabbing one of the top four or five running backs.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Belichick played the hits early with the two semi-predictable Bama selections, followed by the double-dip on Sooners in Rounds 3 and 4. The one outlier for this class is the riskiness of the prospects they selected. All in all, landing a potential starting QB at 15 without having to trade up was a win, and they grabbed a few interesting projects on Day 3. This class banks on Jones following in Tom Brady's shadow and having to make his way past Cam Newton, but if there's a spot for Jones to make it, this is it.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "GM Joe Douglas is a great talent evaluator, and the proof is in the picks. Yes, we scrutinized the Wilson pick, and we would have liked to see some defensive help higher up in the draft for Robert Saleh's group. Saleh got a heavy dose of defensive blood on Day 3, with a few interesting prospects in Sherwood and Nasirildeen. But insulating Wilson and continuing the build on offense took precedence. His rookie outlook might be a little tricky, and he'll always be judged against how Lance and Fields perform, so that one pick carries a lot of weight in this class.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Ravens added more work to their plates following the Orlando Brown Jr. trade, and they came away with two interesting first-round picks. Both have star potential but also bring questions. Oweh especially is a boom-or-bust pick. This group doesn't have the excitement of the Ravens' 2020 draft class, but it looks like a fairly solid bunch on the whole. The Wallace, Wade and Hayes picks on Day 3 helped give it a late boost. Mason is the most Harbaugh/Ravens pick ever.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "After the Chase pick, it was infrastructure time. The Bengals reinforced the lines of scrimmage and doubled down on positions they attacked in free agency. And while there might be too much mimic in some of their picks — Tyler Shelvin as a D.J. Reader clone — there was some real sense to their approach. The wisdom of taking a kicker early in Round 5 always invites criticism, and that's now twice in four years they've done it. But the Bengals got two instant starters and a slew of contributors in what looks like an above-average class with a few really nice picks in Chase, Ossai, Sample and Smith. It's basically like every Bengals draft: Enough intrigue to stick around and see how it turns out.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Browns hosted the draft party, and they didn't let the hometown crowd down. It was a big weekend for the ascending team, coming off a playoff performance and improving the roster. The focus was on defense, as expected, but Hudson was a nice gamble and value selection at that stage of the draft. The four fifth- and sixth-rounders all looked like value stabs. General manager Andrew Berry seems to get the draft, and he and his staff pulled in a nice haul. Cleveland is going to be a fun team to watch the next few years. There wasn't a single pick they made that got us upset, and most of them we really liked.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "A pretty blue-collar haul here, led by Harris, a central-casting Steeler. Will the blocking be better up front? We hope so. Only Green figures to be a new starter from last year's unit, so the Steelers need to hope he's ready to step in and the other four are prepared to play better. We thought they might grab an edge rusher or a linebacker (higher than Buddy Johnson in Round 5), but for the most part this is a respectable group. Harris could be a Rookie of the Year candidate, but he had great blocking at Bama. We are unsure he'll be afforded that luxury as a rookie in Pittsburgh. Roche and Norwood, a Swiss Army knife defender, were better than their draft slots. And taking the hulking Pressley — biggest NFL punter ever at 5-foot-11, 263 pounds? — was our favorite punter pick. Massive punters are just a lot of fun.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Dealing from a short deck, new GM Nick Caserio did what he could in his first crack in Houston. The Mills pick sends a big message that the Texans are prepared for life after Watson, and there's no guarantee, of course, that Mills pans out. Collins, Jordan and Wallow were all picks we liked as the Texans started restocking the shelves. It's a long road, and this is but a first step for Caserio, but he mostly made sound, smart choices with what he had.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Paye and (eventually) Odeyingbo will help shore up the pass rush, which was an area of need. Quarterback was the biggest issue, and Wentz is the hope there — with Ehlinger worth developing while he serves as the QB-sneak replacement for Jacoby Brissett and a fun possibility as a trick-play participant. The Bahamian-born Strachan is a late-round lottery ticket worth keeping an eye on; last we saw the 6-5 receiver he had a 19-TD, 11-game season at the D-II level. Overall the grade weighs heavily on Wentz and the development of two defensive linemen who might not be instant coffee in the NFL.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Urban Meyer has a type. You can't take the college out of the coach, apparently, as Lawrence, Campbell, Little, Tufele, Smith and Farrell all were 4- or 5-star recruits out of high school. The Jaguars collected talent at pretty much every position of need, plus a few more that were not in dire shape. Clearly, the class centers on Lawrence, and that pick essentially was a gift. Overall, it was a solid group with one clear star.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The first two picks are interesting gambles — Farley a big swing on talent with notable back injury concerns and Radunz a small-school prospect switching positions and needing improved strength and better balance. The Titans needed more help at receiver early on, but Fitzpatrick is an interesting dart throw. Weaver was great value in Round 4. The Titans had sub-par special teams units last season, and it appears they targeted help for those in Molden, McMath and Breeze, who could be core members of those core-four teams. We started warming to this crop the more we sat back and soaked it in.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New GM George Paton took a very Vikings-ish approach to the draft and mostly nailed his first crack at it. There was value and purpose with pretty much every pick and some tangible upside with the selections of Meinerz, Browning, Sterns, Johnson and Williams. Sterns is Justin Simmons insurance, and Seth Williams can learn behind Courtland Sutton as he heads into a contract season. There isn't a pick we didn't like on some level for where they were selected. Strong first effort for Paton and Co. If they somehow pry away Aaron Rodgers, forget any criticism we made.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Factor in the Orlando Brown Jr. trade, and this crop looks nice. Landing Powell and Smith late were the cherries on top of a very solid class. Bolton and Humphrey could start as rookies, and Brown was the tackle the Chiefs needed. Kaindoh's pass rushing potential was worth investing in at that stage of the draft, Smith can start in this league if his medical situation — two bouts of blood clots — doesn't hold him back, and Powell flashed a little and gives the Chiefs the big receiver they couldn't get earlier in the draft. Good group for Brett Veach and Andy Reid.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The first three picks were home runs, each addressing needs to varying degrees. Samuel isn't long, but the Chargers have had success with smaller corners in the past. He's highly competitive and instinctive, and there's a path for Samuel to start Day 1. Palmer is a great sleeper. Ignore his 99 catches and seven TDs in 47 college games; look instead at the tape, which shows: 1. Palmer beating first-rounder Patrick Surtain II and second-rounder Tyson Campbell and 2. the Vols' terrible QB play. The Day 3 picks were moderately unsexy but all reasonable for where they were taken.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Their selections were a straight-up roller coaster. Hated one, then loved the next — on and on for all seven rounds. That said, Leatherwood and Moehrig could start from the get-go, and the depth on defense was addressed somewhat nicely. Overall, this feels like a hot-and-cold lot with maybe one home run in Moehrig and a glue guy in Deablo (who has the most Raiders name ever). And while we're at it, what happened to all the low-key quarterback talk?",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Cowboys' patterned approach of taking character risks gives this class a frightening quality. Parsons was allegedly involved in a hazing scandal at PSU and had his maturity scrutinized during the process by multiple teams. We mentioned Joseph above. And Ball was not allowed to return to Florida State amid dating violence allegations before moving to Marshall. On top of that, things didn't seem to line up extremely well for Dallas throughout the draft, and it adopted a carpet-bombing approach to aiding a weak defense. The Cowboys feasted on long corners such as Joseph, Wright and Mukuama, which makes sense for Dan Quinn's defense, but the last two are major projects. Odighizuwa and Golston were not beloved by many scouts and felt overdrafted by a round apiece. We'll say that Dallas' scouting staff is considered one of the best talent-evaluating groups in the NFL, but we're not sure this was their finest effort.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "GM Dave Gettleman trolled us when he traded down twice this year, after never having done it before. The Toney pick was a reach for some, but the Jaguars would have drafted him a few picks later and landing the Bears' first- and fourth-round selections was too good a value to pass up. The Giants also grabbed the Dolphins' third-rounder in 2022, giving them a slew of ammo next year. Ignoring the offensive line could be a concern, but the Giants drafted three linemen a year ago and certainly have to hope at least two of them develop into starters. That's still a worry. Overall this was a tantalizing group. The concern here is the lack of instant contributors. Toney could be a specialist. Ojulari is young and green. Robinson is a sub-package contributor. This is a down-the-line class.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "After a thoroughly confusing 2020 draft effort, the Eagles rebounded quite nicely with this year's haul. The leapfrog over the Giants to grab Smith was inspired; they wouldn't have gotten him otherwise. McPhearson (three career blocked kicks, four INTs in 2020), Gainwell and Tuipulotu were well worth the value where they were picked. Jackson has some Hugh Douglas vibes to him, able to make game-changing plays but also the kind of player who draws a lot of attention from referees. Stevens and Johnson could vie for roster spots. They also netted a lot of 2022 draft ammo with the trades with the Colts and Dolphins. For a team supposedly wallowing in dysfunction, the Eagles appeared to make the most of this class.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "It was a confusing lot on the whole. For all the upside of Davis, Brown and Cosmi, we just don't know how much immediate help WFT received here. Perhaps that's not important in the long run. But trading up for a long snapper and not selecting a quarterback was, well, interesting. Other than maybe the two seventh-rounders and Brown, we're unsure there was a supreme value anywhere. Perhaps in two or three years, this class looks better than it does now, but we're skeptical.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Pace traded Nos. 20 and 164, plus first- and fourth-round picks in 2022, in exchange for No. 11. Fields has a chance to be special, and this class could be the ultimate game-changer for this franchise, Pace and Matt Nagy. This is the most talented QB the Bears have ever had, and that's not hyperbole. The bar is low. Jim McMahon and Mitch Trubisky are the franchise's two Pro Bowl QBs. It has never had a 4,000-yard passer. We're serious: April 29 is a day Chicagoans could one day earmark as a holiday. Jenkins was an inspired choice and also worth the move up to land, assuming his hip is healthy. He reminded us a bit of former Bears right tackle John Tait before Chicago drafted him. Herbert is good Tarik Cohen (torn ACL) insurance, and Newsome is a better prospect than the Day 3 stabs the Bears have taken in recent years. Graham and Tonga have shots to make the roster for depth reasons. Maybe it wasn't a grand slam, but this class felt like a three-run shot into the upper deck.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "First-year GM Brad Holmes may have crushed his first crack at it. There was an emphasis on rebuilding the lines of scrimmage and adding tough, useful, highly athletic players throughout. Sewell can start at right tackle right away, and while there could be a learning curve, he looks like a future fixture. Onwuzurike will do something in this league. Day 3 netted great value and talent, especially with St. Brown and Barnes back to back in Round 4. Jefferson was good enough to go in Rounds 4 or 5, and the Lions got him with one of the final picks in the draft. All in all, a noble effort here.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Rodgers is a redeeming choice, and Myers could start (even though there were better center options on the board when he was picked). And we like that the Packers seem to always mine for versatile, quality Day 3 OL talent worth developing. Overall, this was a tough haul to embrace, even as some of the respectable Day 3 selections helped put a nice bow on a pig.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Once again, the Vikings had a successful run of picks, building off a strong 2020 class. The QB situation, however, left a bad taste in our mouths. It had the look and feel of a very safe approach, with plenty of dart throws as always. Surratt, Davis, Robinson and Smith-Marsette all were intriguing picks, and we urge you to keep an eye on the fascinating Davidson. But that's 26 draft picks in a two-year span — how many of the 2020 and 2021 rookies will be on this roster in two years? Sometimes a quality-over-quantity approach is needed for a team that seemingly has been stuck in neutral for years.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "A nice effort from new GM Terry Fontenot in his first time in the captain's chair. Pick after pick, we nodded along at the sensible, smart approach Atlanta took. Pitts and Grant could start immediately, and Mayfield and Dalman could be 2022 starters on the inside. For the Falcons' final two picks, Williams and Darby were well worth the value there. Williams especially looks like an instant contributor as one of the better special-teamers in college football the past few years, and he could be a starting nickel at some point.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "New GM Scott Fitterer approached the draft with an eye on volume, landing 11 picks (tied for the most in franchise history), which made sense after a few smaller draft classes under the prior regime. The Panthers executed five trades and moved all over the board, mostly down. Horn and Marshall have clear paths to starting roles. Tremble is a very Matt Rhule pick who should be fun to watch in Brady's offense as a blocker and a \"move\" piece. Nixon and Brown had some character concerns that cropped up, but they were worth the risks on Day 3. We also had a soft spot for Smith's competitiveness and quickness, likely projecting as a backup for Moore. Taylor's length makes him interesting. Perhaps ignoring safety will come back to bite them. Overall, this was a worthy crop.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "We were teased with rumors of them trading up (for Justin Fields? A cornerback?), but that never materialized. The first two picks, in turn, lacked inspiration. And how did we not see the Book pick coming? This was the most Sean Payton choice ever. Baker feels like a typical Saints seventh-round dart throw; he's one to keep an eye on, with myriad skills. On the whole, this was a tough one to swallow. Wide receiver and nose tackle, two other areas of need, were bypassed higher up in the draft.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Bucs' roster is loaded, and they were picking at or near the end of every round, slimming the pool of talent available at each spot. Tryon interests us a bit, and he's in a good spot behind Jason Pierre-Paul and Shaq Barrett, able to develop in 2021 with a possible 2022 starting job in mind. Hainsey's intangibles and five-position versatility make him an active-roster candidate each week, but he might never be more than a super-sub. This class' limited appeal might not have much effect on how this next season goes, but it could be something we look back at with regret in a few years.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "There was a run on corners between the Cardinals' first- and second-round picks, so the draft didn't fall into place as far as addressing that need. Collins is easy to like in a lot of respects, and his surprising athleticism and versatility can be put to good use alongside Isaiah Simmons. Even so, that felt like a luxury choice. This class didn't offend us the way some of their division rivals' did, but it wasn't one of our favorites, either.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Perhaps the run on offensive linemen right ahead of the Atwell pick was one reason why they pivoted at that spot. But not drafting a single blocker — arguably their biggest hole(s) — feels like malpractice. The Rams can try to convince us they like their OL options better than the rest of us do, but the proof will come in training camp when we suspect they'll be looking for outside help. Jones, Bobby Brown III and Earnest Brown IV were players we liked to help their defense, and it's not as if we aren't intrigued by Atwell, Harris and Skowronek as pass-catching options. It just wasn't a position we thought needed so many bodies.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "This all hinges on the giant risk at No. 3. Lance cracked our top 10 (No. 6 overall) with his thrilling talent, maturity and superstar potential. We also would have taken the more ready-made Fields over him as a safer projection. The comparison of their career arcs will be made for years (and you could throw Mac Jones in there, too). If Lance hits, it's a huge win for the franchise and perhaps what puts them over the top in their pursuit of a Super Bowl title. If he doesn't, the cost of moving up for him — at a time when they have a win-now roster — might set the franchise back five years. That's the naked truth. Sermon and the three DBs they selected (Thomas, Lenoir and Hufanga) have our attention. Lance remains by far the biggest X-factor in this class' success or failure.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "This was never going to be a narrative-changing draft for Seattle, entering the weekend with three picks and ending up with the same, even after a few trades. The Brown selection went against character because of his body size and lack of length. The Seahawks are paying dearly for the cost of various trades, especially the Jamal Adams deal. If he's not a star this season, it will officially be deemed a bad trade for Seattle; remember, the Seahawks gave up next year's first as well.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/final-2021-nfl-draft-grades-002740584.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "A true physical throwback, Zaven Collins is 6-foot-5 and weighed in at 270 pounds in Indianapolis during medical checks. Despite that 1990s size, Collins had the highest PFF career coverage grade (93.6) of any linebacker in the draft class and continues the trend of Arizona drafting athletic and versatile players on defense. He allows them to implement some very interesting-looking defensive fronts in 2021. Arizona brought in A.J. Green in free agency this offseason. Given what we saw from Green in 2020, that wasn't going to keep the Cardinals from adding another dynamic playmaker at wide receiver in the 2021 NFL Draft. Moore certainly qualifies as that. His ability to create with the ball in his hands should fit in well with one of the screen-heaviest offenses in the NFL. Moore forced 37 missed tackles after the catch in his lone healthy season at Purdue as a true freshman in 2018. Tay Gowan was a top-10 cornerback prospect and a top-75 player overall on PFF's big board coming into the 2021 NFL Draft. You won't often find cornerbacks who have a chance to develop into quality starting options at this stage of the draft, but Gowan does have that chance. His combination of size, movement skills and production in his lone season as a starter at UCF should have made him a Day 2 pick. Instead, he'll enter into a competition with Robert Alford and Marco Wilson for a starting job opposite Malcolm Butler.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Falcons take the best non-quarterback in the draft with their selection of Florida tight end Kyle Pitts. He is going to be faster than any linebacker or safety and bigger than any cornerback. He enters the NFL as already one of the biggest matchup nightmares for a defense. His 96.1 receiving grade, 0% drop rate and above-average run-blocking grade in 2020 make him one of the best all-around pass-catchers we've seen in a while. The fourth-best safety on PFF's Big Board, Richie Grant had exceptional run-defense grades in college and was a stud during the one-on-one drills at the Senior Bowl in coverage, flashing the potential to be an all-around player at the next level. Grant has excellent numbers across the board and is an outstanding overall football player, but he was selected with TCU's Trevon Moehrig — PFF's top safety — still on the board. Mayfield was garnering first-round consideration at one point. That might paint this as a value pick, but Mayfield's 144th ranking on PFF's Big Board still shows it as a reach. Mayfield's upside was supposed to be his physical tools. However, his Pro Day didn't show much in the way of that to get excited about. Mayfield will likely compete for the starting left guard spot in Atlanta — the lone hole on the team's line right now. The concerns with Drew Dalman have to do with his pass protection. He has a weaker anchor and posted pass-blocking grades of 71.7, 74.0 and 68.6 in his three years at Stanford while going up against subpar competition. He is nimble, though, and his run-blocking skill set will fit perfectly into Arthur Smith's offense. Dalman recorded a 90.1 grade in that facet in 2020.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Rashod Bateman may not be an elite all-around athlete, but he has an incredibly high floor and should have been the fourth wide receiver off the board. His route-running chops and release package are NFL-ready. Bateman was a productive receiver from the slot in 2019 despite dealing with COVID-19 before the start of the year and losing 10 pounds. And from an outside alignment, he recorded 3.60 yards per route run that year, the fifth-highest mark by a Power Five wide receiver in the PFF College era. Lamar Jackson gets his WR1. Oweh is a freak athlete. At 6-foot-5 and 257 pounds, he posted a 40-inch vertical, 134-inch broad jump, 4.39 40-yard dash, 4.15-second pro agility and 6.84-second three-cone at Penn State's pro day. All of those marks rank at or above the 95th percentile among edge defenders historically. However, Oweh's pass-rush move arsenal is sorely lacking, and his rushes tend to die on contact. He produced just 10 pressures in his last six games in 2020. He's only scratching the surface of what he can become. Cleveland is a monster of a human being who mauled everyone in his path in college. The problem is that he didn't pair that size with production. He'll need to learn the more technical aspects of the game and must become lighter on his feet. Right now, he needs to play in a phone booth because any play in space is going to be rough for him. He brings a mentality that the coaches will love, but this is a big projection. Stephens is far from a great athlete, and he isn't an incredibly technical player to make up for that. This is a reach for the Ravens. Speed kills him, as it's not up to the level it should be in the NFL. A move to safety might be in the cards. If Shaun Wade wouldn't have returned in 2020 after initially opting out, he would've certainly come off the board on Day 2. He was an exceptional slot corner for the Buckeyes in 2019 but struggled mightily on the outside in 2020. The physicality wasn't there, and his press technique was a mess. Wade proved that he is a safety/slot corner and not the outside corner many thought he would be. In 2019, he made more plays on the ball (eight) than first downs allowed (seven) in the slot en route to a 78.6 PFF grade. He can be a quality defensive back, just not an outside corner. This was good value for Baltimore.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Rousseau is a physical freak at 6-foot-7 with 34.75-inch arms and 11-inch hands. He opted out of the 2020 season and carries with him concerns about how he'll fare as a true edge defender, though. Rousseau rushed the passer just 283 times in his college career, anywhere from 0-technique to stand-up outside linebacker. He earned a 71.3 pass-rushing grade from outside of the tackle in 2019, but when he rushed from the interior, it spiked to 85.1. Basham added weight throughout his college career and transformed himself into a tank of a pass-rusher with monstrous power and the ability to tear through opposing pass-blockers, but most of his best plays don't actually come by using that potent power. His consistency has been lacking, but he has the tools of a first-round player. His 2019 season came close to elite in terms of PFF grading. The Bills got the player with the best name in the draft, and that has to be worth something. We project Rachad Wildgoose as a good man coverage player who didn't always have the ability to show off those skills in Wisconsin's zone-heavy system. He forced 10 incompletions in his career and only allowed 11 total catches.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Jaycee Horn is the first defensive player selected in the 2021 NFL Draft. Horn, the son of former NFL receiver Joe Horn, is a truly elite press-man coverage cornerback. He is a physical nuisance who gets under the skin of receivers across from him. His press-man skills aren't quite a scheme fit with the Panthers, who like to play their cornerbacks in off positions, something Horn will have to improve on quickly at the next level. Marshall slid this far in the draft because of medical concerns, but on the field, he is a first-round talent and one of the few \"big receivers\" in this draft. Since the start of 2019, he has generated a perfect NFL passer rating of 158.3 when targeted. The LSU product has the potential to develop into a true No. 1 X receiver at the next level. Christensen pairs high-end production (96.0 PFF grade in 2020) with high-end athleticism, testing at the 90th percentile or better across the board at his BYU Pro Day. His biggest concern entering the NFL is whether he can hold up at tackle with 32-inch arms. That's generally below the requisite threshold for starting tackles in the league, but Christensen may be worth a shot given Carolina's other options at the position. At worst, he should be a quality alternative to Pat Elflein at left guard. Tremble has been one of the hot names coming out of draft analysts' mouths over the past few months — a throwback player who wills his opponents into submission with physicality and tenacity. He's not a receiver — more fullback than tight end — but he's a player you want on your roster. The Panthers now have a tone-setter on their offense. Daviyon Nixon stands out as one of the better values of the fifth round so far, even with him coming in significantly lower on PFF's Big Board than most around the industry. Nixon has quick feet and plays the position violently. He just didn't show much high-end on tape, posting middling PFF grades of 71.5 and 73.1 in his two seasons at Iowa. That becomes less of an issue with him coming off the board this late in the process.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2021,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Bears underwhelmed when they settled for Andy Dalton earlier in the offseason, but they redressed the situation with an aggressive move for Justin Fields, the No. 3 player on PFF's Big Board. Fields has special talent and back-to-back seasons with a 91.0-plus PFF grade. His ceiling is as high as any passer in this draft, and he's a real threat in the run game. Buried in the celebrations of Chicago selecting quarterback Justin Fields was the state of the team's offensive line on paper, but the Bears are making a major move to address that with a trade-up for Teven Jenkins. One of the best run blockers in the draft, Jenkins also pass-blocked well but had an extremely limited number of true pass-blocking plays to judge from. Thomas Graham Jr. opted out of the 2020 season, but it is still surprising to see him drop this far, given that he has three seasons of quality play as a starter on tape. He earned 80.0-plus PFF grades in each of the 2018 and 2019 seasons for Oregon and has a versatile, scheme-diverse skill set.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Bengals bring in former LSU receiver Ja'Marr Chase, reuniting him with national championship-winning quarterback Joe Burrow. Chase dominated the 2019 season, posting a 91.1 PFF grade to go along with 20 touchdowns, all thrown by Burrow. Cincinnati passes on an offensive lineman to bolster a receiving corps that was lacking a contested-catch monster. They now have one. After reuniting Joe Burrow with Ja'Marr Chase in Round 1, the Bengals attack the offensive line as expected here. It remains to be seen whether Carman plays tackle or guard in Cincinnati, but he raises the talent level of the group regardless of where he lines up. Carman has an impressive combination of size and athleticism and was playing his best football toward the end of the 2020 season. The Bengals lost Carl Lawson to the New York Jets earlier this offseason in free agency. They've since offset that loss by bringing in Trey Hendrickson in free agency and Ossai here. Ossai is an explosive athlete off the edge whose biggest strength, as listed in the PFF Draft Guide, is his motor. That motor and his athleticism form a winning combination off the edge. He should make an impact early as a rotational pass rusher. Cincinnati got great value with Cameron Sample, who we projected as a third-round pick. He blossomed as a pass-rusher in 2020 with a 90.4 grade in that facet, tying for fifth-best among all FBS edge rushers. He then proceeded to post the highest win rate of any defensive lineman in the one-on-one drills at the Senior Bowl. Sample is a nimble, versatile and powerful player who should've come off the board on Day 2.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2021,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Browns are one of the NFL's smartest teams, and they attacked one of the most valuable positions in the game here. Newsome is also a very good prospect, representing incredible value here at No. 26. He was battle-tested on a small sample of snaps in 2020, facing 34 targets through his first four games. He held his own, allowing just 93 yards and five first downs while making eight plays on the ball. His feet are easily the best in the class. Whether Newsome is playing off-coverage or press-man, he'll make plays. The Browns continue to make smart moves. It's not easy to pinpoint a clear role for Owusu-Koramoah in the NFL, but he's talented enough to contribute somewhere. He's an off-ball linebacker who had slot cornerback coverage responsibilities in Notre Dame's defense and looked good in that role. JOK is a smooth, explosive athlete who can fill multiple roles for Cleveland defensively. This is tremendous value for a top-20 player on PFF's Big Board. Cleveland continues to commit highway robbery by getting Tommy Togiai, a Day 2 pick, here on Day 3. He has a powerful bull-rush and can be a forceful 3-technique in both facets. He posted an 87.8 run-defense grade and 77.0 pass-rush grade for the Buckeyes in 2020.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Cowboys seemed destined to take a cornerback at No. 10 overall, but the Panthers starting a mini-run at the position allowed Dallas to trade back and reassess. Linebacker isn't an obvious need, with Jaylon Smith and Leighton Vander-Esch already there, but Parsons is the best linebacker prospect we have seen in years and could provide some versatility to the Cowboys defense. Both Jaycee Horn and Patrick Surtain II coming off the board before the Cowboys' selection in the first round led to the team selecting a linebacker in Round 1, but they fill the need at cornerback here with Joseph. The Kentucky product has elite speed and is a fluid mover at his size, but there were questions about his consistency on tape. That's why he ranked just 67th on PFF's Big Board. No interior defensive lineman was more dominant at the Senior Bowl than Odighizuwa. He was the highest-graded player at the position both during the week of practice and in the game itself, winning with power and quickness. Odighizuwa also has four seasons of solid-run defense grades on his resume from his time at UCLA. He addresses a clear area of need for Dallas. Their defensive tackles were regularly blown off the ball in 2020. Golston developed at a solid pace during his time at Iowa, going from a 63.7 grade in 2018 to 75.1 in 2019 before breaking out with an 82.3 grade last season. He is a physical and willing run defender and uses his hands extremely well as a pass rusher. He just might not have the explosiveness to play every down in the NFL. From out of left field, the Cowboys select Last Chance U cameo star, Nahshon Wright. He's a long corner and shows good ball skills, and he picked up five interceptions in only 18 games in his Beaver career. He is more of a zone player, which may fit Dan Quinn's scheme, but his athleticism leads a lot to be desired, and that's why this is a very big reach. Jabril Cox was the top player on PFF's Big Board entering Day 3. We projected him as a second-round prospect. He is such a smooth player in coverage, showing as much both at North Dakota State and LSU in zone coverage, when going up against tight ends and while covering the slot. This past year for the tigers, Cox ranked third among Power Five off-ball linebackers in coverage grade. His play strength isn't anything special, though.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Surtain was a curious pick considering how loaded the Broncos' defense already is on paper and the team's clear need at quarterback. But head coach Vic Fangio has a sure-thing lockdown cornerback. Surtain II, the son of former NFL cornerback Patrick Surtain, is a truly elite technical player at every facet of the cornerback position. He can press receivers out of the game and also play zone at a very high level. Surtain is a complete player. The good news is that the Denver Broncos selected the No. 1 running back on PFF's Big Board as the third back off the board. The bad news is that they traded up to make it happen, thus investing more in the position than is ever wise to do so. Williams is a tackle-breaking machine, blowing through 76 would-be attempts last season at North Carolina. Everyone's favorite draft prospect is finally off the board. Meinerz, the Division III prospect, is picked by Denver and could very easily become the team's starting center next year. He plays with superb technical ability, always showing good leverage and power. He's also an intelligent player, something you need from your center. Obviously, the level of competition is not good, and he's not very agile, but he checks every other box. Browning projects as a pass-rusher at the next level, a role he did play at Ohio State. He was a liability on the field for most of his career until this past season. While he thumps people and is a physical player, he is just not a very fast processor, and that's why teams will probably move him to the line of scrimmage. Jamar Johnson might be one of the best picks of the entire draft; he fits like a glove in Vic Fangio's defense and was a clear second-round pick in our eyes. His tackling issues and small sample size may have scared some teams away, but the coverage ability he displayed at Indiana was special. Johnson played all over the field and thrived in every role, displaying the nimble feet and the smooth hips that are required on the back end in the NFL. He produced an 89.3 coverage grade during an Indiana career that featured seven interceptions and six forced incompletions.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Penei Sewell slid a bit but falls right to the Lions, who find someone to protect new quarterback Jared Goff. Sewell is a hyper-athletic tackle who gobbles up pass rushers and moves in the open field like no one at his size should. His 95.8 PFF grade in 2019, the last season he played college football, is even more impressive because he was only 19 years old at the time. Sewell could be a Lions tackle for the next decade. The Detroit Lions are, perhaps predictably, building from the inside out when it comes to the new regime's first draft. After taking Penei Sewell in the first round, Detroit came back and grabbed an interior defensive lineman in the second and in the third. Levi Onwuzurike didn't play in 2020, but he has exceptional burst and the potential to be an elite pass rusher at the next level, albeit relying on some projection based on what we saw from him in college. The consensus was all over the board in this interior defender class, but McNeill slotted in as PFF's DT2, behind only Alabama's Christian Barmore. McNeill is an impressive athlete for a guy who tips the scales at 320 pounds. That allows him to provide more pass-rushing juice than your typical nose tackle. It's not difficult to see him becoming a difference-maker on a defense that sorely needs those types of players. Melifonwu has unreal physical attributes but doesn't always play to his size. A 6-foot-2, 205-pound corner should bully the receivers he faces, but that doesn't show up on tape very often. He lacks an instinctive feel for the position, but he has excellent burst, breaks up plays with his long wingspan and can transition in and out of his breaks as well as anyone his size. Amon-Ra St. Brown has no trump card, but he's a good all-around wide receiver. He possesses good body control, offers value after the catch, can run a full route tree and was consistently productive at USC, generating 2.11 yards per route run throughout his career. St. Brown may have to start right away for Detroit.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Stokes is one of the fastest players in this class, regardless of position. He's not particularly fluid or instinctive, though. That's why we viewed him as a third-round product at best. He does play the catch point well, has press experience and won't get beat deep, but this is still a major reach. Stokes may have a bit of a learning curve getting used to the NFL illegal contact penalty, too. Myers has never earned a PFF grade above 75.0 over a full season, and the Packers selected him at this spot with significantly better centers on the board, including the one that went one spot below to the Chiefs. Meyers has impressive explosion and power, but he is far too aggressive and often loses by going for it all and whiffing at the line. The potential is there for Myers to be more, but he needs a lot of work. The Packers finally take a receiver for Aaron Rodgers. The Clemson WR was the 128th player on our Big Board. Although he is very explosive, we don't know enough about his route-running to assume he'll run a full route tree in the NFL. Right now he's a bubble screen, jet sweep and deep-post runner, so the Packers will hope he develops a more well-rounded game. Jean-Charles locked up everyone he saw on the outside at App State in 2020, allowed just 17 catches across 52 targets while making 18 plays on the ball. He may not make up for his size with elite-level athleticism — as someone like Asante Samuel Jr. does — which will likely kick him inside in Green Bay, but Jean-Charles will bring the physicality and eyes needed to hold up in the slot.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2021,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Texans look toward the future at the quarterback position with their first selection in the 2021 NFL Draft. Mills is a former five-star recruit, has an NFL-caliber arm and got the ball out quickly while at Stanford with one of the fastest average times to throw in college football. He just doesn't bring much mobility or experience. This is an interesting decision on Houston's part considering that the team will likely be in a position to draft a quarterback early in the 2022 NFL Draft. Collins was a big-time recruit who just never produced as a Wolverine. The Texans will hope that's mostly due to the lack of quarterback talent feeding him the football in Ann Arbor. Collins is a big, physical receiver with some shiftiness who still wants to play physical football and get dirty. He also has just enough juice to run by defensive backs. Consistency needs to improve. Jordan isn't someone who you're going to ask to block inline, but he did profile as one of the more dynamic receiving threats at the position in this draft class. He has legitimate after-the-catch ability for someone his size and can be used as a weapon on crossers in Houston's offense.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2021,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Paye is one of the many physically gifted but unrefined edge rushers in this draft class. He has generational tools for the position and clocked a sub-6.5-second three-cone time, but his pass-rush plans are a bit reckless. He still managed to record a 77.8 pass-rush grade in 2019 before raising it to 87.1 on a smaller sample in 2020. With the right coaching, he can be a dominant NFL player. Another player who fits the Colts' athletic profile for defenders to a tee. Odeyingbo is an extremely twitchy athlete and has prototypical size, but he comes without the grading profile and production to match those freakish traits. The Colts have chased those players in the past several drafts with mixed results. Odeyingbo recorded 25 total pressures in eight games the last time we saw him play. Ehlinger is a four-year starter who did a good job at limiting turnovers in college. That's about where you stop getting excited about his prospects of panning out in the NFL. His pocket presence and arm both stand out as barriers to becoming a viable option at the next level. It's still not a terrible bet for Indianapolis to make at this stage of the draft.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Jaguars kicked things off with the no-brainer decision to take Trevor Lawrence with the first pick of the 2021 NFL Draft — a selection roughly five years in the making. The 21-year-old produced three 90.0-plus season grades at Clemson, starting with a breakout true freshman campaign in which he led the Tigers to a national championship. Jacksonville hit a home run by landing Lawrence but struck out by taking Etienne with its second first-round pick. Unlike Harris, Etienne is an explosive play waiting to happen; he racked up 37 runs that resulted in a gain of 25-plus yards since 2018, nine more than any other FBS back. He also greatly improved as a receiver, grading out as the best running back in that facet last season. Still, he won't generate the value of a true first-round pick — no running back will. Investing in the cornerback position is never a bad strategy, but Jacksonville is adding to a group that already has a lot more invested in the incumbent starters — specifically, 2020 first-round pick C.J. Henderson and free-agent acquisition Shaquill Griffin. Campbell is also an outside corner, which leaves him as a future option more than an early candidate to see playing time unless Henderson can feature in the slot. The elephant in the room is that Campbell was the 108th-ranked player on PFF's Big Board. Little's NFL projection requires some imagination given that he's played just 72 total snaps over the course of the last two seasons. A 2019 injury and 2020 opt-out have kept Little from being able to show his development on a football field. This still stands out as a strong bet for the Jaguars given Little's physical tools and an 81.2 pass-blocking grade as a true sophomore at Stanford in 2018. Little was PFF's OT4 and a top-30 player overall on the big board. Cisco's tape is a rollercoaster. He has some of the best range, size and playmaking ability in this class, tallying 26 combined pass breakups and interceptions across 24 games at Syracuse. Jacksonville will just have to live with some reads from Cisco that take him out of position, opening the door for big plays by the opposing offense. The Jaguars are clearly placing an emphasis on the secondary, with both of their Day 2 picks addressing that group. Smith has an NFL build for the edge and was highly productive at UAB. He's coming off back-to-back seasons with 90-plus PFF pass-rushing grades. He just doesn't look like an NFL athlete based on his pro-day testing, namely a 7.82-second three-cone time that ranks in the third percentile at the position.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Bolton isn't the athlete some other linebacker prospects are, but he has exceptional instincts and can flow to the football and make tackles that stick. On his tape, there are plays of him tracking down and snaring Kadarius Toney in the open field when he played Florida, showing that he can hold his own against elite athletes and ball carriers. Humphrey can start from Day 1 at center. He can also likely step in at either guard spot, giving Kansas City a tremendous player in terms of versatility and contingency on the offensive line, the area that effectively cost them the Super Bowl. And with Josh Myers going one spot earlier, this looks like an even better pick. Humphrey didn't allow a sack for three straight seasons in college. One has to assume that medicals played a big role in Smith falling this far, as he battled blood clots in his lungs throughout his tenure at Tennessee. This is a home run from an on-the-field perspective, though. Smith is a former five-star recruit with legitimate physical tools to work with. The Chiefs offer a good environment to continue to develop and provide depth behind veteran starters.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Las Vegas Raiders have a glaring need at right tackle and made a point to revamp their offensive line this offseason, but there won't be many who have Alex Leatherwood ranked ahead of Christian Darrisaw and a few others still on the board. Leatherwood comes from a blue-blood program, and that may be coveted more than usual in this unique draft, but he was the No. 9-ranked tackle on PFF's Big Board and had major issues in pass protection. Moehrig was the heavy favorite to become the first safety off the board in the 2021 NFL Draft. Instead, he's the third safety off the board here to Las Vegas behind both Jevon Holland and Richie Grant. Moehrig brings some much-needed playmaking ability in coverage to the Raiders secondary, but it remains to be seen how he fits in Gus Bradley's defense after playing in a split-field safety defense at TCU. There's reason to believe he can have success as a single-high safety with his size, smarts and explosiveness. The Raiders test the waters on a very productive pass rusher with Koonce. He might not have the requisite strength right now, but the team will be hoping he adds that aspect to his game. He's going to have to add some moves, but the bend and flexibility he possesses are uncoachable traits. Can he stand up to the run at the NFL level? He was a reach of about 90 spots according to the PFF Big Board. Classic Raiders. Right now he's a third-down player until he puts on NFL muscle. In a perfect universe, Deablo transitions to linebacker in the NFL and uses his relative speed and explosiveness for the position to become a good modern NFL linebacker. Unfortunately, there are going to be many universes where the former Virginia Tech safety never manages to nail down a spot and ends up living his pro career in positional limbo. Las Vegas is doing precisely what they need to be doing here by taking swings on the secondary. Gillespie is a physical player who will make an impact against the run, but he's not a quality coverage player… yet. He wasn't instinctive in college, nor is he a good all-around athlete. He also put on a subpar performance in one-on-ones at the Senior Bowl.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2021,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Some draft analysts had Rashawn Slater as the No. 1 offensive tackle on their boards. A player who had outstanding performances against Chase Young in college, Slater allowed only five total pressures on over 350 pass-blocking snaps in 2019 before opting out of the 2020 season. The Chargers have done a fantastic job of rebuilding their offensive line since the end of the season. Slater completes that job for quarterback Justin Herbert. The Chargers stand out as one of the early winners in this draft with the selection of Slater in the first round and Samuel in Round 2. Samuel's instincts and quicks make him an ideal fit in his projected off-ball zone role in Brandon Staley's new defense in Los Angeles. He recorded a forced incompletion rate above 20% over the course of his career at Florida State. Palmer was one of the few wide receivers in this Day 2 range who fit the bill as a seemingly well-rounded player on the outside. Don't be swayed by his lackluster production over the past few seasons at Tennessee. The quarterback situation there did Palmer no favors. He can create separation underneath and in the intermediate range with sudden routes and was one of the few receivers to beat new Broncos cornerback Patrick Surtain II deep this past season. He is a legitimate third option at the position beyond Keenan Allen and Mike Williams. This is a big reach for the Chargers. If they had to take a player who struggled to produce in college, you'd at least like to see them take someone who either has size or athleticism. Instead, they take a player who has neither. McKitty's one trait is his hand size, which is in the 99th percentile, but his 14.3% drop rate tells you that it might not matter much. A head-scratching pick for a player ranked 246th on our board. Rumph is one of the most interesting Day 3 prospects. His pass-rush toolbox is as good as anyone's in the draft, but he is extremely undersized. It didn't stop him from being one of the most productive pass-rushers in college football over the past couple of years, with pass-rush grades of 92.7 and 78.1 and 92 total pressures on just over 440 pass-rushes. Play strength is a different story in the NFL, though. He's a candidate to move to off-ball linebacker.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Rams grab the speedster they've been coveting in Tutu Atwell, though this is yet another reach on a smaller receiver with some issues. Atwell raised eyebrows by weighing in at the medical combine at 149 pounds, which would make him one of the lightest receivers ever to hit the NFL. His route tree was extremely limited, but there's no doubting his playmaking ability, and his best PFF grades came against man coverage. Jones was a good run defender at South Carolina, but he falls because we don't know much about him in coverage. He needs to anticipate and react faster if he is to stick at the NFL level. He brings it in the run game, but his change of direction and coverage skills leave a lot to be desired. Rochell epitomizes a Day 3 flier with an incredibly high ceiling but an extremely low floor. The ceiling is all thanks to his physical tools. Rochell's all-around athleticism landed him a spot on Bruce Feldman's \"Freaks\" list. His makeup speed, wingspan and explosiveness are precisely what the NFL wants at cornerback. His technique, on the other hand, is virtually nonexistent. Those issues showed up on his handful of reps at the Senior Bowl and throughout his time at Central Arkansas. The Rams took an athletically gifted project earlier with Rochell and took another here with Harris. Harris averaged just 1.64 yards per route run on 49 receptions in his collegiate career but lit up his pro day with a 41-inch vertical, 133-inch broad jump, 4.39 40-yard dash and 6.54 three-cone at 6-foot-5 and 219 pounds.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Like the Bengals, the Dolphins reunite their starting quarterback with a former wide receiver teammate. Jaylen Waddle arrives in Miami with experience catching passes from Tua Tagovailoa. He is an explosive play waiting to happen, whether it's on a bubble screen or a post route. He is the elite burner receiver of the entire draft class and rounds out the Dolphins' receiving corps. Jaelan Phillips boasts the best production of any edge rusher in this class, and if medical concerns weren't a factor, he could have come off the board much earlier. He recorded 42 quarterback pressures on 542 snaps last season for Miami but has already had to walk away from the game once due to concussion issues. As a result, he has less than 1,000 career college snaps to his name. There are concerns, but Miami is playing with house money with all of their draft capital and can afford to take that kind of gamble. Miami makes Jevon Holland the first safety off the board, shocking many who had TCU's Trevon Moehrig projected as a sure-fire first-rounder. Holland, who can also play cornerback, was an excellent coverage player for Oregon over two high-level seasons of play. Miami needs help at safety after stacking their cornerback depth chart over the past year, and this goes a long way toward achieving that. One of the top tackles in the country, Liam Eichenberg might not be quite as spectacular a prospect as some of the other players at his position, but he improved significantly in PFF grade every season of his college career, culminating in an 89.9 overall mark in 2020. Eichenberg didn't surrender a sack in either of the past two seasons, and he gives the Dolphins some real competition at a position they've already invested significantly in without seeing clear and certain results yet. Even with Mike Gesicki on the roster, Long fills the need for a true inline tight end. He was a volume target at Boston College — head and shoulders the best receiving option for the Eagles over the last couple of seasons. He does a lot of different things at a very good level and can help in a few different roles, he just might not have the requisite athleticism to be a difference-maker.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Trading back from No. 14 and still securing Christian Darrisaw — a top-15 prospect on PFF's Big Board — is a massive win for Minnesota. Darrisaw is fresh off a season in which he recorded the second-best single-season PFF grade by a Power Five offensive tackle in the PFF College era. He oozes power and plays with the physicality that NFL scouts and coaches dream of. Mond is one of the more experienced quarterbacks in the 2021 NFL Draft class. He dropped back to pass over 1,500 times in Jimbo Fisher's pro-style offense at Texas A&M. He also brings some athleticism and a decent arm, but that didn't lead to many high-end plays on his tape. He does provide an upgrade over Minnesota's current backup quarterback options, putting him in line to sit behind Kirk Cousins. Eric Wilson departed for Philadelphia in free agency, and Anthony Barr restructured his contract to become a free agent following the 2021 season. That opened the door for Minnesota to target a linebacker within the first two days of this year's draft. Surratt can make an immediate impact as a blitzer for the Vikings, but he's still acclimating to the position after recently switching over from quarterback. Davis struggled a bit in 2020 with a lower-body injury after coming off a very impressive 2019 season. That's the only reason why he drops to pick 86. If Davis fixes up some mental errors, he can be a real steal this deep in the draft. He plays a position of need for the Vikings and is a power player. When he gets his hands on defenders, they stop in their tracks. A very nice pick — potentially a Week 1 starter for Minnesota. Jones comes off the board over 100 spots ahead of his PFF Big Board ranking of 204. Not great value. He's a big body but may not have the flexibility and speed to get around NFL-level tackles. The Vikings are reaching on huge potential that may not ever come to fruition. Jones is one of several similar edge rushers that would likely have been available in a couple of rounds. Smith-Marsette could end up being one of the better deep threats in this class. Iowa's offense didn't do him any favors, but he has the speed to eat up a cushion in off coverage and separate down the football field. Minnesota's offense, which takes its fair share of deep shots, is a good landing spot where Smith-Marsette can compete for snaps right away in a WR3 role behind Adam Thielen and Justin Jefferson.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2021,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The narrative surrounding Mac Jones for the past few weeks was focused on whether he was worth not just the No. 3 overall pick, but the three first-round selections the 49ers invested in that draft slot. At No. 15 overall, it's an entirely different conversation. Jones led the nation last season in overall PFF grade (95.8) and was the most accurate college quarterback in terms of adjusted completion rate (84.2%) PFF has seen. This is an outstanding pick. Christian Barmore is the best interior defender in this draft, and he should have been a first-round draft pick. He is the only consistently high-level pass rusher from the interior in this class, posting a 90.3 PFF pass-rushing grade against true passing sets last year. Barmore was the No. 12 overall player on the PFF Big Board. Perkins burst onto the scene with a 90.5 PFF grade last season. The problem was that his stellar play came on only 262 snaps, and some of that was against the lowly Kansas Jayhawks. If that production is real, he is an excellent steal at this pick. He has all the physical traits that the NFL covets at the position, and the Patriots can work with him to find a role on their defense. He needs to work on his hand usage but has everything else one could ask for in an edge rusher. McGrone has legitimate sideline-to-sideline speed. His combination of range and reliable tackling makes him well-suited to shut down outside rushing attacks and screens. And at 20 years old, McGrone has room to grow and improve on some of the concerns surrounding his coverage ability.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Turner might be the biggest surprise first-round pick thus far. He broke out on a small sample in 2020 against subpar competition with a 90.0 pass-rush grade across four starts but has a coveted physical profile. He's 6-foot-6 and 270 pounds with 35-inch arms and plays a physical game. Turner is also a versatile piece with impressive bend for his size. It's a risky bet that could pay off big for the Saints, but there were other directions they should have gone here. Werner possesses a throwback linebacker's skill set, with a 240-plus-pound frame that can come downhill and lay the wood on whoever he hits. His struggles come with elite athleticism, quickness and fluidity of movement. The word \"solid\" was made for a player like Werner — the highest PFF grade he ever earned over a single season was just 70.8. The Saints finally address their biggest need entering the 2021 NFL Draft, taking Stanford cornerback Paulson Adebo. The loss of Janoris Jenkins and the uncertain future of Marshon Lattimore made it a necessity for New Orleans to address the cornerback position at some point in this draft. Adebo's blend of length and ball skills (24 pass breakups in two seasons) seems best suited for a zone-heavy scheme, making this an interesting fit with the Saints. We had Book down as a seventh-rounder/UDFA — he was the fifth-best QB option available on the PFF draft board. He's a gamer who made something out of nothing for the Fighting Irish at times, but the arm talent just isn't there. He was one who had to see it to throw it. His play style got by at the collegiate level, but it's not going to fly in the NFL.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2021,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Kadarius Toney is still learning to play wide receiver, but his development in 2020 was impressive to watch if you cued up his tape chronologically. Plus, there is no more electrifying playmaker in this draft. Toney is a tackle-breaking machine, and while he was primarily a slot receiver in college, he has the size and moves to develop into more than that at the next level. Ojulari could have easily been drafted in the first round, making this selection one of the better values so far in Round 2. He is one of the more advanced pass rushers in this class technically and has an impressive first step off the edge. It helped lead to a 91.7 PFF pass-rushing grade this past season at Georgia. Ojulari also happens to fill a clear area of need for the Giants, whose top four pressure leaders were all interior defenders in 2020. The Giants' secondary was already in a good spot entering the 2021 NFL Draft. By adding Robinson, potentially to man the slot, New York only improves its outlook. Robinson isn't your prototypical slot cornerback. He has the size and press experience to potentially play outside. He also picked up 80.0-plus run-defense grades in each of the past two seasons at UCF. New York adds another talented piece to its secondary. Williams projects as a man-to-man cornerback for the Giants. Although he had issues tracking the ball and getting his hands on passes, he's a patient player and offers a skill set that is needed in the NFL. Williams needs to gain some strength but this is an intriguing pick.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "One year ago, no one could have foreseen Zach Wilson being the second overall pick in the 2021 NFL Draft. But here we are. The BYU quarterback had a breakout 2020 campaign that saw his PFF grade shoot up from 80.5 as a freshman and 76.2 as a sophomore in 2018 and 2019, respectively, to a stunning 95.4 mark. The Jets have thrown a lot of resources at their offensive line already, but they haven't come close to completing the rebuild yet. And they were smart to acknowledge that with another first-round pick. Trading up to make it happen harms the grade on this pick, but Vera-Tucker is an excellent player, ranking 21st on PFF's Big Board. He was an excellent tackle at USC, earning an 89.2 PFF pass-blocking grade on true pass sets last year. He could potentially play right tackle or guard for the Jets. The New York Jets take Elijah Moore, who ranked 22nd on the PFF Big Board heading into the draft. Moore is a prototypical super-slot receiver. His floor will likely allow the Jets to replace Jamison Crowder for a lot less money, and his ceiling is an ability to succeed on the outside in a similar manner to other small receivers, such as Tyler Lockett and Doug Baldwin in Seattle. Moore helps revamp New York's receiving corps for new quarterback Zach Wilson. Instead of reaching for a running back on Days 1 or 2, the Jets addressed the position in the proper way by waiting until Day 3 to take Michael Carter here at Pick 107. He's an incredibly small player, but his cuts, balance and overall athleticism helped him put up monster numbers. Since 2018, Carter ranks second to only former teammate Javonte Williams among FBS running backs in percentage of runs picking up a 10-plus yard gain (21%). In 2020, Carter joined Alabama's Najee Harris as the only back to rank inside the top 10 in both rushing and receiving grades.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Eagles need elite players at many different positions, and they get one by initially trading down but then trading up to take DeVonta Smith. The Heisman Trophy winner immediately becomes the best receiver on Philadelphia's roster. All Smith did last season was produce a 94.9 PFF grade with 23 touchdowns. He can play either wide or in the slot — it doesn't matter. His diminutive size may have scared some teams off, but he has shown he can get open against anyone. If it weren't for injuries, Landon Dickerson would be a high first-round pick and one of the best offensive linemen in this draft. But multiple ACL injuries caused his stock to come with a significant medical red flag. Taking that gamble in the second round is a lot smarter than doing so in the first. The Eagles can look for him to replace Jason Kelce long-term and maybe find a starting spot at guard in the meantime. Williams is undersized on the interior. However, he showed at a historically impressive Pro Day that he has the athleticism necessary to win at that size in the NFL. He took a big leap forward this past season, improving his PFF grade from 72.6 to 90.8 from 2019 to 2020. The Eagles are set at starter between Fletcher Cox and Javon Hargrave, but Williams adds to the depth inside following the loss of Malik Jackson. The Eagles are getting incredible value for Patrick Johnson, a player ranked 92nd on PFF's Big Board. He is a nice technical player but needs to create consistent value by showing up to play on every down. When he's on his game, he is a very good player.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "This pick was not a surprise at all, and it also shouldn't be shocking to hear that we at PFF wouldn't pound the table for such a selection; any running back in Round 1 is a reach. Harris isn't much of a breakaway threat, but he does bring value as a receiver, which is a requisite in today's NFL. With the help of his massive catch radius, Harris dropped just two passes on 75 catchable targets since 2019. The Steelers snag the 55th-ranked player on the PFF Big Board at Pick 55. Pat Freiermuth is the clear second-best tight end in the class after Kyle Pitts, but this is a weak group of tight ends. He is an all-around player who fits a throwback style of offense that will covet his blocking every bit as much as his receiving skills. The Penn State product was also one of the few tight ends in college football who was the featured receiver in his offense. Green is one of the most physically gifted guards to come into the NFL in the last few years. He's fast and physical. One would think he fits more in a zone-based scheme, but he shows some strength that could make it work in a gap and pull system as well. A very good pick for a rebuilding Steelers offensive line. Roche is arguably the best value Pittsburgh has gotten all draft. Roche isn't an elite athlete on the edge, but he is adept at reading and reacting to the tackles he goes up against, which is one of the reasons why he posted PFF pass-rushing grades above 85.0 in each of the past two seasons. Roche will have an opportunity to carve out a role behind T.J. Watt and Alex Highsmith in Pittsburgh.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2021,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "After weeks of speculation, the 49ers find their quarterback of the future with dynamic North Dakota State playmaker Trey Lance. In his one full season at the helm for the Bison, Lance posted a 90.7 PFF grade and didn't throw a single interception on 288 passing attempts. He gives the 49ers a live arm to go along with his explosive running ability. It's not surprising to see the 49ers address the interior offensive line, but it is a little bit of a surprise to see Banks as the target. Banks is coming off a well-rounded 2020 season at Notre Dame in 2020 with 80-plus PFF grades both as a pass-protector and run-blocker. However, physical and athletic limitations kept him outside the top 100 on PFF's Big Board, and they make him an interesting fit in San Francisco's offense. Sermon could very well end up being the best running back in this class. He doesn't possess elite speed, but he breaks tackles and has tremendous contact balance. Still, trading up for a running back isn't going to be a great value pick. He needs to lower his shoulder pads a bit more on contact, and even though he doesn't have long speed, he does have great agility and elusiveness. Thomas plays way above his 6-foot, 191-pound frame. He comes from a pro-ready scheme where he played a lot of press-man coverage, which should translate right away in the NFL. He's fast and plays physically but still isn't that strong. The problem with Thomas is that we don't know much about him. He was a former four-star prospect but didn't play in 2020, so he only has the 672 snaps from 2019 and the 104 snaps from 2018 under his belt. He's a big unknown. San Francisco's type at the running back position over the past few years has been fast. The 49ers' first running back selection in this draft, Trey Sermon, didn't fit that type, but Mitchell certainly does after running a sub-4.4-second 40-yard dash at his Pro Day. That speed gives him some home-run potential in San Francisco's outside zone run scheme if he can stumble upon playing time in a crowded group.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2021,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Eskridge represents a massive reach according to the PFF Big Board, as he ranks 164th overall and 24th among receivers. Still, he is a perfect fit for this offense, which has a history of turning players with his profile into success stories. Eskridge is undersized but extremely polished as a route-runner with great footwork and hand use at the line. He also brings legitimate speed, and if the Seahawks can get Tyler Lockett's ball skills and physicality to rub off on him, he could justify this pick. Tre Brown is incredibly undersized and will likely be kicked inside to the slot, but he brings that dog mentality and plays bigger than his size suggests. He showed it routinely at Oklahoma and then again at the Senior Bowl. Despite that smaller stature, Brown put the clamps on his opposition and racked up big-time ball production over the last couple of years. He put up a combined 22 pass breakups and interceptions since 2019, allowing well under a yard per coverage snap. Slot corners are starters and valuable players in the NFL, and Brown is a good pick to fill that job in Seattle.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2021,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "We were lower on Joe Tryon than most other outlets and analysts. He boasts ideal size, length and explosiveness and features a menacing bull rush. We just didn't see those dominant reps on a consistent basis, and that bull rush was about all he had to his name. He posted a middling 71.9 pass-rush grade in 2019 (opted out in 2020), and nearly half of his 41 pressures that year were unblocked or clean-ups. He's a work in progress, but the reigning Super Bowl champions can afford to take a chance on him. Trask is one of the most intriguing quarterbacks in this draft because of how little experience he has. Trask didn't even start in high school, as he backed up D'Eriq King and attempted just 161 passes at that level. He has just two seasons of starting quarterback play since the age of 14, and one of them produced an elite PFF grade of 92.2, which came in 2020. Trask must project to even better play, given how inexperienced he is, and now he gets to learn behind Tom Brady. The Bucs are getting a superb technical player, though he does lack some athleticism. Hainsey enjoyed a tremendous 2020 season that saw his PFF grade jump from 74.6 in 2019 to 89.6 in 2020. Proficient in both the passing and running game, he could play tackle as he did at Notre Dame but can also be moved to guard or center without seeing much of a dip in his production. The Buccaneers are in position to make luxury picks with strength throughout their roster. Taking Jaelon Darden is a good one, adding legitimate speed and quicks to one of the best receiving corps in the NFL. He's coming off a highly productive 2020 season at North Texas when he caught 19 touchdowns and forced 23 missed tackles after the catch. He'll join the quality depth behind Tampa Bay's starters that already includes Scotty Miller and Tyler Johnson.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2021,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "If Farley had a clean medical report, he would have gone within the first 10 picks. He suffered a torn ACL in 2017, had a back operation in 2019 and then had another surgery in late March. That makes this a risky bet, but if he stays healthy, this is a huge steal. His 6-foot-2, 207-pound frame with 33 ⅜-inch arms is ideal for an NFL corner. Farley is also capable of running a sub-4.3-second 40-yard dash and boasts the production to back those traits up. He earned a 90.5 coverage grade in his final college season in 2019. Tennessee's last swing at an offensive tackle was a disaster, as 2020 first-round pick Isaiah Wilson played just three snaps on offense — all kneel-downs — before he ran himself out of town. Dillon Radunz is a little undersized and underweight but has exceptional movement skills and the tools to be an elite pass-blocker, even if it could take a period of time to get there. Monty Rice has been flying around finding the football between the hedges for as long we can remember, but he lost his starting spot to Nakobe Dean this past season. He'll need to figure out what's happening in front of him at a much higher level in the NFL, but at least he has the athleticism to work with at the pro level. He's a great tackler, but he just needs to read the game better. Molden can come in and be an excellent slot cornerback, especially on a team looking to rebuild its defensive backfield. Molden, who was the highest-graded slot corner of the PFF College era, was a borderline first-round talent and falls to the bottom of the third. There's no doubt that this is a great pick, and now Molden and Caleb Farley could change the outlook of the Titans' season. Molden is a playmaker and a great tackler — he has so much value at this pick it's incredible. The Titans got exceptional value here by selecting Rashad Weaver, PFF's EDGE10 and the 63rd-ranked prospect in this class. He has power, ideal size/length and technical refinement, but he's not going to impress from an athletic standpoint. He is also on the older side. Still, he has an incredibly high floor and should be able to make an impact right away. After coming off a torn ACL, Weaver posted a 90.0 pass-rush grade this past year.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2021,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Washington definitely had a need at linebacker, but Jamin Davis comes with significant projection. He ranks No. 41 on PFF's final Big Board but was impressive in his first season as a starter. On top of that, his workout numbers were phenomenal, and he flashed real talent in coverage, which has become the single most important trait in today's NFL. Linebacker is a tough position to play at the next level, and Davis has the tools to get it done. Cosmi is easily one of the most athletic offensive tackles in this class. That athleticism, along with his size, is always going to interest teams. Cosmi also earned pass-blocking grades of at least 82.0 in three consecutive seasons as a starter at Texas. There are some things he'll have to clean up with his technique in the NFL, but there is a lot to like with his profile coming out of college. He should compete with several in-house options for the starting left tackle job in Washington. St-Juste brings a rare combination of length and change-of-direction ability at cornerback. The Minnesota cornerback is listed at 6-foot-3 with over an 80-inch wingspan, and his three-cone and short shuttle times both ranked in the 90th percentile or better at the position. You won't find many big cornerbacks who can move like that. St-Juste just isn't all that experienced (420 career coverage snaps) despite turning 24 years old in September. Ranked 45th on the PFF Big Board, Brown falls to 82 overall. Brown wasn't asked to fill a lot of roles at North Carolina, as he played left wide receiver almost every snap, but he's a great route runner and you can project that onto the more advanced route tree he will have to run at the next level. He fills out the Washington receiving corps nicely. Darrick Forrest's athletic profile is certainly alluring — he's fast and explosive, as his 39-inch vertical and 132-inch broad jump can attest. He was a consistent performer in his time at UC with PFF grades of 73.3, 73.4 and 76.1 in his three years playing in a major role.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2021-nfl-draft-grades-all-32-teams",
    "playerGrades": []
  }
]