[
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Cardinals made eight picks, but it was a draft-day trade that will define their weekend. The Marquise Brown trade is obviously going to be their defining move of this draft. It's a win for the Cardinals in that Brown is a slight upgrade over Christian Kirk, and the club probably improved its relationship with Kyler Murray by getting his college teammate. However, giving up a first-rounder for a player on the fourth year of his rookie contract downgrades the move. Once the Cardinals actually got on the clock, they continued to help Murray by snagging one of the best all-around tight ends in Trey McBride. Rebuilding the defensive front with Cameron Thomas and Myjai Sanders after losing Chandler Jones this offseason made a lot of sense.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Falcons should be applauded for not forcing a quarterback in the first round. Going into the season with Marcus Mariota isn't all that exciting, but adding a jumbo receiver in Drake London will make his life easier. London was the top receiver among a talented class on the B/R big board. The Falcons' patience at quarterback paid off in a big way by getting Desmond Ridder. He was the only quarterback to get a first-round grade from the B/R Scouting Department, and the Falcons got him in the third round. In addition to helping out their post-Matt Ryan passing attack, the Falcons got a lot more athletic on defense. Arnold Ebiketie is a bit undersized but has a great first step, and Troy Andersen has the second-highest relative athletic score since 1987, per Kent Lee Platte of Pro Football Network. Tyler Allgeier has an opportunity to be a Day 3 pick that brings back value. He's the kind of tough between-the-tackles runner the Falcons need to pair with Cordarrelle Patterson in the backfield.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens had one of the best first rounds from a value perspective. They started by getting one of the best overall players (seventh overall on B/R big board) in Kyle Hamilton at 14. Then they traded Marquise Brown with one year left on his rookie contract to get the No. 12 player on the B/R big board with the 25th pick (originally the 23rd pick and traded for the 25th). The good news just kept coming for Ravens fans. David Ojabo could have been a top-15 pick before tearing his Achilles, and Ian Rapoport of NFL Network noted he could be ready to go by October. The Ravens shouldn't mind waiting. They grabbed another immediate-impact prospect in Travis Jones in the third round. Jones brings a huge frame with the athleticism to be a factor as a pass-rusher. All told, the Ravens likely walked away from this draft with four solid starters within the next two years. That's not even factoring in a few Day 3 picks with high upside, including massive offensive lineman Daniel Faalele and a pair of tight ends in Isaiah Likely and Charlie Kolar.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Buffalo Bills are in contender mode, which means if there's someone available who could make a difference in the playoffs, it makes sense to get aggressive. That's exactly what they did in trading up for Kaiir Elam. With all the talented passers in the AFC, Elam could be a crucial addition to the secondary. James Cook adds another pass-catching dynamic option in the backfield to compete with Devin Singletary. That's an important step toward taking off some of the burden on Josh Allen. Overall, the Day 2 picks weren't all that inspiring, but they were boosted by taking Khalil Shakir in the fifth round. He was the 43rd player overall on the B/R big board, and he adds another young receiver to Josh Allen's arsenal. Shakir could easily show a great return on investment as the heir apparent in the slot to the newly acquired Jamison Crowder.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Trades for Sam Darnold and C.J. Henderson left the Carolina Panthers with a light stockpile of picks. However, we aren't here to grade those trades, so the focus is the sixth pick here. What they did there was add an absolute mauler of a left tackle to an offensive line that was 31st in PFF's final offensive line rankings. That isn't quite the same as finding a franchise quarterback, but it certainly makes it a more appealing landing spot for one. Ekwonu was the third player on the B/R big board, so the value at No. 6 was as good as it possibly could have been. Trading up for Matt Corral has to be seen as a win. The Ole Miss product got a Round 3 grade from the B/R Scouting Department, and the Panthers didn't reach on him. Not a bad investment for a potential starter. Brandon Smith is the most notable of the Day 3 additions. He should compete to get in the linebacker rotation. Overall, the Panthers made two great choices for them with their top two picks. Since we are only grading what happened on draft weekend and forgiving them for the Sam Darnold trade, this is a good haul.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Chicago Bears are apparently taking their reputation as a franchise that has fielded great defenses very seriously. After hiring a defensive-minded head coach in Matt Eberflus, they spent each of their second-round picks on the defensive side of the ball. Kyler Gordon and Jaquan Brisker bring good value and are capable of being mainstays in the secondary. However, it's hard to get past the fact the Bears did nothing to help Justin Fields with their best picks. The first attempt at helping out Fields was a curious one. Velus Jones Jr. has excellent speed, but that's about it. He'll be 25 before the season starts and has a lot of development to do before being considered a well-rounded receiver. Even in the best-case scenario this draft only serves as a major upgrade to the Bears secondary. It doesn't do nearly enough to help out Fields, which should be the team's top priority right now.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Cincinnati Bengals hadn't used a first-round pick on defense since Williams Jackson III in 2016. So it makes some sense the Bengals targeted Daxton Hill. His value will ultimately come down to defensive coordinator Lou Anarumo figuring out how to use him. He primarily played in the slot at Michigan but has the athleticism to play deep as well. The defensive investment continued in Day, 2 but the value was questionable. Both Cam Taylor-Britt and Zach Carter were taken more than 60 spots ahead of where the B/R big board had them ranked. After investing heavily in the offensive line in free agency the idea of utilizing the draft to build out the defense is fine. But it's hard to get too excited about what the Bengals did from a value standpoint.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "General manager Andrew Berry channeled his inner Kevin Costner here working his way up and down the board. The Fitzgerald-Spielberger trade chart that Over the Cap uses to analyze draft trades loved Berry moving back in the second round to pick up two fourth-round picks. The Cleveland Browns did well to find Martin Emerson—a long and physical cornerback—in the back half of the second. He fits what they are looking for in a cornerback and could contribute at a premium position. Alex Wright and David Bell are opposite prospects. Wright's athletic profile projects the ability to be better in the NFL than he was in college, while Bell will have to overcome a general lack of athleticism to find success in the league. This class was always going to be short on immediate impact players. That's the cost of trading for a quarterback like the Browns did with Deshaun Watson. But trading back was an even bigger move toward quantity over quality in this class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Dallas Cowboys offensive line coach Joe Philbin will be the deciding factor as to how Tyler Smith pans out. The nasty demeanor and physicality are easy to love, but Smith has some technical things to work out in pass protection to maximize his value. He's a bit of a project with the 24th pick. It's hard to love the pick when Jermaine Johnson II or George Karlaftis would have immediately contributed as pass-rushers. Getting Sam Williams on Day 2 salvages the grade from that perspective. The Ole Miss product ran a 4.46 40-yard dash at the combine and had 12.5 sacks in his final season. Value was hard to find at the receiver position. Pass-catchers flew off the board early and often, but the Cowboys have to be happy with Jalen Tolbert dropping all the way to the third round. According to PFF, no receiver in college football had more receptions of 15 or more yards than Tolbert.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Denver Broncos didn't have the capital to be too splashy, but they got solid value with what they had. Nik Bonitto is a bit of an undersized one-trick pony as an edge player. Fortunately, that one trick is chasing down quarterbacks. The 248-pounder ran a 4.54 40-yard dash, and it shows up in his speed rush on film. Greg Dulcich was a great pickup in the third round. He was named the \"best receiver\" of the class by the B/R Scouting Department and addresses a clear need after Noah Fant was traded away as part of the Russell Wilson trade. While the hit rate on Day 3 picks isn't great, it helps when you have seven bites at the apple. Eyioma Uwazarike is the most interesting fo the bunch. He's an older prospect after a six-year collegiate career, but at 6'6\" and 316 pounds with 12 tackles for loss and nine sacks in his final season, he's an intriguing fit as a defensive tackle/defensive end hybrid.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Detroit Lions front office had to be ecstatic the Jaguars were willing to take the gamble on Travon Walker at the top of the draft. It allowed them to take a prospect in Hutchinson that brings a high floor to the table while still carrying the potential to be a Pro Bowl-caliber pass-rusher. The news kept getting better for the Lions' faithful in the first round. They moved back 12 spots in the second round and give up a third-rounder to move up 20 spots in the first and pick up Jameson Williams. Jared Goff might not have the arm to unlock his potential, but whoever the quarterback in 2023 is going to be grateful for the move. Doubling down on edge-rushers was a smart move. The Lions were 29th in pressure percentage last season, per Pro Football Reference. Hutchinson and Josh Paschal should help that number rise. Kerby Joseph was the first questionable pick for the Lions brass. He was ranked as B/R's 177th overall prospect, so taking him with a top-100 selection was a reach.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "If anything, general manager Brian Gutekunst has proved that he loves lighting mock drafts on fire. With most mocks featuring the Green Bay Packers taking a receiver, he opted for an off-ball linebacker after signing De'Vondre Campbell to a big extension this offseason. Devonte Wyatt's age (24 years old) is a concern. He'll be 29 by the time he's negotiating a second contract. However, he has one of the best first steps in the class. The Packers have made it clear they aren't fans of taking a receiver in the first round. They haven't done it since 2002, but trading two second-round picks for one to move up and take Christian Watson seems like a price that was too steep. Watson's size and speed combination is tantalizing (4.36 40 at 6'4\" and 208 pounds). However, he needs to develop as a route-runner and has questionable hands. He had 16 drops in his career at North Dakota State, per PFF. Zach Tom and Kingsley Enagbare are the kind of high-potential Day 3 picks who could wind up saving this class, but relying on Day 3 picks to hit is not a great situation.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It's hard to love the Stingley pick at No. 3 when the team is banking on getting the 2019 version and Ahmad \"Sauce\" Gardner has three years of lockdown play on film. That said, the version of Stingley we saw when he was a freshman has All-Pro potential. Kenyon Green was a bit of a reach at No. 15 even if the Houston Texans did trade back before taking him. He was No. 42 on the B/R big board, and with a relative athletic score of 5.98, he isn't elite in that area. Jalen Pitre, Christian Harris and Dameon Pierce were all great value picks in the middle of the draft. Given the Texans roster, they should be immediate contributors. The John Metchie III pick is the lone confusing one in that range. He's still recovering from a torn ACL and was 94th on the B/R big board but went 50 spots higher. At least it was a reach on a position of need.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Indianapolis Colts came into this draft with a need to improve the weaponry for Matt Ryan and hopefully land a starting tackle prospect. That was a tall ask given their draft capital, but general manager Chris Ballard ended up navigating it well. Alec Pierce gives Ryan another big-bodied receiver to work with opposite of Michael Pittman Jr., while Jelani Woods' size and athleticism make him the most intriguing tight end prospect in the whole class. The true steal in this class is Bernhard Raimann, though. He was the fourth tackle and 28th overall prospect at a premium position, and the Colts stopped his slide with the 77th pick. The Colts easily had the most athletic draft class by Pro Football Network's Kent Lee Platte's relative athletic score. If this class is as successful as it could be, that's going to be a metric that continues to get increased attention.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Jacksonville Jaguars general manager Trent Baalke really swung for the fences making Travon Walker the No. 1 pick. Walker's freakish size and speed combination are tantalizing, but there's a lot of projection to justify making him the top pick when there were more proven options available. The biggest story after Walker is Baalke's apparent affinity for off-ball linebackers. They spent a Day 1 and Day 2 pick on Devin Lloyd and Chad Muma. The move gives them flexibility in the middle of their defense, but it is a little odd given the contract they just handed Foyesade Oluokun. Ultimately, Jacksonville got better through this draft, but that's a pretty low bar. There are legitimate questions about whether the team got the best value out of the draft picks it had.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The rich really got richer with this draft haul. Everyone in the AFC West now has the makings of an elite passing attack. So it makes sense the Kansas City Chiefs got aggressive in adding a corner who can fit their scheme. Trent McDuffie does not have prototypical size, but he played more press than anyone not named Sauce Gardner, per PFF. The pattern of taking high-effort players with atypical length continued with the George Karlaftis selection at No. 30. He was ranked as the eighth overall prospect on the B/R big board, so getting him at 30 is a potential steal that fills a need. The Chiefs kept finding the values in Day 2. Skyy Moore is set up to have early success. Patrick Mahomes is going to love his feel for getting open and route running. Leo Chenal is an uber-athletic linebacker with the potential to be an elite run defender and devastating blitzer. Kansas City is trusting Mahomes to elevate the offense. The team did a great job of investing in a defense that can hold up its end of the bargain.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This is one of those draft classes where it's important to keep in mind that we are grading how well teams did with what they had. The Las Vegas Raiders didn't pick until the third round and still managed to get good prospects who should compete to fill holes they have on the roster. Dylan Parham was No. 76 on the B/R big board and the No. 8 interior lineman. They got him with the 90th pick. He has the athleticism and ability to challenge for the starting right guard spot from Day 1, which would allow the team to move Alex Leatherwood back to tackle. The Zamir White pick makes a lot of sense after the team declined Josh Jacobs' fifth-year option. He'll give them a young complementary back. The under-the-radar picks that could be significant are Matthew Butler and Neil Farrell Jr. Both project to be assets against the run. The idea of doubling up in hopes that at least one of them becomes an early contributor is laudable.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "One of the biggest organizational priorities for the Los Angeles Chargers has to be protecting Justin Herbert at all costs. They took a strong step toward that goal with Zion Johnson in the first round. His rise from a 0-star prospect at Davidson to a first-round draft pick out of Boston College embodies the kind of work ethic you want to add in the first round. After Johnson, it's hard to get too excited about any one of their picks. JT Woods could end up being a serviceable starter, but there were higher-upside options available. Jamaree Salyer is the most intriguing of the Day 3 picks. The 6'3\", 321-pound lineman played all over the line at Georgia. That versatility could make him a career-long utility player at worst, with the potential to become a starting guard down the line.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Even taking into account the Los Angeles Rams' limited supply of picks, this just isn't an inspiring draft class. Logan Bruss is best described as solid. B/R NFL Scout Brandon Thorn described him as \"best at guard in the NFL with the base, body control, strength and technique to become a quality backup inside.\" The most exciting pick might be Kyren Williams. The running back didn't stand out with his athletic testing at the combine, but he was a reliable pass-catching back at Notre Dame. He had 78 career receptions and drew a comparison to James White in his B/R scouting report. The Rams have proved they don't have to have great drafts to be Super Bowl contenders. That's a good thing given this year's group.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Miami Dolphins are seemingly trying to emulate the Los Angeles Rams' approach to the draft by trading many of their picks for established veterans. The Dolphins pulled off a blockbuster trade this offseason, sending the No. 29 pick along with 2022 second- and fourth-rounders and 2023 fourth- and sixth-rounders to the Kansas City Chiefs for star wideout Tyreek Hill. That left Miami with only four picks to use this year. Channing Tindall is the highlight of the class. His sideline-to-sideline speed should help him get on the field as a rookie. Part of that will be in sub-packages, but he should also be a factor on special teams. The Dolphins took wideout Erik Ezukanma in the fourth round, but he didn't even make the top 200 on B/R's final big board. Luckily, they won't need him to make an immediate impact with all of the changes they've made to their receiver room this offseason.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "New Minnesota Vikings general manager Kwesi Adofo-Mensah showed he's more than willing to wheel and deal during his first draft. He traded the Nos. 12 and 46 picks to the Detroit Lions in exchange for the Nos. 32, 34 and 66 picks. In other words, the Vikings essentially moved down 20 spots in the first round to go up 12 spots in the second round and get an extra third-rounder. It's hard to love that trade given how many high-value prospects they missed out on between Nos. 12 to 32. Still, Lewis Cine's athleticism and ability to play as a deep safety should pair well alongside Harrison Smith. However, Adofo-Mensah flipped the script on Day 2 by trading the 34th pick for the 53rd and 59th picks. He then traded up to get Clemson cornerback Andrew Booth Jr., who could become a valuable starter. Cine and Booth have the ability to drastically improve the Vikings secondary, while Ed Ingram could become a valuable cog in the offensive line.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The New England Patriots clearly don't care about any big board but their own. Cole Strange was 98th on the final B/R big board, which made him the biggest reach of the first round. However, Strange does fill a need, and the Pats have previously hit on taking small-school prospects earlier than expected (namely Kyle Dugger). It's also worth noting that his 9.95 relative athletic score compares favorably with Joe Thuney, per Pro Football Network's Kent Lee Platte. The surprising picks didn't stop there. In the second round, the Patriots took Tyquan Thornton at No. 50. He brings blazing speed to the table—he led all wideouts with a 4.28-second 40-yard dash at the combine—but not much else. He was the No. 130 prospect on the final B/R big board. The Pats had an unorthodox draft, as five of their 10 picks came from outside of the Power Five conferences. That isn't necessarily a bad thing, but it is an interesting trend to monitor as this class develops over time.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The New Orleans Saints set out to get two immediate contributors in the first round, and that's exactly what they did. Trevor Penning is reminiscent of Terron Armstead as a prospect. He's an uber-athletic tackle coming from a small school. He'll now replace Armstead, who started 93 games for the Saints over the past nine seasons before signing with the Dolphins this offseason. Meanwhile, the B/R Scouting Department considered Chris Olave to be the best route-runner and most pro-ready wideout in this year's class. His ability to find soft spots in coverage should make him a reliable target for quarterback Jameis Winston right away. Taking Alontae Taylor in the third round was far from a slam dunk, but cornerback is an increasingly valuable position. We can't fault the Saints for stocking up there even though the B/R Scouting Department gave Taylor a fourth-round grade. The key to this draft was nailing the first two picks, and the Saints seem to have done that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "In terms of adding top-end talent, it's hard to beat what the New York Giants did on Day 1. Kayvon Thibodeaux and Evan Neal were Nos. 1 and 2 on the final B/R big board, respectively. New Giants general manager Joe Schoen managed to get both with his pair of top-seven picks. However, it got harder to love what the Giants did on Day 2. Kentucky wideout Wan'Dale Robinson is a unique prospect with a small frame, and he's a slippery runner after the catch. But he's a discount Kadarius Toney for a team that already has Toney on the roster. Joshua Ezeudu made sense in the third round as a versatile lineman who should compete to play guard sooner rather than later. Depth is vital on the offensive line to survive the rigors of the 17-game season. Darrian Beavers is an intriguing Day 3 pick. He was No. 58 on B/R's big board and was one of the most agile linebackers at the combine. Defensive coordinator Wink Martindale will figure out how to make him an asset.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The New York Jets needed a transformational draft class, and that's exactly what this has the potential to be. Ahmad \"Sauce\" Gardner has rare length for a cornerback and was dominant while being asked to play plenty of press coverage in college. He never allowed a touchdown reception during his time at Cincinnati, according to Pro Football Focus. Garrett Wilson was the fifth receiver on the final B/R big board, but he was 19th overall, so it wasn't an egregious reach. Trading back into the first round to select Jermaine Johnson II gives the Jets three immediate starters at impact positions. The Jets then turned their attention to helping second-year quarterback Zach Wilson on Day 2. Breece Hall has the makings of a superstar tailback, while Jeremy Ruckert was the top tight end in B/R's rankings. The Jets had to nail this draft, and general manager Joe Douglas did just that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "If you had to sum up the Philadelphia Eagles' draft strategy in one word, it would be aggressive. The Eagles traded the Nos. 15, 124, 162 and 166 picks to the Texans to jump ahead of the Ravens to No. 13, where they took Georgia defensive lineman Jordan Davis. He was one of the standouts of the combine and had the highest relative athletic score of any defensive tackle since 1987, according to Kent Lee Platte of Pro Football Network. However, he played only 38 percent of the snaps at Georgia, which raises questions about whether he can be a three-down player. While trades before the draft aren't being considered in these grades, the Eagles' trade for Tennessee Titans wide receiver A.J. Brown does factor in. After whiffing on some early-round wideouts in recent years, they traded the Nos. 18 and 101 picks to land an established star. With quarterback Jalen Hurts still on his rookie contract, the Eagles' cap situation enabled them to hand Brown a four-year, $100 million extension. They're now in a great position to find out whether Hurts can be their long-term answer under center. Meanwhile, defensive coordinator Jonathan Gannon must be thrilled that they landed linebacker Nakobe Dean with their third-round pick. According to Albert Breer of The MMQB, Dean's size, injury history and a current pectoral injury all caused him to slide further than expected. If he's able to stay healthy, he could wind up being the biggest steal of the draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Kenny Pickett going to the Pittsburgh Steelers is a great storyline from a narrative standpoint. They got their pick of quarterbacks at No. 20 and took advantage of the opportunity to take a local product in Pickett. Outside of that, though, it's hard to get too excited about him. Pickett put together a great final season at Pitt, but the coaching staff there may have already squeezed out all of his potential. He'll be 24 by the time his rookie season starts, and he brings limited upside. Even if Pickett doesn't bring sky-high potential, there's still a lot to like about Pittsburgh's draft class. The Steelers are no stranger to getting good value in the middle rounds, and they might have done it again. Georgia wide receiver George Pickens didn't get play much in his final season after recovering from a torn ACL, but he has two seasons' worth of film in the SEC that says he's a pro-caliber wide receiver. Meanwhile, Texas A&M edge-rusher DeMarvin Leal was once a first-round-caliber prospect. Now he goes to a franchise known for developing defensive linemen with a chip on his shoulder.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The San Francisco 49ers could have bolstered their secondary earlier in the draft, but it's hard to fault them for taking pass-rusher Drake Jackson instead. He might have been selected much higher if not for a late-season injury that ultimately might have no effect on his NFL career. After watching what sixth-round running back Elijah Mitchell did in this offense last year as a rookie, it's hard to feel good about the Niners spending a third-rounder on Ty Davis-Price. Danny Gray was a better use of resources. The speedy receiver provides more depth and could be elevated into a larger role than expected if the Niners do trade Deebo Samuel. San Francisco also got a potential steal on Day 3 with Spencer Burford. The 6'4\", 304-pound blocker could eventually play tackle, but his movement skills could also make him a great guard in this system.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Seattle Seahawks didn't find their successor to longtime quarterback Russell Wilson in the first round. However, they did try to make life much easier for whomever that winds up being. Charles Cross might be the best pure pass-protector in this year's draft class. He gave up only two sacks and 14 hurries in Mike Leach's pass-happy offense last season, per PFF. It's always a good idea to build a team through the trenches. That was a theme for the Seahawks in general. Following up the Cross pick with lightning-fast edge-rusher Boye Mafe and another offensive tackle in Abraham Lucas could pay off big down the line. Kenneth Walker III is fine in a vacuum. He's a great prospect and is capable of being an every-down back. But with Rashaad Penny going off for 671 rushing yards in the final five games of last season season, taking Walker in the second round wasn't the best use of resources for Seattle. Then again, with Drew Lock the current presumed starting quarterback, anything the Seahawks can do to build the run game is a plus.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Tampa Bay Buccaneers got off to a strong start by trading back and still getting a player that makes sense for them. Logan Hall is a jumbo edge prospect who will likely start his career inside but could develop into an outside pass-rusher. Joining the veteran Bucs defensive front will allow him to evolve with their future needs. The Bucs got some other high-value targets later in the draft. The B/R Scouting Department pegged Luke Goedeke as the biggest sleeper among the interior offensive linemen in this class, and they named fourth-round pick Cade Otton as the best blocker among the tight ends. Unless Hall reaches his ceiling, there might not be any All-Pro players in Tampa Bay's draft class. That's OK. This draft was about finding role players who can help extend the Bucs' current Super Bowl window.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It's never easy to trade away a talented player. However, it's also easy to understand the Tennessee Titans' hesitance to hand A.J. Brown a megadeal given the ballooning market for wide receivers and his injury history. The Titans traded Brown to the Eagles on Thursday night for the Nos. 18 and 101 overall picks. They spent the former on his potential replacement, Arkansas wideout Treylon Burks. They just have to hope that trade works out like the deal that the Vikings made for Justin Jefferson and not like the one San Francisco made for Javon Kinlaw. The Titans' draft class ultimately hinges on third-round pick Malik Willis. He got a second-round grade from the B/R Scouting Department, but some team figured to reach on him a round too early based on his enormous potential. Instead, the Titans got him at a great value, and they'll be a good situation for him. He'll get to sit behind Ryan Tannehill while learning a pro offense and improving upon his ability to win inside the pocket.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "There isn't a lot to get excited about with the Washington Commanders' draft class. There isn't a lot to get angry about, either. Jahan Dotson makes sense from a need standpoint. The Commanders need pass-catchers alongside Terry McLaurin to give new quarterback Carson Wentz a chance at success, and Dotson should find a role as a No. 2 receiver. There's just little chance that he winds up as the best wideout in the class. Phidarian Mathis is a similar prospect as an interior defensive lineman. He will provide critical depth and likely become a starter down the road with Daron Payne entering the final year of his contract. The biggest qualm with Washington's draft is not using either the second- or third-round pick on a cornerback. The Commanders don't have much depth at that position, but depth is invaluable there. Instead, they opted for a power runner in Brian Robinson Jr., whose role they could have filled through the constantly revolving door of free-agent running backs.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They opted to trade their first-round pick for Brown, which I didn't like. Taking edge rusher Cam Thomas and Sandra both in the second addresses a major need. Keep an eye on sixth-round guard Lecitus Smith. He has talent.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They took Drake London with their first pick, which will pay off, and wisely waited to take a quarterback in Ridder. He will be a good one and eventually be their guy.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Even though I didn't love their first pick of safety Kyle Hamilton, they killed the rest of the draft. Their first four picks all were mentioned as possible first-round picks. They added a bunch of talented players on day three, including tight end Charlie Kolar. Eric DeCosta nailed this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "This team doesn't have a lot of holes, but they filled a big one with Elam. Cook was a bit of a surprise, but I did like fifth-round receiver Khalil Shakir. This is the team to beat in the AFC.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Ekwonu makes this draft, but the rest of it was so-so in large part because they didn't have a lot of picks. Corral is a risky pick. Sixth-round offensive lineman Cade Mays is a good player who will play in the league for a while.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They didn't have a first-round pick after trading it to get quarterback Justin Fields last year. They picked defensive backs with their first two picks, which they need, but why not an offensive lineman at some point before round five when they took Braxton Jones? I do like Gordon, but they better hope Jones can play.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "This team has really improved in the offseason and can again push for the Super Bowl. They needed help in the secondary, and they landed it with three picks there. Third-round defensive tackle Zach Carter is a player to watch.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't pick until the third round because of they traded their first to land Deshaun Watson, so it wasn't a great haul. Landing Winfrey was a nice pick and second-round corner Martin Emerson is a long player with coverage skills.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I like what the Cowboys did. I was higher on first-round pick Tyler Smith, the offensive lineman from Tulsa, than most. He will be a good player, likely at guard to start. I also liked Williams and third-round receiver Jalen Tolbert.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They traded away their first to get quarterback Russell Wilson, which makes this draft. He changes the dynamic of this team. Second-round edge Nik Bonitto is an explosive player who will liven up the defense.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They had an outstanding draft. Landing Aidan Hutchinson with the second pick gives them big-time edge player, and I love Williams. Second-round edge Josh Paschal gives them another player to pair with Hutchinson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They hit big with their first two picks in Walker and defensive tackle Devonte Wyatt. Most wanted at least one receiver there, but they held true to their board. They traded up to get Watson, but I think there were better options. I love fourth-round tackle Zach Tom.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I liked a lot of what they did. First-round corner Derek Stingley Jr. will be a shut-down player, while offensive lineman Kenyon Green is a nasty mauler who will help up front. I love Pitre and fourth-round running back Dameon Pierce.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Colts landed good players in Pierce and tight end Jelani Woods, but is third-round pick Bernhard Raimann ready to start at left tackle? He better be. Losing the first-round pick was a bad move.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Taking edge player Travon Walker with the first overall pick is a risk, but he's a good player. Can he be a great one? Landing center Luke Fortner in round three was a good move, but why take Muma when you didn't need him, unless Lloyd will be more of an edge on passing downs.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "First-round corner Trent McDuffie will be an immediate starter and Karlaftis will push for a job right away. Second-round receiver Skyy Moore and second-round safety Bryan Cook were good picks.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They didn't pick until the third round because of trades, one of them to land receiver Davante Adams. He's worth it. The draft brought some quality players I liked, such as Farrell Jr. and sixth-round guard Thayer Munford.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Getting Johnson to help up front was big. He will be a longtime starter. The rest of the draft was just OK for me. I do like sixth-round offensive lineman Jamaree Salyer.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Rams didn't pick until the third round because they traded away their picks to land veteran players, including quarterback Matt Stafford. With that philosophy, they have to hit on the later picks. So far they have. This draft includes some interesting players who can follow suit.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't pick until the third round because of trades, including to get Tyreek Hill. He was worth getting, so that helps this grade. And I love Tindall.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "New general manager Kwesi Adofo-Mensah moved up and down the board, but in the end was it really good maneuvering? They took Lewis Cine in the first round, a player I like, but I didn't love the rest of their draft, other than Asamoah.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Belichick walks to his own beat when it comes to drafting. Sometimes he wins — like when he got Tom Brady — but there have also been a fair share of losses. Strange seemed like a reach, but I love Thornton and third-round corner Marcus Jones. I didn't understand taking Bailey Zappe in the fourth.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They moved up in the first round to land receiver Chris Olave, a good player with speed that was needed. Penning will be a good player, and keep an eye on fifth-round linebacker D'Marco Jackson. He can run.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Landing Kayvon Thibodeaux, the best pure edge rusher in this class, and then Neal makes this a good class. But they also added a good receiver in Wan'Dale Robinson and a bunch of other players who will compete for spots.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Joe Douglas had two picks in the top 7 and nailed them, getting corner Sauce Gardner and receiver Garrett Wilson. Then adding Johnson and Breece Hall, the best back in this class, makes it a heck of a group.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "General manager Howie Roseman had a good weekend. He traded to get receiver receiver A.J. Brown and then took Davis in the first. Second-round center Cam Jurgens will take over as the starter when Jason Kelce retires. Counting Brown, it's a good haul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting Pickett will make this draft. There was talk they considered trading up, yet they still landed him. I like fourth-round receiver Calvin Austin, and we know the Steelers have had success with receivers getting taken in this area.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't have a first-round pick after trading to get Trey Lance last year. But they landed some solid players the rest of the way. Second-round edge rusher Drake Jackson had some talking first round before the draft. Lance better be good.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They picked two offensive tackles, including first-round pick Charles Cross, which they had to do. But taking a running back early is weird as they need to transition from a run-heavy offense. Second-round pass rusher Boye Mafe has talent, but he is raw.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They traded out of the first round to get extra picks, but still landed a solid group. Goedeke will compete at left guard and fellow second-round pick Logan Hall could be a starter at defensive tackle. Fourth-round tight end Cade Otton was a good pick.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They ended up picking a lot of good players, which Jon Robinson usually does. The positions are a little strange in that they took a bunch of corners in recent years and added some more.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The move to trade down and still land receiver Jahan Dotson was smart drafting. They needed a receiver who can help Wentz. Dotson will liven up the passing game. They added some other nice players, but Howell is the icing. Keep an eye on fifth-round tight end Cole Turner. It was a good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Jacksonville Jaguars went for potential over a sure thing. Time will tell if the risk was worth it, but this isn't a tea, that has time to gamble. Walker had six sacks in Georgia's national championship season. He also had 7.5 tackles for a loss.  Have to wonder if they could have traded back and still got Walker while adding more picks. And now, NFL Network reports Walker was in a car accident a couple of weeks ago, hitting parked cars. Sigh.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Travon Walker",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Lions wound up with the player many thought was going to go No. 1 for a long time leading up to the draft. Detroit wins by grabbing the 6-foot-6, 265-pound defensive force from Michigan. Hutchinson had 14 sacks and 16.5 tackles for loss in 2021. The Lions should send something to the Jags for dropping this gift in their lap.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Aidan Hutchinson",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Houston Texans pulled a surprise and grabbed LSU's Derek Stingley Jr. at No. 3. The chatter has been nonstop about 2019 being his best year. This is 2022, though, and what about his play in 2020 and 2021? Will he be the player he was in 2019 or did the Texans reach? \"Supreme athletic when he's healthy\" is a worrisome comment.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Derek Stingley Jr.",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Jets get a DB who doesn't allow touchdowns. That's a trait not many — if any — players in the Jets' secondary have possessed since Darrelle Revis in his prime. Jamal Adams wasn't around Gang Green long enough to earn that stamp. Three picks per year, including two pick-sixes in 2019.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Sauce Gardner",
        "grade": "A",
        "gradeNumeric": 4,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The explosive Oregon Duck comes to the New York Giants. That makes five defensive players in a row at the top of the draft. Big Blue had to be thrilled with all the critical comments about Thibodeaux's motor and mentality leading into the draft. A huge score at five.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kayvon Thibodeaux",
        "grade": "A",
        "gradeNumeric": 4,
        "text": null
      }
    ]
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Another player selected in-state, as the Lions did with Hutchinson. The Panthers take Ekwonu from N.C. State. He is strong on the run game but must improve in the passing game. Still, it feels like a win not rushing into a QB here because neither one is top-six quality. This does not preclude a move for a Baker Mayfield, Jimmy Garoppolo or another QB, either. As of this writing, the Panthers don't pick again until Round 4.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Ikem Ekwonu",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Giants didn't pick up Daniel Jones' fifth-year option but they did use their second first-round pick to grab Evan Neal from the Crimson Tide. He's 6-7 1/2 and comes from an incredible college program. Look for Neal at right tackle and Georgia's Andrew Thomas at left to give Jones his last best chance to succeed if the Giants stick with their former No. 1 pick at QB.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Evan Neal",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Drake London can thank Calvin Ridley's suspension for landing in Atlanta. A  team that once had Julio Jones and Ridley was in need of a wide receiver to go with Marcus Mariota. EDGE felt like a bigger need but London had 88 catches for 1,084 yards and 7 touchdowns in 2021 on a troubled team. The first USC WR to go in the first round since … Nelson Agholor. London did not play in more than 8 games in any of his seasons at USC.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Drake London",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The third tackle to go in the top nine is Charles Cross of Mississippi State. He's 6-5 and 290 and played in a pass-happy offense for the Bulldogs. Without Russell Wilson, expect the Seahawks to run the ball more. This would seem to be contrary to everything Cross did in college with Mike Leach and the Air Raid offense. The Seahawks need a lot. This doesn't feel like the player they needed.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Charles Cross",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The New York Jets add a wide receiver—and they weren't able to pry Deebo Samuel from San Francisco with this pick in a trade. They have Corey Davis and Elijah Moore at WR. They land the 6-0, 188-pound Wilson who was electric in 2021 with 70 catches and 12 touchdowns. Zach Wilson has no excuses for failing to improve in his second year with Gang Green.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Garrett Wilson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Ohio State wideouts go back-to-back after the Buckeyes had not had a first-round WR since 2007 (Ted Ginn, Jr, Dolphins, 9; Anthony Gonzalez, Colts, 32). Dennis Allen is a defensive guru but he knows New Orleans needs someone to go with Michael Thomas at WR. He gets Thomas, who missed all of 2021 with an ankle, another Buckeye, Olave, who had 65 catches.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Chris Olave",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Detroit moves up from 32 and takes a WR who left Ohio State for Alabama. Will Jared Goff throw the ball to the speedster? And what was the former Rams QB thinking when the Lions traded with their NFC North cohorts? A quarterback? Nah, a speedy wideout who had 79 catches for 1,572 yards and 15 touchdowns. Williams is recovering from a knee injury. The Lions hope it is a swift one.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jameson Williams",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Philadelphia Eagles looked to Georgia as another 'Dawg gets picked in the first round. They went big and they got a physical specimen at 6-6, 340 pounds. Philly wanted him bad and moved up while peeling away a few picks to Houston.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jordan Davis",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens don't mess around. They take the best available player and Kyle Hamilton was just that. Are you going to believe a 40-time dropped him to 14 or did they steal another jewel? Hamilton goes to a team that celebrates defensive and secondary players. Don't be surprised when this turns out to be one of the best selections of the entire 2022 NFL draft.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kyle Hamilton",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Texans dropped back, got more picks, and grabbed a 323-pound force from Texas A&M. He will stay in the state he played college ball and fill a big space and void for a team that has so many of them.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kenyon Green",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Commanders get another wideout to complement Terry McLaurin. Would they have been better off picking higher and grabbing an Ohio State pass-catcher? He had 91 of his 183 catches in 2021. Dotson had 12 of his 25 touchdown receptions last season. A one-year wonder of the real deal.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jahan Dotson",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Talk about moving up in the world, Zion Johnson goes from Davidson — you know, the basketball school that produced Steph Curry — to Boston College to be the 17th pick in the first round. His assignment will be protecting Justin Herbert. The Bolts have to hope everyone whiffed on him coming out of high school and he belonged in the ACC more than a small North Carolina school.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Zion Johnson",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "It seems like the fastest way to be moved is to be a wide receiver demanding a big contract. The Titans send A.J. Brown to Philadelphia and get this pick from the Eagles, who gave the wideout a four-year, $100M contract with $57M guaranteed. The Titans then replace the big, physical receiver from an SEC school in Brown to grab Burks, a 6-foot-3, 225-pounder who had 66 catches, including 11 touchdowns as an Arkansas Razorback. The overall move from Brown to Burks is a loss, at least for now.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Treylon Burks",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Saints pick up a \"big nasty\" who will step into left tackle—where Terron Armstead exited for Miami—t0 protect Jameis Winston. Once again, they go offense because Dennis Allen understands what needs are and didn't simply covet more defensive players because that is his forte. Have to like the mindset of the coach who steps in for Sean Payton.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Trevor Penning",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Steelers used to shy from Pitt quarterbacks (see Marino, Dan). But in 2022, they decided they think a Panther is their future, Kenny Pickett. He threw 42 touchdown passes against 7 picks and for 4,319 yards in his fifth season. However, that is more of an oddity than what went on in his first four seasons, going for 39 TDs and 25 picks. The Steelers have to hope Pickett wasn't a one-year college wonder with Pitt.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kenny Pickett",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "So the Chiefs trade up and grab a DB with the initials TM. Will Trent McDuffie of Washington be better than what Tyrann Mathieu would have been, or could the Chiefs have used both in their defensive backfield? The latter seems a better response than the former.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Trent McDuffie",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Wonder if Aaron Rodgers approved of picking a linebacker over a wide receiver? Walker played at Georgia on that brilliant defense and brings all sorts of strength and athleticism to Green Bay. The Packers will eventually get another wide receiver or two or three but reaching here would not have made sense to anyone.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Quay Walker",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bills will eventually have added a strong player to a position that is a strength when Tra'Davious White returns from injury. Kaiir Elam comes out of the SEC as did White (LSU) and figures to add to a secondary and defense that simply is tough to solve.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kaiir Elam",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Cowboys need to start figuring out their offensive line and they took a step here. Smith had a medical condition years ago but overcame it and was found to be fine by NFL doctors. So, Dallas goes for the Tulsa tackle and has to hope he can step in and fill in the gap left by La'el Collins' exit— and age that is creeping up on the Cowboys' overall O-line.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Tyler Smith",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens get the best center in the draft and a guy who has strength, speed, and is ferocious. A guy who can do so many things at his size and is going to be an asset to Baltimore, whether for running backs or Lamar Jackson. Nice job by John Harbaugh & Co.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Tyler Linderbaum",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Jets move into the first round for a third pick and get Jermaine Johnson II from Florida State. NFL Network was chatting him up as a Top 10 pick and Gang Green slides in at 26 and grabs him. He had 11.5 sacks in 2021 for the Seminoles. What caused him to drop? Will this prove to be a steal or a problem? The Jets have to hope he is a gem who other teams simply missed.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jermaine Johnson II",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The  Jaguars traded into the first round with in-state Sunshine Staters Tampa Bay and took Utah LB Devin Lloyd. The cost was the first pick in the second round on Friday and a couple of lower picks. Doug Pederson & Co. must love Lloyd, who can come off the edge and knows how to blitz. Put him together with Walker and the Jags are building something on defense, young and hungry.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Devin Lloyd",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Packers had two first-round picks and neither will be catching passes from Aaron Rodgers. One has to think Green Bay has some kind of plan, doesn't it? This pick is another piece of the outstanding Georgia defense. Oh, and it just so happens that both players picked by the Packers played for the national champions in 2021.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Devonte Wyatt",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Patriots traded back and took Cole Strange of UT-Chattanooga, now the highest-drafted Moccasin, surpassing T.O. Are you seriously going to argue with what Bill Belichick does and what strategy he employs?",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Cole Strange",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Chiefs stayed on the defensive side of the ball and went for the defensive lineman from Purdue, George Karlaftis. The power rusher from the edge will help Kansas City get stronger in the middle by keeping Chris Jones inside as much as possible. A former water polo star, Karlaftis should get plenty of opportunities to succeed swimmingly in Kansas City.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "George Karlaftis",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Bengals went for a defensive player from the Big Ten after the Chiefs took one. Hill has improved during his time at Michigan and needs to continue to grow in the pros. He goes from a school in Michigan to playing for a team in Ohio. Pretty sure the transition will be smooth.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Dax Hill",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The big winner in the first round was the big loser, too. Kirby Smart has to be so proud of the way his defensive players were scooped Thursday. One Dawg defender after another heard their name called the final one was DB Lewis Cine. Another stellar spoke in the wheel of a historic defense. The Vikings make it so Georgia defenders were bookends in the first round of the 2022 NFL draft. Wow.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Lewis Cine",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Arizona traded for Marquise Brown, a college teammate of Cardinals QB Kyler Murray, on Thursday night. If Brown becomes a consistent playmaker, the swap will be a savvy move. McBride will contribute as a strong receiver and blocker while Thomas and Sanders were also good Day 2 picks to bolster the front seven. The Cardinals parted with their fourth-round pick in a 2021 trade to select cornerback Marco Wilson and sent their fifth-rounder to Philadelphia for tight end Zach Ertz. Those moves will pay dividends, as will picking Ingram to work his way through traffic as a complement to James Conner. Smith and Hayes will compete for playing time at guard as rookies. Luketa will do the same at edge rusher. He isn't the biggest or fastest player but adds needed depth and will contribute on special teams.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The combination of London and Kyle Pitts should give a needed boost to the Falcons' passing game. General manager Terry Fontenot addressed the team's other major need on Day 2, strengthening a poor pass rush with Ebiketie and Malone, while also landing an athletic second-level defender in Andersen and smartly nabbing a potential future starter in Ridder. Allgeier's a solid pick but they could have met other needs with their first Day 3 selection. Shaffer lumbers a bit but can move the line of scrimmage. FitzPatrick wasn't used enough at Georgia but has the potential to be a fine pass-catcher. Their defensive tackle group could use a strong undrafted free agent addition.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Ravens once again showed the ability to find great value. They landed the rangy Hamilton, a bendy edge rusher with great potential (once returning from injury) in Ojabo, and an intriguing, athletic big man in Jones. Trading Marquise Brown to the Cardinals not only made room for 2021 first-rounder Rashod Bateman to flourish but led to another trade, netting a probable long-time starter in Linderbaum. With their six fourth-round picks (most in a single draft since 1970), the Ravens found a new massive right tackle in Faalele (similar to Orlando Brown), two corners to rebuild their depth, two tight ends (Kolar is a Mark Andrews clone), and Stout, a bit of a surprise pick given Sam Koch is still on the roster. Given the injuries Baltimore suffered at running back last year, getting the nimble and speedy Badie in the sixth round made sense.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Bills got the cornerback they needed in Round 1 by trading up to select Elam, whose feisty attitude and quickness on the outside should translate at the next level. Cook was exactly the sort of speedy receiving threat the team needed at the running back position, and Bernard helped fill a hole on the defense's second level, as he was a tough, productive college player when healthy. Shakir is a reliable receiver who was a really good fifth-round pick. I projected the Bills to take a punter in my seven-round mock; Araiza's strong leg could very well unseat veteran Matt Haack. Spector didn't get a lot of publicity at Clemson but will offer depth and make his name on special teams.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Carolina played the quarterback market well, landing the talented Corral in the third round (paying the reasonable price of a 2023 third-round pick to move up for him) while greatly improving the offensive line with Ekwonu. They had previously traded second- and fourth-round picks in the deal for Sam Darnold, though. That investment has yet to pay off. Carolina made a slight move up the board to select Smith, which is fair considering his athleticism. Barno was a quality pick in the sixth round, as was the strong and experienced Mays. Barnes is a speed demon.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "While the Bears did not have a first-round pick because of their 2021 draft-day trade to select Justin Fields, they did address the primary needs in the secondary by grabbing two likely rookie starters in Gordon and Brisker. Jones gives the team depth at receiver and a punt return option, even if he might only end up signing one contract with the team because he will be a 25-year-old rookie. The offensive line was addressed on Day 3, with Thomas possessing the nasty streak and mobility to win the swing tackle spot as a rookie. Jones is a solid pass protector with nice length, and Carter is a potential sixth lineman. Ebner is an electric kick returner. Keeping the sturdy, experienced and athletic Kramer in Illinois will pay off when he starts early in his career. The departure of Pat O'Donnell led Chicago to pick Gill.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Cincinnati reacted to the team's disappointing pass defense in the Super Bowl loss by selecting two versatile athletes in Hill and Taylor-Britt to bolster the secondary. Carter has potential as an inside playmaker, but time will tell if he was the best option at that position of need. Volson is a tough player who shifted between guard and tackle for the Bison. Anderson's speed/tenacious nature and Gunter's power on the edge made them very good Day 3 selections.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The trade for Deshaun Watson sets the direction of the franchise for the foreseeable future, as the Browns gave up three first-round picks as part of the deal. Cleveland has its quarterback, but I believe the price was too high for Watson, who is currently facing 22 civil lawsuits alleging sexual assault and misconduct, as well as potential discipline under the NFL's personal conduct policy pending the outcome of an ongoing league investigation. On Day 2, Emerson, Wright and Bell all met needs and provided good value at premium positions. The Browns can count receiver Amari Cooper as part of their Day 3 haul, which was a good start. Getting the aggressive, quick Winfrey at the three-technique spot in the fourth round was a steal, as was selecting his teammate, Thomas, as a power end in the seventh round. York went a bit earlier than I expected, though he showed a nice leg on field goals and kickoffs at LSU. Ford, an Alabama transfer, is vastly underrated.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Smith could be a dominant run blocker if he's able to improve in his patience and technique as he matures – or he could become a first-round offensive lineman who does not reach his potential. Williams is a pass-rush talent, but there are off-field issues in his history. The Cowboys got good value in Tolbert, who could become a downfield threat. Trading Amari Cooper only netted a fifth-rounder from Cleveland, which is a cheap price relative to the cost for other talented receivers this offseason. The Cowboys did add needed tackle help in Waletzko, who could be a valued backup or better if he gets stronger on the edge. Ferguson separates better than his timed speed indicates, and he has strong hands and solid blocking skills. I love that the Cowboys took Clark in the fifth round even though he's unlikely to play in 2022. He could prove to be well worth the investment once healthy.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Russell Wilson was a big part of Denver's draft class, which is fine with the Broncos, as it should be. They used a pick acquired in the Von Miller trade to add an explosive pass rusher in Bonitto. The team found a potential replacement for pass-catching tight end Noah Fant (who was sent to Seattle in the Wilson deal) in former walk-on Dulcich. Mathis builds cornerback depth for the Broncos, as he can play in the slot or outside. Uwazurike and Henningsen are polar opposites as defensive linemen, with the former Cyclone a powerful player and Henningsen a high-motor pressure machine. Wattenberg could compete for the starting center job in 2022.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "It's possible the Lions got the best defender available this year at No. 2 in Hutchinson and the best receiver in the draft at No. 12 in Williams. Picking the talented pass-catcher was a bit of a risk, given the draft capital they parted with to trade up for him and the fact that he is coming off an ACL tear. His talent could make the trade look like a shrewd one, however. Paschal and Joseph were solid picks who could contribute right away. Rodriguez is an active, athletic 'backer to add depth and be a special teams ace. Their fifth-round compensatory selection turned into Mitchell, a pass-catcher I expect Detroit to utilize immediately. Houston's pass rush ability and strength against the run made him worthy of a selection.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Two Georgia defenders made their way to a Green Bay front seven in need of youth and athleticism, which made a lot of sense given the price other teams paid for receivers early in the first round. The Packers paid a mid-second round pick themselves to trade up for Watson, eschewing Skyy Moore and George Pickens to grab Watson as a potential downfield playmaker. Rhyan's versatility and toughness made him an easy third-round pick. Doubs and Toure give the team more options at receiver, which was a requirement coming out of this draft. Tom's intelligence and versatility are exactly what the Packers covet (they selected him using the comp pick gained from losing center Corey Linsley). Enagbare is a powerful edge rusher, an excellent find late in the fifth round. Walker's play lacked consistency at Penn State, but his potential to play left tackle was worth a pick in the late stages of the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Texans selected a few guys who could be great with their first three picks: a potential playmaking corner (Stingley), a powerful guard/tackle (Green) and a competitive, versatile defensive back (Pitre). Metchie and Harris also could become solid starters if they're able to consistently secure passes and find the ball on defense, respectively. Pierce will compete for every yard. Booker's a smart, active interior player. Quitoriano meets the team's need for a well-rounded tight end. The Texans should sign multiple undrafted free-agent edge rushers to bolster that group since they failed to select one.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The ill-fated trade for Carson Wentz cost them a first-round pick, but they were able to make up for it somewhat on Day 2 with a few solid picks at positions of need. They secured the athletic Woods, an up-and-coming left tackle in Raimann and playmaking safety in Cross. Johnson's quickness off the snap made him one of the best non-combine invitees in this draft, and Brooks is an undersized thorn in the side of offensive linemen. Grabbing another big-bodied tight end like Ogletree seemed strange after picking Woods. The Colts have work to do after the draft, with a need to accumulate interior offensive linemen, receivers and running backs to fill out the back end of the roster.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The selection of Walker with the No. 1 overall pick will ultimately be judged based on whether he has a better career than the other top edge rushers in this year's draft. Lloyd and Muma are good linebackers, though the team used draft capital to trade up for the former and then doubled down on the position with the latter on Day 2. Picking Fortner, a replacement for retired center Brandon Linder, was a solid move. The Jaguars could have found an RB value similar to Conner after the draft. Junior was one of my top non-combine invitees in the draft because of his fluidity and size. Brown competed on the outside against top SEC competition. Jacksonville sent a fifth- and a seventh-rounder to Tampa Bay and gained a fourth-round selection next year -- a good swap that could turn into a future contributor or material for a trade.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Chiefs found starters in the first round. They focused on McDuffie's cover skills and aggressiveness rather than his lack of size and length, and Karlaftis' superior hand usage and leverage rather than his lack of bend off the edge. Moore is a great fit in their offense and excellent value. Cook and Chenal are nice picks who will play roles as rookies. Williams has the size-speed combination to excel on the outside, as does Watson, who could have been picked two rounds earlier. Kansas City added another powerful tackle in Kinnard. Pacheco was a steal in the seventh round as a fast and hard-hitting runner.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Trading for Davante Adams was worth the premium picks. Parham's strong base, mobility and ability to play center or guard made him a solid third-round selection that strengthens a lacking interior offensive line. White is a speedy back with power who could have been picked in the third round. The Raiders took Brown in the seventh round to make sure they have plenty of options at that position. Farrell brings a strong anchor to the defensive line, while Butler is more apt to win with quickness inside.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Johnson fortifies a trouble spot on the offensive line with his mobility and toughness, making him an excellent selection. Getting Khalil Mack with their second-round pick was necessary to compete in the pass-happy AFC West, and third-rounder Woods could contribute at nickel or safety in the secondary right away. Spiller is a frenetic runner who is faster than his timed speed; his potential as a rusher/receiver threat was worth a fourth-round pick. The Chargers signed veterans on the defensive line this offseason, but Ogbonnia was too good of a value to ignore in the fifth. Salyer played guard and tackle for Georgia, adding more power and versatility on the line. Taylor steps into the slot for the Chargers right away, and Horvath could be the team's lead blocker and short-yardage back from the jump. The team should look for one of the top undrafted free-agent edge rushers.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Rams got a Super Bowl win thanks to the trades of first- and second-round picks for Matthew Stafford and Von Miller. It's hard to argue with the results of those deals. Picking Bruss in the third met a major need for the team in 2022 and beyond after losing Austin Corbett in free agency. Durant should be a fine replacement for Darious Williams in the slot and Kendrick's cover skills could overcome his off-field issues and lack of top-end speed. The Rams did bring back corner Troy Hill in an under-the-radar deal with the Browns for a future fifth-round pick. Williams is a do-it-all back who relies on savviness rather than pure speed. Lake and Yeast add safety depth and will perform well on special teams. Hardy could be the Rams' next Samson Ebukam or Chris Garrett as a small-school edge defender who excels in a designated pass rush role.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Miami did not have early picks because of trades for receivers Tyreek Hill and Jaylen Waddle, who are obviously very good players. But only time will tell whether the lost draft capital was too high a price to pay. The Dolphins were also without their original third-round selection after trading that pick last April to move up for offensive lineman Liam Eichenberg. However, they used a third-round compensatory pick acquired in the Trey Lance deal with the Niners to land a nice chase linebacker in Tindall. With a fourth-round pick gained from a 2021 draft day trade with Pittsburgh, the Dolphins snagged Ezukanma, a reliable receiver without elite speed or quickness. Goode could play inside or outside for the Dolphins, as an instinctive player who fell under the radar at Cal. The Dolphins did not draft a center, potentially leaving Michael Deiter to handle those duties, but did find a potential backup signal-caller in the \"toolsy\" Thompson.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Vikings did a nice job grabbing draft picks in trades with desperate division rivals Detroit and Green Bay. The secondary needed help and it got two immediate contributors in Cine and Booth, who would have been a first-rounder if not for injuries. Ingram's a likely future starter inside and Asamoah is the ball-hunter the Vikings needed in their new 3-4 scheme. Evans is an athletic, big-bodied corner worth the fourth-round pick, but patience would have been a better play than giving up a 2023 fourth-round pick. Chandler adds quickness to the Vikings' offensive backfield as does Jalen \"Speedy\" Nailor to the receiver room. Lowe was a very good selection because of his length and agility on the edge, and Muse is a fantastic late pick-up as a No. 2 option at tight end. Otomewo has the size to shift from a 4-3 end to the five-technique in the Vikings' new three-man front.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Predictably, New England traded down in the first round to gain picks; Strange is a solid player who will play for a decade but was not expected to be selected in the top 50, much less the first round. Thornton's speed was coveted, but trading a pick to get him in the top 50 was surprising, as well. I predicted New England would select Marcus Jones, a diminutive but competitive slot corner and returner, in the third round. Jack Jones is another small but feisty corner who could beat out veterans who underperformed last year. Strong is my favorite pick from this group. He runs hard and fast, and he's smart. Zappe's a director from the pocket with nice anticipation and a bit more zip in his arm than given credit for. Roberts was one of my favorite defensive line sleeper picks as he creates consistent pressure up front. The athletic Hines and sturdy Stueber could be good finds late in the draft like current starter Mike Onwenu was two years ago.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Saints traded away future capital before the draft started to secure another first-round pick this year, using a similar credit card philosophy they've followed in their salary cap management over the years. They moved up to secure the services of the speedy yet smooth Olave. Penning is a fair value to play left tackle in the absence of longtime starter Terron Armstead. They jumped the board a bit picking Taylor in the top 50, though he does have the size and athleticism to play at the next level. Both Jacksons are solid picks who add strength and quickness to the Saints' defense at linebacker and defensive line. The team did not pick any offensive skill position players other than Olave, however, which means they need to beat the free-agent bushes for depth after the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New general manager Joe Schoen took a firm grip on the Giants' top-seven picks to get a talented pass rusher in Thibodeaux and a massive right tackle (who could play guard or left tackle as well) in Neal. Schoen also traded down twice before grabbing a tough, undersized receiver in Robinson. He then found an underappreciated guard/tackle combo in Ezeudu and a lean slot corner in Flott. The Giants got adequate value at a position of need in Bellinger and found a Jabrill Peppers-type and Day 3 value pick in hybrid safety Belton. McFadden and Beavers fill a big need at inside linebacker, as does Davidson at nose tackle and McKethan as a backup tackle.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Jets fans were thrilled to see the team get an outstanding corner in Gardner, elusive receiver in Wilson and power rusher in Johnson all in the first round. General manager Joe Douglas moved up to get Johnson and Hall (the best back in the draft) without losing significant value. He chose Ruckert over other needs in the third, but the former Buckeye has the potential to be a nice blocker/receiver as a pro. Mitchell will be at least a valuable swing tackle on Sundays, if not a starter on the right side. The Jets added another power rusher in Clemons on Day 3, but their lack of picks in Rounds 5-7 means they'll have to add some top-notch undrafted free agents.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Eagles pulled off an excellent draft, making great trades with the Colts (last year's Carson Wentz deal) and Saints (acquiring future picks) before the event even started. They secured a beast on the defensive line in Davis to improve their run defense, acquired veteran A.J. Brown from the Titans to bolster the receiver group, secured a future starting center in Jurgens and put aside Dean's medical issues to bring in the top-50 talent in the third round. Adding another linebacker in Johnson was a bit of a surprise; it was at a good spot in the draft and he could be a good Sam. Calcaterra temporarily gave up football due to concussions while at Oklahoma but proved his pass-catching skills again at SMU; he'll be a valuable backup or better in the NFL.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Kevin Colbert had an excellent final draft as the Steelers' GM, getting value without trading away picks. He grabbed a future starting quarterback in the experienced, mobile Pickett, found a falling receiver in Pickens, who will be a playmaker, and took a shot on the potential upside of the long, athletic five-technique Leal in the third round. Austin's a nice complement to Pickens in the early fourth round, and I projected Pittsburgh selecting Pro Bowler Cam Heyward's brother, Connor, in the sixth round of my seven-round mock draft as a fullback/H-back. Oladokun has the mobility and arm to work his way into a roster spot this year or next, if he ends up on the practice squad for 2022. The team needed depth on defense, as well, but since no selections were made on that side of the ball, you can bet they will try to land some undrafted rookie free agents.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "It won't be clear whether trading a first-round pick for Trey Lance was the right move until we see him on the field. The Niners did a nice job picking up Jackson in the second round, but whether grabbing Davis-Price and Gray in the third round was good value is a question to be answered over the next couple of seasons. Burford and Zakelj added depth on the offensive line, both able to play inside or outside. I love Womack's competitiveness; he'll be a nice slot corner. The quick Davis and cover man Castro-Fields will contribute as rookies and outperform their draft status. The Niners eschewed other needs to pick Purdy as Mr. Irrelevant; the former Cyclone passer could be a longtime backup in the league with his tools and competitive nature.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The effects of the Russell Wilson trade will determine the direction of this franchise. Cross and Lucas should be a solid set of bookend tackles, in which the team was in dire need. A pass rusher like Mafe was definitely in play in the second round. Walker's talent was obvious this year, but his selection was a bit perplexing because of the backs already on the roster. Bryant's competitiveness will be appreciated by Seattle whether he plays inside or outside, and Woolen's size and athleticism also improves the secondary depth. Adding another edge in Smith on Day 2 was smart. Melton is a Day 3 version of Tyler Lockett, and Young is an intriguing outside receiver. We'll see if the Seahawks trade for Baker Mayfield or roll with Drew Lock since they didn't select a quarterback. They also didn't pick a linebacker to help make up for the loss of Bobby Wagner.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Buccaneers deftly traded out of the first round and still got Hall, who is similar to veteran William Gholston. General manager Jason Licht made two other good picks on Day 2, with Goedeke meeting the need for a lineman to replace the retired Ali Marpet and White a gliding running/receiving threat like free-agent departure Ronald Jones. Tampa Bay met its tight end need with the first pick in the fourth (Otton would have been a Day 2 selection if healthy this year) and again in the seventh (Kieft is a strong blocker). I thought Bradley Pinion might get some competition from this draft, though I expected Matt Araiza, not Camarda. McCollum was a great pick in the fifth, especially given the team's need for depth.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Tennessee chose to send away A.J. Brown instead of paying the veteran receiver and found a potential replacement in Burks. McCreary's a stick corner who lasted until the late second potentially due to a lack of length -- he's a talent capable of playing inside or outside. Petit-Frere is a solid swing tackle with the ability to be more. Willis' skill set gives him a real shot at being a playmaker down the line for Tennessee; he was an absolute steal. Haskins presents power and enough quickness to be the back needed to take the load off Derrick Henry. Okonwo is the team's new Jonnu Smith as an undersized, smooth two-way receiver and potential downfield threat. Philips will remind Titans fans of former slot receiver Adam Humphries. Tennessee should add more rookie edge rushers and offensive linemen after the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Commanders were able to recoup the third-rounder lost in the Carson Wentz deal (via a Day 1 draft trade with the Saints) while finding a quick and sure-handed receiver in Dotson to help Wentz succeed and complement Terry McLaurin. Mathis will be a solid rotational player, and Robinson has the speed-power combination to be a good NFL back. Addressing the safety spot was a must on Day 3 for Washington, and Butler was the best choice. Howell will prove to be an excellent pick in the fifth round whether or not he steps in for Wentz as a rookie. I love Paul as a guard, moving inside at the pro level just like Brandon Scherff. Turner's receiving skills will be used right away, as the team does not have enough options at tight end.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2022-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Broncos' first-round pick was sent to the Seahawks as part of the Russell Wilson trade, so GM George Paton solved his biggest problem before the draft. Both Oklahoma's Bonitto and UCLA's Dulcich were great values on Day 2.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Chiefs were able to land the No. 14 (Karlaftis) and No. 15 (McDuffie) players on my Big Board at No. 21 and 30 overall. Western Michigan's Moore, Cincinnati's Cook, Wisconsin's Chenal and Kentucky's Kinnard could all have impact on this season.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Packaging their second-rounder for Khalil Mack kicked off the arms race in the AFC West. Boston College's Johnson and Georgia's Salyer (a steal in the sixth round) will help solidify an improving offensive line.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Raiders had no first-round pick after trading for Davante Adams earlier in the offseason. Georgia's White could be the long-term replacement after Josh Jacobs had his fifth-year option declined.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I had cornerback as the Bills top need headed into the draft and they got themselves a good one in Elam with their first-round pick. The additions of Georgia's Cook and Boise State's Shakir make an already frightening offense even more scary and diverse.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Dolphins didn't have early picks because of trades for Tyreek Hill, Jaylen Waddle and Liam Eichenberg. The speedy Tindal is the only player of consequence they drafted. Arizona State's Diesch has starter potential at tackle and provides great value as a priority free agent.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "D-",
    "gradeNumeric": 0.7,
    "text": "The Patriots first two picks (Chattanooga's Strange and Baylor's Thornton) were massive reaches. Houston's Jones and South Dakota State's Strong are two of my favorite players in this draft class.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "This is the second straight draft GM Joe Douglas knocked out of the park with multiple impact selections on both sides of the ball.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The biggest question mark for the AFC champions going forward after addressing the offensive line through free agency was the secondary. Michigan's Hill, Nebraska's Taylor-Britt and Toledo's Anderson are all versatile, dynamic athletes.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Browns' first-round pick went to the Texans as part of the Deshaun Watson trade. Mississippi State's Emerson was a reach with their first selection in the third round, but Purdue's Bell and Oklahoma's Winfrey are two of my favorite picks in the entire draft.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A solid effort by Kevin Colbert in his final draft as Steelers' GM. They landed a quarterback without having to trade up, although it remains to be seen if they took the right one. Both Georgia's Pickens and Texas A&M's Leal are talent-rich and Mike Tomlin's coaching staff knows how to develop the positions. However, Colbert whiffed on an offensive tackle (big need) for the second straight year.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "There truly wasn't a position on the Texans I didn't classify as a need before the draft. GM Nick Caserio landed starters in the secondary, on the offensive line and at wide receiver, running back and linebacker.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Colts traded away their first-round pick as part of the Carson Wentz trade last offseason, so I have to dock them for it. Otherwise, a solid effort by GM Chris Ballard. Missouri State's Johnson could end one of the steals of the draft.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The narrative of this draft group will be determined by whether Walker matches or exceeds the production of Aidan Hutchinson. Landing both Utah's Lloyd and Wyoming's Muma at linebacker was a coup for GM Trent Baalke.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The two picks the Titans netted in the A.J. Brown trade were used to draft receivers Burks and Philips. The long-term perception of GM Jon Robinson's group will depend on Willis' development — he was a great value at No. 86 overall.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Cardinals flipped their first-round pick for Marquise Brown, reuniting him with former college teammate Kyler Murray. GM Steve Keim failed to adequately address cornerback for the second straight year. In fact, his strategy seemed tailored to making amends with Murray. We'll see how that goes.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Rams first- and second-round picks secured Matthew Stafford and Von Miller, and essentially a Super Bowl championship, so I can't argue with GM Les Snead's overall approach. I just wish he would have added more talent on the offensive line here — Wisconsin's Bruss was a reach in the third round.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The 49ers didn't have a first-rounder after trading up for quarterback Trey Lance a year ago. GM John Lynch's collection of players fit what Kyle Shanahan's team does to a tee. Time will tell whether LSU's Davis-Price and SMU's Gray were reaches in the third round, but I believe USC's Jackson will end being one of the best picks of the entire draft.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Have to believe Russell Wilson would have loved the Cross and Lucas picks. If only, right? GM John Schneider and coach Pete Carroll likely unearthed two more studs for their secondary in Cincinnati's Coby Bryant (No. 109 overall) and UTSA's Tariq Woolen (No. 153 overall).",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "In hindsight, only getting a fifth-rounder for Amari Cooper from the Browns is baffling. I also believe passing on Devin Lloyd at No. 24 might come back to haunt them, but there's some talent here and LSU's Clark could be a steal when he's healthy enough to play.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New GM Joe Schoen landed elite pass rusher (Thibodeaux) and offensive tackle (Neal) with his first two picks. Kentucky's Robinson was a reach at No. 43 overall and only truly makes sense if the Giants end up trading Kadarius Toney. Both San Diego State's Bellinger and Cincinnati's Beavers were great values and addressed two significant needs.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Eagles came into the draft with multiple first-round picks and used one of them to land superstar wide receiver A.J. Brown in a trade with the Titans. GM Howie Roseman also gave Brown the contract extension Tennessee wouldn't. Georgia's Davis and Dean could be special. Nebraska's Jurgens is likely future Hall of Famer Jason Kelce's successor.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "GM Martin Mayhew failed to address the offensive line, linebacker or cornerback significantly, which were all big needs, but taking North Carolina's Howell at No. 144 overall might be Mayhew's saving grace.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "The Bears' 2022 first-round pick was sent to the Giants as part of the Justin Fields trade last offseason. New GM Ryan Poles needed to upgrade Fields' protection and find his quarterback some weapons. Tennessee's Jones was a significant reach at No. 71 overall and Poles needs two of his three Day 3 offensive lineman to pan out — Southern Utah's Jones being the most likely.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "GM Brad Holmes has a chance to come away with the best defender (Hutchinson) and wide receiver (Williams) in this draft class. Also, kudos to Holmes for showing restraint with the quarterback position.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Packers drafted two of the record five Georgia defenders selected in the first round — can't go wrong there. GM Brian Gutekunst addressed receiver on Day 2, but I wonder if he might regret passing on Skyy Moore or George Pickens in favor of the dynamic (but raw) Watson. Landing three potential starters (eventually) on the offensive line (UCLA's Rhyan, Wake Forest's Tom and Penn State's Walker) pushes this group over the top.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Rookie GM Kwesi Adofo-Mensah showed polish by trading back from No. 12 overall and stockpiling picks. He immediately addressed the Vikings porous secondary with two impact prospects (Georgia's Cine and Clemson's Booth). The momentum dried up on Day 3.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "GM Terry Fontenot strengthened a poor pass rush with Penn State's Ebiketie and Western Kentucky's Malone. Montana State's Andersen is the definition of upside and Cincinnati's Ridder was a great value at No. 74 overall.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Panthers were missing two valuable picks due to the Sam Darnold acquisition, but they might have found his replacement in Ole Miss' Corral (a great value at No. 94 overall) — and it only cost them a 2023 third-rounder to move up.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "As much as I love the GM Mickey Loomis' picks in the first round — Ohio State's Olave and Northern Iowa's Penning are perfect fits and fill huge needs — Tennessee's Taylor at No. 49 overall is in the conversation for the biggest reach of the 2022 NFL Draft.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "GM Jason Licht deftly traded out of the first round, moving back from No. 27 to No. 33 and adding No. 106 (4th) and No. 180 (6th) to do so. Houston's Hall, Central Michigan's Goedeke, Arizona State's White, Washington's Otton and Sam Houston State's McCollum could all be impact players for a team still firmly in the win-now mode with the return of Tom Brady.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2022-05-02/2022-nfl-draft-grades-for-all-32-teams/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Watching this draft unfold was like falling in love with your favorite characters over the course of a long-running sitcom. Every development warmed the heart. Every pick caused us to raise our hands and wonder why it seemed certain players just sifted through the mud and into their hands. The Ravens got one of the best safeties to appear in the draft in years. They got the best center to appear in the draft in years. Ojabo is a rehab player worth waiting for—with obvious first-round upside—and Jones is a defensive tackle we liked as a first-round prospect. Watch Jones late in meaningless UConn games as he tosses people around like it's the Super Bowl. Our radar is up on the addition of Faalele, the 6' 9\" tackle who is nearly 400 pounds. Baltimore wins with size and does an excellent job of plucking large human beings and deploying them in the ultimate market inefficiency. They are also back on the tight end grind, amassing some stylistically different bodies who can work in and out of the backfield. Lamar Jackson is at his best with a complement of heady, medium-range receivers at his disposal. Hollywood Brown wanted to leave Baltimore because of the system; he didn't say the system was faulty, it just didn't necessarily set him up as well. If Likely is working in the pass game against a middling coverage linebacker this year, he'll be able to make a mark in the league right away.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "We're only giving out two A-plusses in this draft, so kudos to the Eagles for netting one of them. Obviously, the A.J. Brown trade should be factored into this haul. While teams were jockeying over unproven talent, the Eagles went out and got a player who, if he were in this year's draft, may have gone in the top three. Jurgens, selected with the blessing of long-time center Jason Kelce, is a clone of the legendary Eagles center. Pull up some Nebraska tape from this year and watch Jurgens fly off the ball on some athletic pulling maneuver, or whip downfield on a screen pass. There is a reason Kelce has been able to thrive as a sixth-round pick for as long as he has, and Jurgens has that same athletic core in spades. Davis was one of our favorite players in this draft and, paired with Fletcher Cox for at least one season, he makes up a formidable inside-rush tandem that will haunt the quarterbacks of the NFC East. Dean is worth a flier despite the Eagles not really suited for taking risks at the moment. The Georgia linebacker dropped in the draft, reportedly because of a handful of injuries that he denies are serious. We've seen other players, such as Myles Jack, drop for similar reasons and go on to have successful careers. Dean is agile and, despite being on the smaller side, makes up for his lack of heft with some noticeable smarts. There were certainly some plays at Georgia that popped off the screen while having nothing to do with the all-star cast in front of him.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "GM Brad Holmes had us swooning the moment he jumped back into the thick of the first round to land arguably the best wide receiver in the class. He had us blindly supporting any and every future move with the addition of Paschal. As much as we heralded Hutchinson as the consummate Dan Campbell player, Paschal may be the more ideal fit. He can line up in multiple positions and he plays every down like an oversized toddler kicking his way through a playpen full of block towers—it's pure joy and destruction. The Lions may be the most improved team in the NFL next year by virtue of this class. With one slate of picks, both head coach and quarterback feel supported and pacified. There isn't much more a GM can do.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I'll use this space to continue my rant from Thursday. It befuddles me that we depict Aaron Rodgers as this Wizard of Oz-ian character sitting behind the curtain bellowing about the team's lack of wide receiver talent. Rodgers has been incredibly blessed throughout his career to work with a bevy of talented wideouts supplied to him by the Packers' front office. Their process has expertly identified high-upside players in the second round and beyond. So when Green Bay took their Davante Adams haul and used it toward patching up the defense, why would he be upset? Wyatt is going to add a fascinating upfield interior pressure component to the Packers defense. A true run disruptor, he'll help Green Bay become less reliant on their exceptional linebacker play. And, lo and behold, they still end up with Watson, who, in the FCS, looked a little like the 6' 5\" kid on the 9-year-old AAU team, completely dominant in an effortless sort of way. The Packers have succeeded with this big-bodied receiver profile before.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I'm going to crib some advanced statistics from Pro Football Focus on Brooks: He had the best pass-rush win rate in the class, the best run defense stop rate in the class and the best pass-rush grade in the class. Chris Ballard makes his money finding valuable contributors in the later rounds. Despite being a GM fighting one-handed, having to consistently sacrifice draft capital to find a long-term answer at quarterback, Ballard may have come out of this year's draft with a handful of starters. Raimann was discussed as a first-round pick. The athletic project out of Austria started his football career as a tight end, with his transition to tackle yielding a fascinating strand of tape. Raimann can get beat from time to time but still has the holdover recovery speed from his pass-catching days.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "We may be over-grading the Chiefs, falling victim to a trap typical of draft time: Loving the team who took the players we heard the most about during the pre-draft process. However, I had a chance to watch one of Karlaftis's pre-draft workouts for a magazine story we did on this year's pass-rusher class and came away impressed with his sheer size and motor. At Purdue, he was often keyed on but gained valuable reps forcing his way through double teams. He looks like the kind of chugging, effort player who can develop into a Trey Hendrickson of sorts if the Chiefs can support him on the back end. Which brings us to Cook. The Chiefs have done a really nice job identifying support players at the safety position throughout the Tyrann Mathieu era and Cook is another multifaceted defender who could turn out to be an every-down player under defensive coordinator Steve Spagnuolo. McDuffie, a little shorter than typical Spagnuolo corners, is incredibly smooth and is the kind of guy who wouldn't get turned around by Russell Wilson if Wilson sends a receiver out for a route with multiple components while he extends plays.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Jets have been in a vicious cycle of late. The end of the Mike Tannenbaum era carried a chips-all-in mentality balanced by the John Idzik era of savings and pragmatism (though most of the draft picks they acquired failed to produce). This was followed by a disastrous Mike Maccagnan regime that buried the franchise … until now? As we mentioned in our draft night recap, I'm not sure people understand how difficult a job Joe Douglas had and how far the roster has come. With this class, the team should be able to start seeing some results. Ruckert was an interesting pickup. On film at Ohio State, he carried some of the exact same responsibilities as Kyle Jusczcyk and George Kittle do in the 49ers' offense, down to some of the minute, arc-motion-style blocking. This should be a real plug-and-play scenario for the Jets, who needed more players intimately familiar with the way offensive coordinator Mike LaFleur wants to run his offense. Hall is exactly what Zach Wilson and the offense needs: a running back who can turn a play dead in the backfield into something. At Iowa State, he rescued the Cyclones from time to time when their offensive line was plowed over.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This year will be a significant test of the Browns' process as a front office. Paul DePodesta and the scouting department have gotten roughly six years of data and experience to try and ferret out what makes a good football player and what is necessary to win. The results so far have yielded a single playoff win, far more than the Browns have enjoyed in the past but probably less than the average general manager from a non-analytical background dart throwing at Mel Kiper's Big Board. That said, this draft is full of some players who can come in and play quickly. Winfrey is a favorite here and a player we discussed a bit on the podcast. The violent defensive tackle has some really impressive anticipatory skills against the run and a knack for pushing his way into the backfield. This is a year for hybrid run-stuffing/pass-rushing tackles and Winfrey is one of the best. A lingering question: Did Cleveland do enough at wide receiver?",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This is what you'd expect out of a pick-starved class. The Raiders took some big swings at SEC players who can compete for jobs right away. Just because a team is out of early-round picks doesn't mean they have to throw their hands up. Neil Farrell was a favorite, as it's always fun to see Patriots coaches leave New England and immediately try and find a space-eating cornerstone for their own defense (Vince Wilfork's playing days still leave an impression on people). Parham is another sign that coach Josh McDaniels hasn't forgotten his long-time mentor. Parham can play all over the offensive line, and figures to immediately factor in as a training camp battle to watch.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "It's fun to watch consistent outside zone teams draft because they are so aware of their needs and the kinds of players who fit perfectly into their system. As co-host Gary Gramling and I discussed on the MMQB NFL Podcast, Burks represents the most significant gamble on \"system over player\" that we've seen from any coach running the offense. Kyle Shanahan held out on Deebo Samuel. Mike Vrabel and Jon Robinson allowed A.J. Brown to leave for the Eagles. We identified Burks as the perfect kind of player for that system, one who could have ideally fit in Green Bay had the Titans not scooped him up in the late teens. We tend to heap too much praise on teams that attack pinpoint areas of need, but the selection of Petit-Frere could allow the Titans to shuffle their offensive line and put some other players in more natural positions where they could attain a higher ceiling. The Willis fit is an obvious favorite. He could be a threat to Ryan Tannehill by mid-season depending on how quickly he picks up the offense. His time at Liberty was exceptional, though the Flames were not a team that won consistently with scheme. Willis can play on schedule and on the move in Tennessee, which is where his strengths lie.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "When it comes to the Bengals, I'm done fading their personnel department (in terms of a pure on-field scouting perspective, obviously not their ability to do background). Because the scouting staff is small, a lot of players are requested specifically by the coaches, who can identify direct scheme fits. The Bengals won a year ago by empowering their front four and dotting the defensive backfield with adequate speed and coverage ability. Hill was obviously a favorite pick, a guy the Bengals might have gotten with a high second-round selection in their previous life as a non-contender. Taylor-Brit looks like a smart addition in the AFC North, where every opponent the Bengals face on a regular basis is either going to try and run the ball down their throats or check-down them to death with physical backs. At Nebraska, Taylor-Brit had a reputation for punching himself through second-level blocking and bringing down sizable backs.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Broncos came into this draft knowing they had to find help at the edge. Instead of reaching for the back end of the finished-product market, they chose one of the better pure speed rushers available in Bonitto. He is going to help Denver execute some of the simulated pressures defensive coordinator Ejiro Evero spearheaded with the Rams. Dulcich seemed to sneak under the radar of the tight end class but should figure into Denver's process quickly. Broncos head coach Nathaniel Hackett finds a lot of success targeting the position and using the interplay of blocking and receiving to set up long-term gains.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Texans are turning the corner on their rebuild, from chaotic Game of Thrones-esque power struggle to not-so-subtle tank job, to, now utilizing some of those assets to formulate the basis of whatever Nick Caserio's long-term vision might be. Stingley is incredibly talented, a cornerback who has the tools to be among the league's best. And fast. It's curious that the knock on him was that his play slid after the 2019 LSU championship season, and not that his coaching staff did the same, ultimately leading to Ed Orgeron's ouster and the hiring of Brian Kelly. The Texans mined the Belichick-Alabama pipeline frequently in this draft and, despite missing out on the initial run of wide receivers, managed to find a functional pass catcher in John Metchie III, who will provide Davis Mills with the kind of playmaker who can turn horizontal throws into significant gains. For a team that was depending an awful lot on 28-year-old Brandin Cooks, the Texans have a chance to look a little less adrift offensively now, forcing defenses to respect both their deep speed and intermediate speed.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It was fun to see GM Les Snead with this many picks, including three before the sixth round. It gives us at least some sense of where the Rams see themselves pivoting in the near future. From Sean McVay's reaction to the Patriots' selection of Cole Strange, it was obvious the Rams were going guard right away. I got a chance to see Bruss against Aidan Hutchinson from this past year and while Hutchinson was certainly the more dominant player (and Bruss got away with one hell of a hold) there was no doubt the fearlessness in his game. Pro Football Focus has him with just one sack allowed since 2019 while playing in two different roles (guard and tackle). The Williams pick is worth noting as well. The Rams always seem to be searching for more of an answer at the running back position. Williams is a solid back who can make good decisions off lateral movement and has a decisive first move along with some notable balance.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Kyle Shanahan and the 49ers' scouting department must have some kind of bat signal every time an athletic wide receiver catches a ball on a drag route with a head of steam and gains an unreasonably large amount of yards after the catch. Such a signal must have blinked wildly several times last year on Danny Gray. Jackson was a worthwhile swing at the edge-rusher position, which the 49ers desperately need to start replenishing if they want to run the kind of defense that brought them into Super Bowl contention in the first place. Jackson wins in a variety of ways, and given that he didn't lean on one particular mode of getting to the quarterback, he should arrive at the next level as a fertile mind for a set of good defensive coaches.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Cowboys' draft was fine, but seemed to do nothing to separate them from an NFC East field quickly gaining ground. This was a two-year window in which Dallas had the opportunity to step on the throat of a fledgling division. Instead, the Cowboys exposed some of their most significant weaknesses. Dallas spent their first pick replenishing the offensive line and their off-ball linebacking corps, two units among the best in football for a short time before they aged out. Williams is an attractive chess piece for defensive coordinator Dan Quinn, who has generated new life for his ability to isolate and empower pass rushers. Ferguson eventually could add some pop to Dallas's offense as a secondary playmaker. Coming from a Wisconsin program where blocking is a necessity, it seemed like a lot of his routes came as he recovered from chipping duties at the line of scrimmage.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I always dislike a team that's bottoming out from a personnel standpoint trying to break in potential left tackles. It's a position, like cornerback and quarterback, where players can develop bad habits quickly when overwhelmed. The Seahawks offense is going to be overwhelmed this year fairly consistently. Mafe is going to be 24 at the end of his first NFL season, which, to me, isn't a huge issue; he brings physical maturity even if his pass-rushing toolbox needs to be developed. Walker was such a Seahawks pick. There is something about a sturdier back who can cause missed tackles with subtle movement, supplementing with a hits-bigger-than-he-looks frame that must cause Pete Carroll to flip the table over.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "I think the main criticism here is a failure of GM Scott Fitterer to make more out of what they have. We've watched, for instance, as the Eagles rescue themselves through smart administrative work, and then watch other teams (such as the Panthers) in a perpetual shrug emoji. If the plan was not to draft the best quarterback available, the limited draft capital at their disposal should have gone toward an all-In approach to buoy Sam Darnold. If the plan was to draft a quarterback to compete with Darnold, they should have tailored the draft around Corral, who hails from an RPO heavy system that requires certain players to make it effective. Brandon Smith seems like a Phil Snow (defensive coordinator) type of player, though, with blitz capability off the edge and a mean streak. While it's always hard to project big hitters once collegiate players reach a larger pond, Smith has quite the resume of helmet-twisters from his time in Happy Valley.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "I understand the Bears and their fan base are sensitive to the perception that they're not doing enough for Justin Fields right now, but it's hard to come out of the 2022 draft without an offensive playmaker or lineman until the third round. That said, Jones adds some juice to the return game and provides the Bears with an intermediate target who could bolster their YAC ability on short-range screens and quick-timing throws. Brisker may headline the class and is a true Matt Eberflus-type player; he is not going to miss tackles and will be the kind of player pressing the line against Green Bay, bringing AJ Dillon down late in games when everyone else prefers to hide away.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "This is a small class thanks to the Tyreek Hill trade, but it still managed to surprise me. While the Dolphins gobbled up another YAC wide receiver, they didn't select a true Mike McDaniel running back or help the offensive line. The Thompson pick was interesting if it has any meaning beyond just a backup. Thompson is really athletic and has a kind of faster Carson Wentz-ian vibe to him. Could the pick be inferring that the Dolphins are going to run a good deal of zone read and want a QB versed in the system? Could Thompson be a special package guy? Should we just go to bed?",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "It's always strange when a team is so locked in on a player. It's hard to give them a bad grade because, organizationally, whatever happened to move up for and acquire Olave is a resounding success. The fact that a team was so infatuated with someone that they could move into the first round again and then move up in the first round represents some kind of alignment between scouting and coaching. This is never bad. That said, it's just hard to see the Saints the way the Saints see themselves. Sans Sean Payton, with a still-very-good defense, New Orleans is behaving like a team one inch from deep playoff contention. Penning is big and nasty, and may be ideal in the NFC South. Outside of Carolina, most of the division rushes more successfully from the interior with larger players; Penning can close down on those blocks with force. Taylor is going to be a contributor right away in the running game and is fearless moving up toward the ball.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "This is the draft I'm prepared to be the most wrong about. We've been advocating for years that the Cardinals simply sell out and pour all available resources into their offense, so this should be a satisfying moment for us. However, their aging roster composition needs to be supplemented by long-term talent on affordable contracts. The Cardinals will have to extend both Kyler Murray and Hollywood Brown soon, both at the blistering heights of both positional markets. To sacrifice a first-round pick in this draft and pay nearly as much as the Eagles offered for A.J. Brown is difficult to stomach. Of course, this is assuming Brown doesn't explode in Kliff Kingsbury's offense, one he is far more comfortable in compared to the Ravens'. If used correctly, Sanders has the most star potential in this class.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "While the Commanders needed a wide receiver, it's hard to understand their philosophy in the 2022 draft. Unless Dotson was by far the No. 1 pass catcher on the board, trading back and missing the thick of the wide receiver run and only netting a third- and fourth-round pick for compensation doesn't seem like enough. You could look at their draft and ask: Would you rather have Dotson and two extra mid-round picks or Jameson Williams? Dotson hasn't had an issue escaping coverage in the Big Ten, but does that change in the pros? Mathis should have been more in the conversation with the Georgia defensive tackles and certainly improves a talented Washington front, but did the Commanders follow their board too tightly? There are certainly some positions of need that didn't get addressed.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2022/04/30/2022-nfl-draft-team-grades",
    "playerGrades": []
  }
]