[
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Cardinals made eight picks, but it was a draft-day trade that will define their weekend. The Marquise Brown trade is obviously going to be their defining move of this draft. It's a win for the Cardinals in that Brown is a slight upgrade over Christian Kirk, and the club probably improved its relationship with Kyler Murray by getting his college teammate. However, giving up a first-rounder for a player on the fourth year of his rookie contract downgrades the move. Once the Cardinals actually got on the clock, they continued to help Murray by snagging one of the best all-around tight ends in Trey McBride. Rebuilding the defensive front with Cameron Thomas and Myjai Sanders after losing Chandler Jones this offseason made a lot of sense.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Falcons should be applauded for not forcing a quarterback in the first round. Going into the season with Marcus Mariota isn't all that exciting, but adding a jumbo receiver in Drake London will make his life easier. London was the top receiver among a talented class on the B/R big board. The Falcons' patience at quarterback paid off in a big way by getting Desmond Ridder. He was the only quarterback to get a first-round grade from the B/R Scouting Department, and the Falcons got him in the third round. In addition to helping out their post-Matt Ryan passing attack, the Falcons got a lot more athletic on defense. Arnold Ebiketie is a bit undersized but has a great first step, and Troy Andersen has the second-highest relative athletic score since 1987, per Kent Lee Platte of Pro Football Network. Tyler Allgeier has an opportunity to be a Day 3 pick that brings back value. He's the kind of tough between-the-tackles runner the Falcons need to pair with Cordarrelle Patterson in the backfield.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens had one of the best first rounds from a value perspective. They started by getting one of the best overall players (seventh overall on B/R big board) in Kyle Hamilton at 14. Then they traded Marquise Brown with one year left on his rookie contract to get the No. 12 player on the B/R big board with the 25th pick (originally the 23rd pick and traded for the 25th). The good news just kept coming for Ravens fans. David Ojabo could have been a top-15 pick before tearing his Achilles, and Ian Rapoport of NFL Network noted he could be ready to go by October. The Ravens shouldn't mind waiting. They grabbed another immediate-impact prospect in Travis Jones in the third round. Jones brings a huge frame with the athleticism to be a factor as a pass-rusher. All told, the Ravens likely walked away from this draft with four solid starters within the next two years. That's not even factoring in a few Day 3 picks with high upside, including massive offensive lineman Daniel Faalele and a pair of tight ends in Isaiah Likely and Charlie Kolar.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Buffalo Bills are in contender mode, which means if there's someone available who could make a difference in the playoffs, it makes sense to get aggressive. That's exactly what they did in trading up for Kaiir Elam. With all the talented passers in the AFC, Elam could be a crucial addition to the secondary. James Cook adds another pass-catching dynamic option in the backfield to compete with Devin Singletary. That's an important step toward taking off some of the burden on Josh Allen. Overall, the Day 2 picks weren't all that inspiring, but they were boosted by taking Khalil Shakir in the fifth round. He was the 43rd player overall on the B/R big board, and he adds another young receiver to Josh Allen's arsenal. Shakir could easily show a great return on investment as the heir apparent in the slot to the newly acquired Jamison Crowder.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Trades for Sam Darnold and C.J. Henderson left the Carolina Panthers with a light stockpile of picks. However, we aren't here to grade those trades, so the focus is the sixth pick here. What they did there was add an absolute mauler of a left tackle to an offensive line that was 31st in PFF's final offensive line rankings. That isn't quite the same as finding a franchise quarterback, but it certainly makes it a more appealing landing spot for one. Ekwonu was the third player on the B/R big board, so the value at No. 6 was as good as it possibly could have been. Trading up for Matt Corral has to be seen as a win. The Ole Miss product got a Round 3 grade from the B/R Scouting Department, and the Panthers didn't reach on him. Not a bad investment for a potential starter. Brandon Smith is the most notable of the Day 3 additions. He should compete to get in the linebacker rotation. Overall, the Panthers made two great choices for them with their top two picks. Since we are only grading what happened on draft weekend and forgiving them for the Sam Darnold trade, this is a good haul.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Chicago Bears are apparently taking their reputation as a franchise that has fielded great defenses very seriously. After hiring a defensive-minded head coach in Matt Eberflus, they spent each of their second-round picks on the defensive side of the ball. Kyler Gordon and Jaquan Brisker bring good value and are capable of being mainstays in the secondary. However, it's hard to get past the fact the Bears did nothing to help Justin Fields with their best picks. The first attempt at helping out Fields was a curious one. Velus Jones Jr. has excellent speed, but that's about it. He'll be 25 before the season starts and has a lot of development to do before being considered a well-rounded receiver. Even in the best-case scenario this draft only serves as a major upgrade to the Bears secondary. It doesn't do nearly enough to help out Fields, which should be the team's top priority right now.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Cincinnati Bengals hadn't used a first-round pick on defense since Williams Jackson III in 2016. So it makes some sense the Bengals targeted Daxton Hill. His value will ultimately come down to defensive coordinator Lou Anarumo figuring out how to use him. He primarily played in the slot at Michigan but has the athleticism to play deep as well. The defensive investment continued in Day, 2 but the value was questionable. Both Cam Taylor-Britt and Zach Carter were taken more than 60 spots ahead of where the B/R big board had them ranked. After investing heavily in the offensive line in free agency the idea of utilizing the draft to build out the defense is fine. But it's hard to get too excited about what the Bengals did from a value standpoint.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "General manager Andrew Berry channeled his inner Kevin Costner here working his way up and down the board. The Fitzgerald-Spielberger trade chart that Over the Cap uses to analyze draft trades loved Berry moving back in the second round to pick up two fourth-round picks. The Cleveland Browns did well to find Martin Emerson—a long and physical cornerback—in the back half of the second. He fits what they are looking for in a cornerback and could contribute at a premium position. Alex Wright and David Bell are opposite prospects. Wright's athletic profile projects the ability to be better in the NFL than he was in college, while Bell will have to overcome a general lack of athleticism to find success in the league. This class was always going to be short on immediate impact players. That's the cost of trading for a quarterback like the Browns did with Deshaun Watson. But trading back was an even bigger move toward quantity over quality in this class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Dallas Cowboys offensive line coach Joe Philbin will be the deciding factor as to how Tyler Smith pans out. The nasty demeanor and physicality are easy to love, but Smith has some technical things to work out in pass protection to maximize his value. He's a bit of a project with the 24th pick. It's hard to love the pick when Jermaine Johnson II or George Karlaftis would have immediately contributed as pass-rushers. Getting Sam Williams on Day 2 salvages the grade from that perspective. The Ole Miss product ran a 4.46 40-yard dash at the combine and had 12.5 sacks in his final season. Value was hard to find at the receiver position. Pass-catchers flew off the board early and often, but the Cowboys have to be happy with Jalen Tolbert dropping all the way to the third round. According to PFF, no receiver in college football had more receptions of 15 or more yards than Tolbert.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Denver Broncos didn't have the capital to be too splashy, but they got solid value with what they had. Nik Bonitto is a bit of an undersized one-trick pony as an edge player. Fortunately, that one trick is chasing down quarterbacks. The 248-pounder ran a 4.54 40-yard dash, and it shows up in his speed rush on film. Greg Dulcich was a great pickup in the third round. He was named the \"best receiver\" of the class by the B/R Scouting Department and addresses a clear need after Noah Fant was traded away as part of the Russell Wilson trade. While the hit rate on Day 3 picks isn't great, it helps when you have seven bites at the apple. Eyioma Uwazarike is the most interesting fo the bunch. He's an older prospect after a six-year collegiate career, but at 6'6\" and 316 pounds with 12 tackles for loss and nine sacks in his final season, he's an intriguing fit as a defensive tackle/defensive end hybrid.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Detroit Lions front office had to be ecstatic the Jaguars were willing to take the gamble on Travon Walker at the top of the draft. It allowed them to take a prospect in Hutchinson that brings a high floor to the table while still carrying the potential to be a Pro Bowl-caliber pass-rusher. The news kept getting better for the Lions' faithful in the first round. They moved back 12 spots in the second round and give up a third-rounder to move up 20 spots in the first and pick up Jameson Williams. Jared Goff might not have the arm to unlock his potential, but whoever the quarterback in 2023 is going to be grateful for the move. Doubling down on edge-rushers was a smart move. The Lions were 29th in pressure percentage last season, per Pro Football Reference. Hutchinson and Josh Paschal should help that number rise. Kerby Joseph was the first questionable pick for the Lions brass. He was ranked as B/R's 177th overall prospect, so taking him with a top-100 selection was a reach.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "If anything, general manager Brian Gutekunst has proved that he loves lighting mock drafts on fire. With most mocks featuring the Green Bay Packers taking a receiver, he opted for an off-ball linebacker after signing De'Vondre Campbell to a big extension this offseason. Devonte Wyatt's age (24 years old) is a concern. He'll be 29 by the time he's negotiating a second contract. However, he has one of the best first steps in the class. The Packers have made it clear they aren't fans of taking a receiver in the first round. They haven't done it since 2002, but trading two second-round picks for one to move up and take Christian Watson seems like a price that was too steep. Watson's size and speed combination is tantalizing (4.36 40 at 6'4\" and 208 pounds). However, he needs to develop as a route-runner and has questionable hands. He had 16 drops in his career at North Dakota State, per PFF. Zach Tom and Kingsley Enagbare are the kind of high-potential Day 3 picks who could wind up saving this class, but relying on Day 3 picks to hit is not a great situation.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It's hard to love the Stingley pick at No. 3 when the team is banking on getting the 2019 version and Ahmad \"Sauce\" Gardner has three years of lockdown play on film. That said, the version of Stingley we saw when he was a freshman has All-Pro potential. Kenyon Green was a bit of a reach at No. 15 even if the Houston Texans did trade back before taking him. He was No. 42 on the B/R big board, and with a relative athletic score of 5.98, he isn't elite in that area. Jalen Pitre, Christian Harris and Dameon Pierce were all great value picks in the middle of the draft. Given the Texans roster, they should be immediate contributors. The John Metchie III pick is the lone confusing one in that range. He's still recovering from a torn ACL and was 94th on the B/R big board but went 50 spots higher. At least it was a reach on a position of need.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Indianapolis Colts came into this draft with a need to improve the weaponry for Matt Ryan and hopefully land a starting tackle prospect. That was a tall ask given their draft capital, but general manager Chris Ballard ended up navigating it well. Alec Pierce gives Ryan another big-bodied receiver to work with opposite of Michael Pittman Jr., while Jelani Woods' size and athleticism make him the most intriguing tight end prospect in the whole class. The true steal in this class is Bernhard Raimann, though. He was the fourth tackle and 28th overall prospect at a premium position, and the Colts stopped his slide with the 77th pick. The Colts easily had the most athletic draft class by Pro Football Network's Kent Lee Platte's relative athletic score. If this class is as successful as it could be, that's going to be a metric that continues to get increased attention.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Jacksonville Jaguars general manager Trent Baalke really swung for the fences making Travon Walker the No. 1 pick. Walker's freakish size and speed combination are tantalizing, but there's a lot of projection to justify making him the top pick when there were more proven options available. The biggest story after Walker is Baalke's apparent affinity for off-ball linebackers. They spent a Day 1 and Day 2 pick on Devin Lloyd and Chad Muma. The move gives them flexibility in the middle of their defense, but it is a little odd given the contract they just handed Foyesade Oluokun. Ultimately, Jacksonville got better through this draft, but that's a pretty low bar. There are legitimate questions about whether the team got the best value out of the draft picks it had.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The rich really got richer with this draft haul. Everyone in the AFC West now has the makings of an elite passing attack. So it makes sense the Kansas City Chiefs got aggressive in adding a corner who can fit their scheme. Trent McDuffie does not have prototypical size, but he played more press than anyone not named Sauce Gardner, per PFF. The pattern of taking high-effort players with atypical length continued with the George Karlaftis selection at No. 30. He was ranked as the eighth overall prospect on the B/R big board, so getting him at 30 is a potential steal that fills a need. The Chiefs kept finding the values in Day 2. Skyy Moore is set up to have early success. Patrick Mahomes is going to love his feel for getting open and route running. Leo Chenal is an uber-athletic linebacker with the potential to be an elite run defender and devastating blitzer. Kansas City is trusting Mahomes to elevate the offense. The team did a great job of investing in a defense that can hold up its end of the bargain.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This is one of those draft classes where it's important to keep in mind that we are grading how well teams did with what they had. The Las Vegas Raiders didn't pick until the third round and still managed to get good prospects who should compete to fill holes they have on the roster. Dylan Parham was No. 76 on the B/R big board and the No. 8 interior lineman. They got him with the 90th pick. He has the athleticism and ability to challenge for the starting right guard spot from Day 1, which would allow the team to move Alex Leatherwood back to tackle. The Zamir White pick makes a lot of sense after the team declined Josh Jacobs' fifth-year option. He'll give them a young complementary back. The under-the-radar picks that could be significant are Matthew Butler and Neil Farrell Jr. Both project to be assets against the run. The idea of doubling up in hopes that at least one of them becomes an early contributor is laudable.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "One of the biggest organizational priorities for the Los Angeles Chargers has to be protecting Justin Herbert at all costs. They took a strong step toward that goal with Zion Johnson in the first round. His rise from a 0-star prospect at Davidson to a first-round draft pick out of Boston College embodies the kind of work ethic you want to add in the first round. After Johnson, it's hard to get too excited about any one of their picks. JT Woods could end up being a serviceable starter, but there were higher-upside options available. Jamaree Salyer is the most intriguing of the Day 3 picks. The 6'3\", 321-pound lineman played all over the line at Georgia. That versatility could make him a career-long utility player at worst, with the potential to become a starting guard down the line.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Even taking into account the Los Angeles Rams' limited supply of picks, this just isn't an inspiring draft class. Logan Bruss is best described as solid. B/R NFL Scout Brandon Thorn described him as \"best at guard in the NFL with the base, body control, strength and technique to become a quality backup inside.\" The most exciting pick might be Kyren Williams. The running back didn't stand out with his athletic testing at the combine, but he was a reliable pass-catching back at Notre Dame. He had 78 career receptions and drew a comparison to James White in his B/R scouting report. The Rams have proved they don't have to have great drafts to be Super Bowl contenders. That's a good thing given this year's group.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Miami Dolphins are seemingly trying to emulate the Los Angeles Rams' approach to the draft by trading many of their picks for established veterans. The Dolphins pulled off a blockbuster trade this offseason, sending the No. 29 pick along with 2022 second- and fourth-rounders and 2023 fourth- and sixth-rounders to the Kansas City Chiefs for star wideout Tyreek Hill. That left Miami with only four picks to use this year. Channing Tindall is the highlight of the class. His sideline-to-sideline speed should help him get on the field as a rookie. Part of that will be in sub-packages, but he should also be a factor on special teams. The Dolphins took wideout Erik Ezukanma in the fourth round, but he didn't even make the top 200 on B/R's final big board. Luckily, they won't need him to make an immediate impact with all of the changes they've made to their receiver room this offseason.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "New Minnesota Vikings general manager Kwesi Adofo-Mensah showed he's more than willing to wheel and deal during his first draft. He traded the Nos. 12 and 46 picks to the Detroit Lions in exchange for the Nos. 32, 34 and 66 picks. In other words, the Vikings essentially moved down 20 spots in the first round to go up 12 spots in the second round and get an extra third-rounder. It's hard to love that trade given how many high-value prospects they missed out on between Nos. 12 to 32. Still, Lewis Cine's athleticism and ability to play as a deep safety should pair well alongside Harrison Smith. However, Adofo-Mensah flipped the script on Day 2 by trading the 34th pick for the 53rd and 59th picks. He then traded up to get Clemson cornerback Andrew Booth Jr., who could become a valuable starter. Cine and Booth have the ability to drastically improve the Vikings secondary, while Ed Ingram could become a valuable cog in the offensive line.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The New England Patriots clearly don't care about any big board but their own. Cole Strange was 98th on the final B/R big board, which made him the biggest reach of the first round. However, Strange does fill a need, and the Pats have previously hit on taking small-school prospects earlier than expected (namely Kyle Dugger). It's also worth noting that his 9.95 relative athletic score compares favorably with Joe Thuney, per Pro Football Network's Kent Lee Platte. The surprising picks didn't stop there. In the second round, the Patriots took Tyquan Thornton at No. 50. He brings blazing speed to the table—he led all wideouts with a 4.28-second 40-yard dash at the combine—but not much else. He was the No. 130 prospect on the final B/R big board. The Pats had an unorthodox draft, as five of their 10 picks came from outside of the Power Five conferences. That isn't necessarily a bad thing, but it is an interesting trend to monitor as this class develops over time.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The New Orleans Saints set out to get two immediate contributors in the first round, and that's exactly what they did. Trevor Penning is reminiscent of Terron Armstead as a prospect. He's an uber-athletic tackle coming from a small school. He'll now replace Armstead, who started 93 games for the Saints over the past nine seasons before signing with the Dolphins this offseason. Meanwhile, the B/R Scouting Department considered Chris Olave to be the best route-runner and most pro-ready wideout in this year's class. His ability to find soft spots in coverage should make him a reliable target for quarterback Jameis Winston right away. Taking Alontae Taylor in the third round was far from a slam dunk, but cornerback is an increasingly valuable position. We can't fault the Saints for stocking up there even though the B/R Scouting Department gave Taylor a fourth-round grade. The key to this draft was nailing the first two picks, and the Saints seem to have done that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "In terms of adding top-end talent, it's hard to beat what the New York Giants did on Day 1. Kayvon Thibodeaux and Evan Neal were Nos. 1 and 2 on the final B/R big board, respectively. New Giants general manager Joe Schoen managed to get both with his pair of top-seven picks. However, it got harder to love what the Giants did on Day 2. Kentucky wideout Wan'Dale Robinson is a unique prospect with a small frame, and he's a slippery runner after the catch. But he's a discount Kadarius Toney for a team that already has Toney on the roster. Joshua Ezeudu made sense in the third round as a versatile lineman who should compete to play guard sooner rather than later. Depth is vital on the offensive line to survive the rigors of the 17-game season. Darrian Beavers is an intriguing Day 3 pick. He was No. 58 on B/R's big board and was one of the most agile linebackers at the combine. Defensive coordinator Wink Martindale will figure out how to make him an asset.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The New York Jets needed a transformational draft class, and that's exactly what this has the potential to be. Ahmad \"Sauce\" Gardner has rare length for a cornerback and was dominant while being asked to play plenty of press coverage in college. He never allowed a touchdown reception during his time at Cincinnati, according to Pro Football Focus. Garrett Wilson was the fifth receiver on the final B/R big board, but he was 19th overall, so it wasn't an egregious reach. Trading back into the first round to select Jermaine Johnson II gives the Jets three immediate starters at impact positions. The Jets then turned their attention to helping second-year quarterback Zach Wilson on Day 2. Breece Hall has the makings of a superstar tailback, while Jeremy Ruckert was the top tight end in B/R's rankings. The Jets had to nail this draft, and general manager Joe Douglas did just that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "If you had to sum up the Philadelphia Eagles' draft strategy in one word, it would be aggressive. The Eagles traded the Nos. 15, 124, 162 and 166 picks to the Texans to jump ahead of the Ravens to No. 13, where they took Georgia defensive lineman Jordan Davis. He was one of the standouts of the combine and had the highest relative athletic score of any defensive tackle since 1987, according to Kent Lee Platte of Pro Football Network. However, he played only 38 percent of the snaps at Georgia, which raises questions about whether he can be a three-down player. While trades before the draft aren't being considered in these grades, the Eagles' trade for Tennessee Titans wide receiver A.J. Brown does factor in. After whiffing on some early-round wideouts in recent years, they traded the Nos. 18 and 101 picks to land an established star. With quarterback Jalen Hurts still on his rookie contract, the Eagles' cap situation enabled them to hand Brown a four-year, $100 million extension. They're now in a great position to find out whether Hurts can be their long-term answer under center. Meanwhile, defensive coordinator Jonathan Gannon must be thrilled that they landed linebacker Nakobe Dean with their third-round pick. According to Albert Breer of The MMQB, Dean's size, injury history and a current pectoral injury all caused him to slide further than expected. If he's able to stay healthy, he could wind up being the biggest steal of the draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Kenny Pickett going to the Pittsburgh Steelers is a great storyline from a narrative standpoint. They got their pick of quarterbacks at No. 20 and took advantage of the opportunity to take a local product in Pickett. Outside of that, though, it's hard to get too excited about him. Pickett put together a great final season at Pitt, but the coaching staff there may have already squeezed out all of his potential. He'll be 24 by the time his rookie season starts, and he brings limited upside. Even if Pickett doesn't bring sky-high potential, there's still a lot to like about Pittsburgh's draft class. The Steelers are no stranger to getting good value in the middle rounds, and they might have done it again. Georgia wide receiver George Pickens didn't get play much in his final season after recovering from a torn ACL, but he has two seasons' worth of film in the SEC that says he's a pro-caliber wide receiver. Meanwhile, Texas A&M edge-rusher DeMarvin Leal was once a first-round-caliber prospect. Now he goes to a franchise known for developing defensive linemen with a chip on his shoulder.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The San Francisco 49ers could have bolstered their secondary earlier in the draft, but it's hard to fault them for taking pass-rusher Drake Jackson instead. He might have been selected much higher if not for a late-season injury that ultimately might have no effect on his NFL career. After watching what sixth-round running back Elijah Mitchell did in this offense last year as a rookie, it's hard to feel good about the Niners spending a third-rounder on Ty Davis-Price. Danny Gray was a better use of resources. The speedy receiver provides more depth and could be elevated into a larger role than expected if the Niners do trade Deebo Samuel. San Francisco also got a potential steal on Day 3 with Spencer Burford. The 6'4\", 304-pound blocker could eventually play tackle, but his movement skills could also make him a great guard in this system.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Seattle Seahawks didn't find their successor to longtime quarterback Russell Wilson in the first round. However, they did try to make life much easier for whomever that winds up being. Charles Cross might be the best pure pass-protector in this year's draft class. He gave up only two sacks and 14 hurries in Mike Leach's pass-happy offense last season, per PFF. It's always a good idea to build a team through the trenches. That was a theme for the Seahawks in general. Following up the Cross pick with lightning-fast edge-rusher Boye Mafe and another offensive tackle in Abraham Lucas could pay off big down the line. Kenneth Walker III is fine in a vacuum. He's a great prospect and is capable of being an every-down back. But with Rashaad Penny going off for 671 rushing yards in the final five games of last season season, taking Walker in the second round wasn't the best use of resources for Seattle. Then again, with Drew Lock the current presumed starting quarterback, anything the Seahawks can do to build the run game is a plus.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Tampa Bay Buccaneers got off to a strong start by trading back and still getting a player that makes sense for them. Logan Hall is a jumbo edge prospect who will likely start his career inside but could develop into an outside pass-rusher. Joining the veteran Bucs defensive front will allow him to evolve with their future needs. The Bucs got some other high-value targets later in the draft. The B/R Scouting Department pegged Luke Goedeke as the biggest sleeper among the interior offensive linemen in this class, and they named fourth-round pick Cade Otton as the best blocker among the tight ends. Unless Hall reaches his ceiling, there might not be any All-Pro players in Tampa Bay's draft class. That's OK. This draft was about finding role players who can help extend the Bucs' current Super Bowl window.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It's never easy to trade away a talented player. However, it's also easy to understand the Tennessee Titans' hesitance to hand A.J. Brown a megadeal given the ballooning market for wide receivers and his injury history. The Titans traded Brown to the Eagles on Thursday night for the Nos. 18 and 101 overall picks. They spent the former on his potential replacement, Arkansas wideout Treylon Burks. They just have to hope that trade works out like the deal that the Vikings made for Justin Jefferson and not like the one San Francisco made for Javon Kinlaw. The Titans' draft class ultimately hinges on third-round pick Malik Willis. He got a second-round grade from the B/R Scouting Department, but some team figured to reach on him a round too early based on his enormous potential. Instead, the Titans got him at a great value, and they'll be a good situation for him. He'll get to sit behind Ryan Tannehill while learning a pro offense and improving upon his ability to win inside the pocket.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "There isn't a lot to get excited about with the Washington Commanders' draft class. There isn't a lot to get angry about, either. Jahan Dotson makes sense from a need standpoint. The Commanders need pass-catchers alongside Terry McLaurin to give new quarterback Carson Wentz a chance at success, and Dotson should find a role as a No. 2 receiver. There's just little chance that he winds up as the best wideout in the class. Phidarian Mathis is a similar prospect as an interior defensive lineman. He will provide critical depth and likely become a starter down the road with Daron Payne entering the final year of his contract. The biggest qualm with Washington's draft is not using either the second- or third-round pick on a cornerback. The Commanders don't have much depth at that position, but depth is invaluable there. Instead, they opted for a power runner in Brian Robinson Jr., whose role they could have filled through the constantly revolving door of free-agent running backs.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/2955815-2022-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Even though I didn't love their first pick of safety Kyle Hamilton, they killed the rest of the draft. Their first four picks all were mentioned as possible first-round picks. They added a bunch of talented players on day three, including tight end Charlie Kolar. Eric DeCosta nailed this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They opted to trade their first-round pick for Brown, which I didn't like. Taking edge rusher Cam Thomas and Sandra both in the second addresses a major need. Keep an eye on sixth-round guard Lecitus Smith. He has talent.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They took Drake London with their first pick, which will pay off, and wisely waited to take a quarterback in Ridder. He will be a good one and eventually be their guy.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "This team doesn't have a lot of holes, but they filled a big one with Elam. Cook was a bit of a surprise, but I did like fifth-round receiver Khalil Shakir. This is the team to beat in the AFC.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Ekwonu makes this draft, but the rest of it was so-so in large part because they didn't have a lot of picks. Corral is a risky pick. Sixth-round offensive lineman Cade Mays is a good player who will play in the league for a while.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "They didn't have a first-round pick after trading it to get quarterback Justin Fields last year. They picked defensive backs with their first two picks, which they need, but why not an offensive lineman at some point before round five when they took Braxton Jones? I do like Gordon, but they better hope Jones can play.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "This team has really improved in the offseason and can again push for the Super Bowl. They needed help in the secondary, and they landed it with three picks there. Third-round defensive tackle Zach Carter is a player to watch.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't pick until the third round because of they traded their first to land Deshaun Watson, so it wasn't a great haul. Landing Winfrey was a nice pick and second-round corner Martin Emerson is a long player with coverage skills.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I like what the Cowboys did. I was higher on first-round pick Tyler Smith, the offensive lineman from Tulsa, than most. He will be a good player, likely at guard to start. I also liked Williams and third-round receiver Jalen Tolbert.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They traded away their first to get quarterback Russell Wilson, which makes this draft. He changes the dynamic of this team. Second-round edge Nik Bonitto is an explosive player who will liven up the defense.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They had an outstanding draft. Landing Aidan Hutchinson with the second pick gives them big-time edge player, and I love Williams. Second-round edge Josh Paschal gives them another player to pair with Hutchinson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They hit big with their first two picks in Walker and defensive tackle Devonte Wyatt. Most wanted at least one receiver there, but they held true to their board. They traded up to get Watson, but I think there were better options. I love fourth-round tackle Zach Tom.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I liked a lot of what they did. First-round corner Derek Stingley Jr. will be a shut-down player, while offensive lineman Kenyon Green is a nasty mauler who will help up front. I love Pitre and fourth-round running back Dameon Pierce.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Colts landed good players in Pierce and tight end Jelani Woods, but is third-round pick Bernhard Raimann ready to start at left tackle? He better be. Losing the first-round pick was a bad move.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Taking edge player Travon Walker with the first overall pick is a risk, but he's a good player. Can he be a great one? Landing center Luke Fortner in round three was a good move, but why take Muma when you didn't need him, unless Lloyd will be more of an edge on passing downs.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "First-round corner Trent McDuffie will be an immediate starter and Karlaftis will push for a job right away. Second-round receiver Skyy Moore and second-round safety Bryan Cook were good picks.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They didn't pick until the third round because of trades, one of them to land receiver Davante Adams. He's worth it. The draft brought some quality players I liked, such as Farrell Jr. and sixth-round guard Thayer Munford.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Getting Johnson to help up front was big. He will be a longtime starter. The rest of the draft was just OK for me. I do like sixth-round offensive lineman Jamaree Salyer.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Rams didn't pick until the third round because they traded away their picks to land veteran players, including quarterback Matt Stafford. With that philosophy, they have to hit on the later picks. So far they have. This draft includes some interesting players who can follow suit.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't pick until the third round because of trades, including to get Tyreek Hill. He was worth getting, so that helps this grade. And I love Tindall.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "New general manager Kwesi Adofo-Mensah moved up and down the board, but in the end was it really good maneuvering? They took Lewis Cine in the first round, a player I like, but I didn't love the rest of their draft, other than Asamoah.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Belichick walks to his own beat when it comes to drafting. Sometimes he wins — like when he got Tom Brady — but there have also been a fair share of losses. Strange seemed like a reach, but I love Thornton and third-round corner Marcus Jones. I didn't understand taking Bailey Zappe in the fourth.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They moved up in the first round to land receiver Chris Olave, a good player with speed that was needed. Penning will be a good player, and keep an eye on fifth-round linebacker D'Marco Jackson. He can run.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Landing Kayvon Thibodeaux, the best pure edge rusher in this class, and then Neal makes this a good class. But they also added a good receiver in Wan'Dale Robinson and a bunch of other players who will compete for spots.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Joe Douglas had two picks in the top 7 and nailed them, getting corner Sauce Gardner and receiver Garrett Wilson. Then adding Johnson and Breece Hall, the best back in this class, makes it a heck of a group.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "General manager Howie Roseman had a good weekend. He traded to get receiver receiver A.J. Brown and then took Davis in the first. Second-round center Cam Jurgens will take over as the starter when Jason Kelce retires. Counting Brown, it's a good haul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting Pickett will make this draft. There was talk they considered trading up, yet they still landed him. I like fourth-round receiver Calvin Austin, and we know the Steelers have had success with receivers getting taken in this area.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't have a first-round pick after trading to get Trey Lance last year. But they landed some solid players the rest of the way. Second-round edge rusher Drake Jackson had some talking first round before the draft. Lance better be good.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They picked two offensive tackles, including first-round pick Charles Cross, which they had to do. But taking a running back early is weird as they need to transition from a run-heavy offense. Second-round pass rusher Boye Mafe has talent, but he is raw.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They traded out of the first round to get extra picks, but still landed a solid group. Goedeke will compete at left guard and fellow second-round pick Logan Hall could be a starter at defensive tackle. Fourth-round tight end Cade Otton was a good pick.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They ended up picking a lot of good players, which Jon Robinson usually does. The positions are a little strange in that they took a bunch of corners in recent years and added some more.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The move to trade down and still land receiver Jahan Dotson was smart drafting. They needed a receiver who can help Wentz. Dotson will liven up the passing game. They added some other nice players, but Howell is the icing. Keep an eye on fifth-round tight end Cole Turner. It was a good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-2022-nfl-draft-grades-for-all-32-teams-ravens-earn-a-chiefs-and-jets-get-as-bears-get-worst-mark/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Jacksonville Jaguars went for potential over a sure thing. Time will tell if the risk was worth it, but this isn't a tea, that has time to gamble. Walker had six sacks in Georgia's national championship season. He also had 7.5 tackles for a loss.  Have to wonder if they could have traded back and still got Walker while adding more picks. And now, NFL Network reports Walker was in a car accident a couple of weeks ago, hitting parked cars. Sigh.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Travon Walker",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Lions wound up with the player many thought was going to go No. 1 for a long time leading up to the draft. Detroit wins by grabbing the 6-foot-6, 265-pound defensive force from Michigan. Hutchinson had 14 sacks and 16.5 tackles for loss in 2021. The Lions should send something to the Jags for dropping this gift in their lap.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Aidan Hutchinson",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Houston Texans pulled a surprise and grabbed LSU's Derek Stingley Jr. at No. 3. The chatter has been nonstop about 2019 being his best year. This is 2022, though, and what about his play in 2020 and 2021? Will he be the player he was in 2019 or did the Texans reach? \"Supreme athletic when he's healthy\" is a worrisome comment.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Derek Stingley Jr.",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Jets get a DB who doesn't allow touchdowns. That's a trait not many — if any — players in the Jets' secondary have possessed since Darrelle Revis in his prime. Jamal Adams wasn't around Gang Green long enough to earn that stamp. Three picks per year, including two pick-sixes in 2019.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Sauce Gardner",
        "grade": "A",
        "gradeNumeric": 4,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The explosive Oregon Duck comes to the New York Giants. That makes five defensive players in a row at the top of the draft. Big Blue had to be thrilled with all the critical comments about Thibodeaux's motor and mentality leading into the draft. A huge score at five.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kayvon Thibodeaux",
        "grade": "A",
        "gradeNumeric": 4,
        "text": null
      }
    ]
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Another player selected in-state, as the Lions did with Hutchinson. The Panthers take Ekwonu from N.C. State. He is strong on the run game but must improve in the passing game. Still, it feels like a win not rushing into a QB here because neither one is top-six quality. This does not preclude a move for a Baker Mayfield, Jimmy Garoppolo or another QB, either. As of this writing, the Panthers don't pick again until Round 4.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Ikem Ekwonu",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Giants didn't pick up Daniel Jones' fifth-year option but they did use their second first-round pick to grab Evan Neal from the Crimson Tide. He's 6-7 1/2 and comes from an incredible college program. Look for Neal at right tackle and Georgia's Andrew Thomas at left to give Jones his last best chance to succeed if the Giants stick with their former No. 1 pick at QB.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Evan Neal",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Drake London can thank Calvin Ridley's suspension for landing in Atlanta. A  team that once had Julio Jones and Ridley was in need of a wide receiver to go with Marcus Mariota. EDGE felt like a bigger need but London had 88 catches for 1,084 yards and 7 touchdowns in 2021 on a troubled team. The first USC WR to go in the first round since … Nelson Agholor. London did not play in more than 8 games in any of his seasons at USC.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Drake London",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The third tackle to go in the top nine is Charles Cross of Mississippi State. He's 6-5 and 290 and played in a pass-happy offense for the Bulldogs. Without Russell Wilson, expect the Seahawks to run the ball more. This would seem to be contrary to everything Cross did in college with Mike Leach and the Air Raid offense. The Seahawks need a lot. This doesn't feel like the player they needed.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Charles Cross",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The New York Jets add a wide receiver—and they weren't able to pry Deebo Samuel from San Francisco with this pick in a trade. They have Corey Davis and Elijah Moore at WR. They land the 6-0, 188-pound Wilson who was electric in 2021 with 70 catches and 12 touchdowns. Zach Wilson has no excuses for failing to improve in his second year with Gang Green.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Garrett Wilson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Ohio State wideouts go back-to-back after the Buckeyes had not had a first-round WR since 2007 (Ted Ginn, Jr, Dolphins, 9; Anthony Gonzalez, Colts, 32). Dennis Allen is a defensive guru but he knows New Orleans needs someone to go with Michael Thomas at WR. He gets Thomas, who missed all of 2021 with an ankle, another Buckeye, Olave, who had 65 catches.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Chris Olave",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Detroit moves up from 32 and takes a WR who left Ohio State for Alabama. Will Jared Goff throw the ball to the speedster? And what was the former Rams QB thinking when the Lions traded with their NFC North cohorts? A quarterback? Nah, a speedy wideout who had 79 catches for 1,572 yards and 15 touchdowns. Williams is recovering from a knee injury. The Lions hope it is a swift one.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jameson Williams",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Philadelphia Eagles looked to Georgia as another 'Dawg gets picked in the first round. They went big and they got a physical specimen at 6-6, 340 pounds. Philly wanted him bad and moved up while peeling away a few picks to Houston.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jordan Davis",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens don't mess around. They take the best available player and Kyle Hamilton was just that. Are you going to believe a 40-time dropped him to 14 or did they steal another jewel? Hamilton goes to a team that celebrates defensive and secondary players. Don't be surprised when this turns out to be one of the best selections of the entire 2022 NFL draft.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kyle Hamilton",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Texans dropped back, got more picks, and grabbed a 323-pound force from Texas A&M. He will stay in the state he played college ball and fill a big space and void for a team that has so many of them.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kenyon Green",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Commanders get another wideout to complement Terry McLaurin. Would they have been better off picking higher and grabbing an Ohio State pass-catcher? He had 91 of his 183 catches in 2021. Dotson had 12 of his 25 touchdown receptions last season. A one-year wonder of the real deal.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jahan Dotson",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Talk about moving up in the world, Zion Johnson goes from Davidson — you know, the basketball school that produced Steph Curry — to Boston College to be the 17th pick in the first round. His assignment will be protecting Justin Herbert. The Bolts have to hope everyone whiffed on him coming out of high school and he belonged in the ACC more than a small North Carolina school.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Zion Johnson",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "It seems like the fastest way to be moved is to be a wide receiver demanding a big contract. The Titans send A.J. Brown to Philadelphia and get this pick from the Eagles, who gave the wideout a four-year, $100M contract with $57M guaranteed. The Titans then replace the big, physical receiver from an SEC school in Brown to grab Burks, a 6-foot-3, 225-pounder who had 66 catches, including 11 touchdowns as an Arkansas Razorback. The overall move from Brown to Burks is a loss, at least for now.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Treylon Burks",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Saints pick up a \"big nasty\" who will step into left tackle—where Terron Armstead exited for Miami—t0 protect Jameis Winston. Once again, they go offense because Dennis Allen understands what needs are and didn't simply covet more defensive players because that is his forte. Have to like the mindset of the coach who steps in for Sean Payton.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Trevor Penning",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Steelers used to shy from Pitt quarterbacks (see Marino, Dan). But in 2022, they decided they think a Panther is their future, Kenny Pickett. He threw 42 touchdown passes against 7 picks and for 4,319 yards in his fifth season. However, that is more of an oddity than what went on in his first four seasons, going for 39 TDs and 25 picks. The Steelers have to hope Pickett wasn't a one-year college wonder with Pitt.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kenny Pickett",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "So the Chiefs trade up and grab a DB with the initials TM. Will Trent McDuffie of Washington be better than what Tyrann Mathieu would have been, or could the Chiefs have used both in their defensive backfield? The latter seems a better response than the former.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Trent McDuffie",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Wonder if Aaron Rodgers approved of picking a linebacker over a wide receiver? Walker played at Georgia on that brilliant defense and brings all sorts of strength and athleticism to Green Bay. The Packers will eventually get another wide receiver or two or three but reaching here would not have made sense to anyone.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Quay Walker",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bills will eventually have added a strong player to a position that is a strength when Tra'Davious White returns from injury. Kaiir Elam comes out of the SEC as did White (LSU) and figures to add to a secondary and defense that simply is tough to solve.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Kaiir Elam",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Cowboys need to start figuring out their offensive line and they took a step here. Smith had a medical condition years ago but overcame it and was found to be fine by NFL doctors. So, Dallas goes for the Tulsa tackle and has to hope he can step in and fill in the gap left by La'el Collins' exit— and age that is creeping up on the Cowboys' overall O-line.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Tyler Smith",
        "grade": "C",
        "gradeNumeric": 2,
        "text": null
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens get the best center in the draft and a guy who has strength, speed, and is ferocious. A guy who can do so many things at his size and is going to be an asset to Baltimore, whether for running backs or Lamar Jackson. Nice job by John Harbaugh & Co.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Tyler Linderbaum",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Jets move into the first round for a third pick and get Jermaine Johnson II from Florida State. NFL Network was chatting him up as a Top 10 pick and Gang Green slides in at 26 and grabs him. He had 11.5 sacks in 2021 for the Seminoles. What caused him to drop? Will this prove to be a steal or a problem? The Jets have to hope he is a gem who other teams simply missed.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Jermaine Johnson II",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The  Jaguars traded into the first round with in-state Sunshine Staters Tampa Bay and took Utah LB Devin Lloyd. The cost was the first pick in the second round on Friday and a couple of lower picks. Doug Pederson & Co. must love Lloyd, who can come off the edge and knows how to blitz. Put him together with Walker and the Jags are building something on defense, young and hungry.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Devin Lloyd",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Packers had two first-round picks and neither will be catching passes from Aaron Rodgers. One has to think Green Bay has some kind of plan, doesn't it? This pick is another piece of the outstanding Georgia defense. Oh, and it just so happens that both players picked by the Packers played for the national champions in 2021.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Devonte Wyatt",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Patriots traded back and took Cole Strange of UT-Chattanooga, now the highest-drafted Moccasin, surpassing T.O. Are you seriously going to argue with what Bill Belichick does and what strategy he employs?",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Cole Strange",
        "grade": "B",
        "gradeNumeric": 3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Chiefs stayed on the defensive side of the ball and went for the defensive lineman from Purdue, George Karlaftis. The power rusher from the edge will help Kansas City get stronger in the middle by keeping Chris Jones inside as much as possible. A former water polo star, Karlaftis should get plenty of opportunities to succeed swimmingly in Kansas City.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "George Karlaftis",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": null
      }
    ]
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Bengals went for a defensive player from the Big Ten after the Chiefs took one. Hill has improved during his time at Michigan and needs to continue to grow in the pros. He goes from a school in Michigan to playing for a team in Ohio. Pretty sure the transition will be smooth.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Dax Hill",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The big winner in the first round was the big loser, too. Kirby Smart has to be so proud of the way his defensive players were scooped Thursday. One Dawg defender after another heard their name called the final one was DB Lewis Cine. Another stellar spoke in the wheel of a historic defense. The Vikings make it so Georgia defenders were bookends in the first round of the 2022 NFL draft. Wow.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2022-nfl-draft-grades-32-041025781.html",
    "playerGrades": [
      {
        "playerName": "Lewis Cine",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": null
      }
    ]
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Cardinals flipped their first-round draft pick for Marquise Brown, reuniting him with former college teammate Kyler Murray. The price might have been steep, but it's easy to see Brown taking a jump in the Cardinals' offense in 2022. Murray has been PFF's second-highest graded passer on throws 20-plus yards downfield since entering the league in 2019 — a good sign for Hollywood in the vertical slot threat role vacated by Christian Kirk. Despite re-signing veteran tight ends Maxx Williams and Zach Ertz this offseason, the Cardinals add another to the mix in Colorado State's Trey McBride. At 6-foot-4, 246 pounds, McBride was PFF's No. 60 overall player in the class with above-average run-blocking prowess and downfield pass-catching ability. He has great ball skills and is easily the best tight end in the 2022 class. Thomas' pre-draft process was thrown for a loop when he tweaked a hamstring at the Senior Bowl. Nonetheless, his collegiate output at SDSU was enough to make him a top-100 prospect. Thomas turned in three straight years of 80.0-plus PFF grades. And he did that while playing both along the interior and on the edge. The 6-foot-4, 267-pound edge defender doesn't have ideal lower-body strength but is twitchy for his size. The pre-draft process was not kind to Sanders. His weight jumped up and down, and he didn't test anywhere near where his tape suggested despite showing up to the combine under 230 pounds. He recorded 10 total pressures in the College Football Playoff against Alabama. His weight needs to stay consistent if he's going to see the field in Arizona, but if he clears that bar, he could be a value pick for the Cardinals. Ranked the eighth-best interior offensive lineman and the 147th-best player on the PFF big board, Lecitus Smith is a steal for Arizona. He is a former tight end and has the movement to prove it. He allowed only 40 pressures across his four college seasons.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Falcons receiving corps badly needed an infusion of talent, and London should provide a nice boost. A lot has been made about his ability to separate because of how much of his production came in contested-catch situations (FBS-high 17 contested catches in 2021). But that's not all he brings to the table — he can create separation underneath, and he was productive after the catch for the Trojans. His 22 missed tackles forced after the catch last year — in just eight games before injury — is a top-five mark in this class. The Falcons ranked dead last in team pressure rate last season (21%). They needed to give Grady Jarrett some help along the defensive front, specifically off the edge. Ebiketie earned 88.0-plus PFF pass-rushing grades in each of his final two seasons at Penn State to go along with 80th-plus percentile finishes in every athletic testing drill, save the bench press. It's not hard to see why the Falcons would make the move up for him. Andersen can be a special player for Atlanta. He was recruited to Montana State to play linebacker but was forced to start at running back and quarterback his first and second years in college because he was the best option they had at both positions. He didn't play in 2020 because of COVID-19 and then finally got the opportunity to play off-ball linebacker full-time in 2021. He's a freaky athlete who is still learning the position, but he has as high a ceiling as any of the off-ball linebackers in the 2022 class. Ridder was seen as a fringe first-round quarterback, but the NFL evidently doesn't like this class. He is a steal at No. 74 overall. He has the best processing of any of this year's quarterbacks and boasts legitimate speed and athleticism with a solid arm. His accuracy is an issue (adjusted completion rate of just 72% for his career), but he has real starting potential on a team with no long-term starter in place. A massively experienced player with five seasons of college production under his belt, Malone can rush the passer and bring power to the table despite being undersized. He was impressive at the Senior Bowl and has added some bulk during the pre-draft process. He had 180 total pressures across five years in college, never grading lower than 74.8 overall. Allgeier has a very NFL-translatable game with his size and decisive running style. He averaged 4.4 yards after contact per attempt for his career at BYU and will bring his tough rushing style to Arthur Smith's downhill run scheme.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Ravens sat back and capitalized on value with Hamilton sliding to No. 14 overall. The Notre Dame product's disappointing 40-yard dash time (4.59 seconds) doesn't show up as a concern on his tape. He's coming off three consecutive seasons with PFF grades above 75.0, and he has the size and length (6-foot-4, 220 pounds) to line up anywhere and affect the offense in coverage. Baltimore arguably now has one of the best secondaries in the NFL, with Marlon Humphrey, Marcus Peters, Marcus Williams and Hamilton. Linderbaum is the best center prospect PFF has ever evaluated. He may be undersized, but he's an ultra-athlete who plays bigger than that size suggests. Linderbaum was a top-five-graded center in all three of his years as a starter there, including in 2021 when he broke the single-season PFF grading record for a center. The Iowa product's best landing spot was undoubtedly in a zone-heavy rushing offense, but that's not here. That makes this pairing with Baltimore — which runs a system predicated on a gap scheme — very interesting. Ojabo reunites with close friend and high school teammate Odafe Oweh and Michigan defensive coordinator Mike McDonald. The pass-rusher was once seen as a possible top-20 pick, but after a ruptured Achilles at his pro day, he slid to the middle of Round 2, where he became a great value. Ojabo is an extraordinary athlete who flashed top-tier talent this past season, producing multiple elite pass-rush game grades above 90.0. At the same time, his production was somewhat inconsistent, and his run defense is a big issue. He played just 560 snaps in college and has been playing football for less than five years. Nonetheless, while he's far from refined, he has a high ceiling with his tools. Travis Jones has first-round talent and lasted to the middle of the third round of the draft. Unfairly labeled as just a run-stuffing nose tackle, Jones wins as a pass-rusher as well, racking up 25 pressures last season. He played inferior competition to other high-end prospects, but when he did play Power-5 competition, he was dominant. Baltimore has a long history of succeeding with players of this body type. There are legitimate injury concerns with Armour-Davis, whose only full season as a starter came last year. Despite that, Armour-Davis found his way into the top 100 on PFF's Big Board as a speedy corner with good size who plays with patience on the outside. He earned an 81.5 PFF coverage grade in 2021 with Alabama, allowing a passer rating of just 52.3.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bills had a need at cornerback, and they got one who excels at the line of scrimmage in Elam. The Florida Gator put up an 89.8 PFF coverage grade as a true freshman in 2019 and followed that up with an 81.0 grade as a sophomore in 2020, dominating so much that opposing offenses largely avoided him in 2021. Elam was targeted three or fewer times in over half of his games this past year. However, penalties dragged down his PFF grade, which speaks volumes about how overly physical he can get. James Cook — Dalvin Cook's brother — is a scat-back type with great play speed. He earned an 85.0 PFF grade and totaled 728 rushing yards with Georgia in 2021. He's a great complementary piece to what the Bills already have in their backfield in Zack Moss and Devin Singletary. Bernard is fast and plays fast. At the same time, he's firmly undersized at 6-foot-1, 224 pounds and comes with serious tackling issues. Bernard owns a 14.8% missed tackle rate for his career and is teetering toward safety territory. He doesn't let the lack of size get in the way of his mindset, and he does have quality instincts and athleticism. Still, Bernard should have been a Day 3 pick. Shakir was a human highlight reel for the Boise State Broncos. His body control and hands are the stuff of legend. He likely profiles best from the slot after putting up over 1,000 yards there in 2021. The 102nd-ranked player on the PFF big board, Shakir adds depth and a high upside to the Bills' passing game.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The board couldn't have fallen much better for Carolina, with all three of the top offensive tackle prospects still on the board. The Panthers opted for the top run-blocker in the class in Ekwonu. The N.C. State tackle earned PFF run-blocking grades above 85.0 in all three of his college seasons, with grades above 90.0 in each of the last two years. It's worth noting that the Panthers didn't trade back to add another pick or two, given that they aren't on the clock again until the fourth round. Corral wouldn't have been a good pick in Round 1, but he provides value late on Day 2. Corral's offense at Ole Miss made his projection to the NFL a little more difficult, as it was full of RPOs and simplistic reads. Despite the quarterback-friendly offense, Corral was consistently on time and delivered accurate throws while showing off an exceptional deep ball. Corral's 2021 season took a nosedive midseason due to injury. His 91.1 PFF grade through Week 7 was the fourth-highest in the FBS, but that mark fell 20 grading points to 70.6 from Week 8 on. Smith is an athletic project, but he's a project well worth taking at this stage of the draft. The production profile isn't overly impressive. Smith earned PFF grades below 60.0 in each of the last two years at Penn State. But the NFL is always going to look for 6-foot-4, 250-pound linebackers who test above the 90th percentile in the 40-yard dash, broad jump and short shuttle. Now, the Panthers just need to figure out how to use him.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Bears' 2022 first-round pick was sent to the Giants as part of the Justin Fields trade last offseason. There were a couple of different ways the Bears could have gone with their first pick, but they again decided not to add an offensive lineman or wide receiver to support Justin Fields. Gordon does fill a need as a projected starter opposite Jaylon Johnson, though. His athletic testing was disappointing, but Gordon showcased impressive burst on tape at Washington. He earned a career-high 89.6 PFF coverage grade in 2021. This is fantastic value for Brisker, and the Bears' secondary looks promising after this pick along with Kyler Gordon at 39th overall. But again, this doesn't help Justin Fields, making this a good but not very good or elite pick despite the value. Brisker earned three straight 80.0-plus PFF grades from 2019 to 2021. He recorded a couple of interceptions and four pass breakups en route to an 89.5 coverage grade this season. He is a smart player who has a high floor at the next level. Velus Jones Jr. is one of the oldest prospects in the draft, and he didn't break out until his sixth season in college. Still, he possesses elite speed and showed real playmaking ability for the Vols in 2021. Jones generated 2.67 yards per route and a 131.0 passer rating on passes thrown his way. Braxton Jones put up dominant tape at Southern Utah en route to a 93.9 overall grade. He combines an egregiously long wingspan with some legit explosiveness off the line.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Hill brings athleticism, solid collegiate production and versatility to the table. While he didn't wear many hats in Michigan's defense and primarily covered the slot, he has the skill set to be versatile. And given Cincinnati's current roster construct, he's going to be playing a different role than he did as a Wolverine. Hill produced a top-10 coverage slot coverage grade among Power Five defensive backs from 2020 to 2021. Nebraska's Cam Taylor-Britt has improved his PFF grade every year of his collegiate career and allowed a reception on just 53% of his targets in 2021. He's got great closing speed and physicality with the versatility to play any position in the Bengals' secondary. Florida's Zachary Carter didn't even crack PFF's top-200 on the final draft board. He earned 80.0-plus PFF grades in only two games in his Florida career and finished the 2021 season with just a 78.1 PFF grade. He also didn't grade particularly well at the 2022 Reese's Senior Bowl. Volson is the 209th-ranked player on PFF's big board. He's not exactly a project with three straight seasons with a 79-plus PFF grade at North Dakota State, but Volson is an older prospect who has some physicality concerns. That's not going to get any better in the NFL.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Browns' first-round pick went to the Texans as part of the Deshaun Watson trade. Martin Emerson may prove to be a better player in the NFL than in college, where he was miscast in a system that didn't quite play to his strengths. He has elite length for the position and could make a real name for himself in press coverage, but he struggles in off coverage and in space. He snagged just one interception in his college career despite facing 130 targets. Alex Wright was one of the best-graded edge rushers in the nation in 2021, earning a 90.4 PFF grade at UAB after two solid years and a consistently improving pass-rushing grade. He had 51 pressures and some of the most dominant reps of any prospect. He has real size and power and has flown under the radar throughout the process. Bell is slow and fell down boards as a result, but he still was a super productive wideout in the B1G. He attacks the ball well and has great physicality at 6-foot-1, 212 pounds. He isn't a dynamic player by any means, but he does enough of the little things well to come in and produce early in Cleveland. Winfrey started his college career at Iowa Western Community College for two years before transferring to Oklahoma. He made an impact as a penetrator with an elite first step to get upfield. However, he was often miscast in Oklahoma's defense, playing 236 snaps at nose tackle despite being on the slimmer side. The former Sooner joins a team that has already selected an edge rusher and a cornerback in attempts to strengthen their defense.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Smith has been on a meteoric rise in recent months. Arguably the most violent offensive lineman at the Group of Five level, he led the nation in big-time run-blocks a season ago. His grip strength and power are a sight to see — once his hands get locked into the defender's pads, it's game over. The Tulsa product earned a 92.1 PFF grade that ranked fourth among FBS tackles in 2021. He was even better from Week 6 on, too, as he graded out at 94.2 over the back half of the season. Smith is going to have a steep learning curve to start, but he is young at just 21 years old. Ole Miss' Sam Williams has an insane get-off for an edge product who stands at 6-foot-4, 261 pounds. His 4.46-second 40-yard dash ranked 98th percentile among players at his position, but his play strength is massively lacking. He earned a career-high 78.1 PFF grade this past season but needs to develop counters in the NFL if he's going to consistently create pressure on the quarterback. While there are concerns with the competition level and being a one-trick pony, Tolbert is very good value late on Day 2. The 6-foot-2, 194-pound wide receiver was one of the top deep threats of 2021. He was responsible for 646 deep receiving yards this season, the fifth-most in the FBS. Tolbert was the go-to guy in South Alabama's offense, and he made the most of those opportunities by generating 3.16 yards per route run. His deep speed and ball skills will be a good addition to the Cowboys' receiving room. Waletzko's developmental traits are as good as you'll see in this tackle class. With a 7-foot-1 wingspan and nimble feet, he's the project NFL teams want and has the tape of an offensive lineman with solid upside. Waletzko graded above 70.0 in five of his nine games this past season.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Broncos' first-round pick was sent to the Seattle Seahawks as part of the Russell Wilson trade. Nik Bonitto is a phenomenal value for the Broncos. He was PFF's 38th-ranked player on the draft board and one of the most productive pass-rushers in the country. He earned a 92.5 PFF pass-rushing grade and a 27.3% pass-rushing win rate in 2021. He's a pure speed rusher that should immediately come to Denver as a designated pass-rusher on obvious passing downs. This is one of the best picks of Day 2. The Broncos traded away Noah Fant and needed to add a body to the tight end corps and Dulcich can fit that bill. He has excellent ball skills and shows real wide receiver chops in a tight end's body. He has excellent athleticism and a really good feel for finding space and getting open. He will contribute to this offense. Mathis, a top-100 player and the 13th-best corner in this class, was a big part of the Pitt Panthers' success last year. He snagged two interceptions, recorded four pass breakups and only allowed a 50.0% completion percentage on the way to a 68.0 defensive grade.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Lions gladly take the hometown Hutchinson falling into their laps. The Michigan product has been labeled as the \"high floor, lower ceiling\" prospect of the top group of edge defenders, but that may be underselling his upside. The only edge rushers drafted in the first round over the last five drafts with a higher overall PFF grade in college than Hutchinson are Chase Young, Nick Bosa and Myles Garrett. The high-end production and athleticism are both there in a versatile 6-foot-7, 268-pound frame. Detroit also made a massive move up the board for Williams, who is a game-changing talent when healthy. No one else in this class sniffs Williams' speed or movement skills. You don't need to look much further than what he was able to do to Georgia's defense to see the kind of impact that he can have. In 2021, Williams tied Ja'Marr Chase's 2019 record for the most 50-plus-yard receiving touchdowns since 2014. Williams teams up with second-year wideout Amon-Ra St. Brown to give the Lions two building blocks to work with at receiver. Detroit is beefing up the defensive front with Aidan Hutchinson in Round 1 and now Paschal in Round 2. The Kentucky Wildcat was quietly one of the highest-graded edge defenders in the country this past season with a 90.0 overall mark. Paschal is a strong, explosive player who can play on the interior and the edge. He may be a tad stiff and can get out of control from time to time, but this is good value for an all-around solid player. Joseph is still very much learning the safety position, but he has uncoachable ball skills and length. He's also such an easy mover and should get looks at split-field safety and in the box in Detroit. He just needs more experience at the position to really develop into a legitimate starter in the league. Mitchell was a hit as a sophomore in 2019 when he proved to be one of the best big-play tight ends in the country. He averaged 17.2 yards per reception that season. With Dalton Keene out of the picture in 2020, Mitchell started to be featured more while still maintaining a high 17.3 yards per reception average. With high hopes for his draft potential in 2021, Mitchell unfortunately went down with a torn ACL in Week 2 against Middle Tennessee State.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Walker slots in as the 45th-ranked overall player on PFF's big board and the LB4. The Georgia off-ball linebacker isn't a downhill player in the run game, and he was still more of a reactor than a playmaker. On the bright side, he does have an elite physical profile. Walker is so good at wrapping defenders up with his near 80-inch wingspan. He missed just seven tackles on 138 attempts in his college career. Many expected Green Bay to break its streak of not selecting a wide receiver in Round 1, but the team opted not to do so by grabbing PFF's top-ranked interior defensive lineman, Devonte Wyatt. No Power Five interior defensive lineman earned a higher PFF grade in 2021. Wyatt also earned a grade above 80.0 both as a run defender and a pass-rusher — something no other player at the position in the Power Five accomplished. The former Georgia Bulldog continued to dominate through the Senior Bowl, where he led the position in win rate during one-on-ones. The Packers made a big move up to add their wide receiver of choice at the top of the second round. Watson has all the physical tools of a No. 1 wide receiver at 6-foot-4 with 4.36-second speed in the 40-yard dash. However, there are concerns about Watson's play strength and lack of polish translating to the NFL on a team that needs an immediate contributor, especially with George Pickens and Skyy Moore both still on the board. Rhyan showed steady growth throughout his collegiate career, going from a 57.6 PFF grade in 2019 to 73.9 in 2020 before posting a 83.9 mark in 2021. Still, Rhyan is going to be a project at the next level. He is far from refined technically, but his natural athleticism, build and progression at UCLA make him a good bet late in Round 3. Wake Forest offensive lineman Zach Tom has a chance to end up being one of the best values. Many have projected Tom to kick inside in the NFL, but his mirroring ability and athleticism should allow him to stick at tackle if that's how Green Bay plans to use him. He's coming off a career-best 92.1 pass-blocking grade last season at Wake Forest.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Stingley's draft stock ended up coming full circle, with him coming off the board as a top-five pick and CB1 here for Houston. He was never able to build on a dominant true freshman season with LSU in 2019 when he allowed a 51.4 passer rating into his coverage with 21 combined pass breakups and interceptions. But that talent didn't go anywhere. Stingley brings rare movement skills and athleticism and can play in any scheme. He'll be a building block in Houston as Nick Caserio & Co. overhaul the roster. Green was a little bit of a reach based on the PFF big board (39th overall), but it's not difficult to see why the Texans would value him here. Green played every position except center for Texas A&M in 2021 and will probably slot in early at guard for Houston. Despite all that moving around, Green still earned PFF grades north of 75.0 in each of the last two seasons, and he should only continue to improve. Pitre doesn't have the cleanest positional projection to the NFL as a safety who played primarily in the slot at Baylor, but he's going to make Houston's defense better. Pitre can play some nickel, safety and dime linebacker for a defense that has needs across the board, and he's going to consistently find himself around the football in coverage and in the run game. Pitre's 92.7 PFF run-defense grade ranked first among all defensive backs in the FBS last season. Considering the Texans traded up for Metchie, who is coming off an ACL injury and has a questionable ceiling, this is a below-average pick for Houston. An injury of this magnitude is a concern for a player with questions about his full potential and physical profile. On a more positive note, the 5-foot-11, 187-pounder is a technician. He's a sound route-runner who consistently got open against stiff competition in the SEC. In fact, Metchie led the conference in targets against single coverage with a step or more of separation over the past two seasons. Christian Harris is a player with a lot of starting experience in college who never quite developed and improved the way he was expected to. Harris is an outstanding athlete but has never had a PFF coverage grade above 52.0 in a defense with NFL concepts and NFL-caliber coaching. He may have a limited role, but he can be useful in that role. The story for the Houston Texans in this draft was building the team from the ground up at every position. They continued to do so by adding Florida running back Dameon Pierce. Last season, the Gator earned a 92.0 PFF grade after amassing 574 yards on 100 attempts. Pierce will likely back up veteran Rex Burkhead and eventually take over the team's backfield.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Colts traded away their first-round pick as part of the Carson Wentz trade last offseason. A wide receiver like Skyy Moore, who was still on the board at Pick No. 53, might have been a better fit here, but Alec Pierce does still address a glaring hole at wide receiver. Pierce has some serious juice, but he may just be a vertical threat at the next level, at best. He's stiff, and his route tree at Cincinnati was very much limited. Over 66% of his yards coming from vertical routes in 2021. The NFL may have never seen an athlete at the tight end position like Jelani Woods, who was buried on an offense as a blocker for years before finally getting a chance to show what he could do in the passing game. His hands were suspect, dropping 10.7% of catchable targets in his college career, but he has a rare athletic profile. A clear first-round talent on PFF's Big Board, Bernhard Raimann slipped in the draft due to injury concerns, but he has outstanding athleticism and immediate starting ability. He began his career as a tight end but developed into an excellent tackle at Central Michigan. He allowed just one sack as a starting tackle and gives the Colts a starting tackle in the third round. Cross is a phenomenal value for the Colts at No. 96. He's a former four-star recruit with some of the best range of any safety prospect in this class. He isn't as instinctual as you'd like him to be, but he can fly sideline to sideline in the deep safety role. He's a project player, but the Colts' coaching staff will get an impact starter if they can effectively develop him early on. Eric Johnson's production profile is a bit concerning knowing that he played against FCS competition at Missouri State and never earned a single-season grade above 80.0. However, he is a legit run defender at 6-foot-5, 298 pounds and posted PFF run-defense grades and run-stop rates above the 75th percentile in 2021.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Trent Baalke gets his guy. The Jaguars are banking on Travon Walker's elite traits in a class without a clear-cut No. 1 talent at the top of the board. There are schematic reasons why Walker didn't post gaudy numbers at Georgia, but there are still plenty of risks involved with taking a player at No. 1 overall who never cleared a 75.0 PFF grade or 10% pressure rate in three seasons with the Bulldogs. Jacksonville takes advantage of a big prospect slide by trading up to No. 27 for Devin Lloyd, who slotted in at No. 15 overall on PFF's big board and was the favorite to be the first off-ball linebacker drafted. There are few bones to pick with Lloyd's game as a prospect. He's explosive and intuitive and boasts the frame and physicality the NFL is looking for. Lloyd was one of only four college players at the position who earned a 90.0-plus PFF grade in 2021. He graded above 80.0 against the run, in coverage and as a blitzer. A powerful offensive lineman, Luke Fortner improved upon his PFF grades each season of his career but still topped out at No. 105 on the PFF big board. He isn't great at getting to the second level, either in locating linebackers or disengaging from combination blocks at the defensive line. He fits a real area of need for Jacksonville. This pick is questionable in terms of need, but Chad Muma is good value at this point in the draft, and there's real merit in that approach. Muma is a prototypical weakside linebacker who can run and chase to the football. He is coming off a 90.0-plus PFF grade in 2021 and gave up only one touchdown into his coverage in his time at Wyoming. The 242nd-ranked prospect on PFF's big board, Connor earned a 73.0-plus rushing grade in three of his college seasons, earning a career-high 76.4 grade in his junior season.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2022,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "While it required a trade-up, Trent McDuffie is a great addition for the Chiefs at No. 21 overall. McDuffie was the 11th-ranked player overall on PFF's big board and had one of the best careers PFF College has ever seen. He turned in an 80.0-plus grade as a true freshman, sophomore and junior, something just one other Power Five corner has accomplished in the PFF College era. He may be small, but he possesses elite awareness and top-notch athleticism and is a physical tackler. McDuffie has all the traits to be a versatile chess piece for Kansas City. Karlaftis' slide ends with the Chiefs at 30th overall, making him the biggest steal of Round 1. He turned in a 90.6 pass-rush grade as one of the few game-wreckers in college football last season. Also known as the college football Greek Freak, the 6-foot-4, 266-pounder boasts some of the best hand usage in the class and plays with big-time power and an impressive get-off. Karlaftis posted the fourth-best win rate in the Power Five on true pass rushes this past season despite being consistently chipped, doubled and cut. Skyy Moore was a first-round prospect in PFF's eyes, once again giving the Chiefs one of the biggest steals of the NFL draft. The highest-graded wide receiver of the 2021 college football season wasn't any of the Power Five top prospects — it was Western Michigan's Skyy Moore. The 5-foot-10, 195-pound receiver's 26 broken tackles after the catch tied for the most among wide receivers in 2021, and he ranked in the 95th percentile in separation percentage. Despite his smaller stature, Moore had no issue handling press coverage on the outside, ranking top-five in yards per route run on those reps last season at 3.58. The cherry on top is his strong hands — the Western Michigan pass-catcher checked in with the largest hands of anyone at the Combine (10.25 inches) and dropped just three of his 125 targets in 2021 while catching eight of his 13 contested opportunities. Bryan Cook is a physical tackler who could be an impact player in the NFL if he can stay healthy. Cincinnati head coach Luke Fickell said he ran a 4.45-second 40-yard dash in the winter, but injuries that he played through during the season kept him from testing in the pre-draft process. His best role in Kansas City will be around the line of scrimmage at box safety. Kansas City gets an absolute steal here with Leo Chenal in the third round. Chenal packs a punch as a downhill player, as he can light up offensive linemen with ease. His 94.1 run-defense grade wasn't too far behind Micah Parsons' (94.8) PFF college record. He finished the pre-draft process as PFF's No. 36 overall player. Darian Kinnard is one of the most accomplished run-blockers at the tackle position in college football. Even though he may end up at guard, he earned 89.0-plus run-blocking grades over the past three seasons.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Raiders had no first-round pick after trading for Davante Adams earlier in the offseason. Dylan Parham has been working on adding more to his frame, which was his biggest criticism in the pre-draft process. That's still going to be something to monitor as he makes the jump to the NFL, but his athleticism and footwork help make up for it. Parham earned a 90.6 PFF grade in 2020 at tackle before kicking inside in 2021 and posting a 78.8 mark. The latter is where he will be pigeonholed in the NFL. Matthew Butler was a bit of a late bloomer in his five seasons with the Volunteers. It took until his redshirt sophomore year to lock down a rotational role, his redshirt junior year to lock down a starting role and his redshirt senior year before he started to really make an impact. While averaging 55.8 snaps per game, Butler still managed to grade out well above average as both a run-defender and pass-rusher last fall. He was a havoc-creating 3-technique in Tennessee's defense and was often deployed on postsnap slants to try to take advantage of his athleticism.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Zion Johnson is a quality pick for the Chargers, and should slot in at right guard and move 2021 starter Matt Feiler to right tackle (where he ranked fifth in pass-block grade in 2019). As PFF lead draft analyst Mike Renner highlighted in the 2022 PFF Draft Guide, there are a few cons to his game, but he's a polished and stout performer with standout production. Johnson earned an 80.0-plus grade as both a pass-blocker and a run-blocker last season, recording just one penalty en route to an honorable mention PFF All-American nod. He then lit up the Senior Bowl, not losing a single pass-blocking rep during that week. In four seasons at Baylor, JT Woods never earned a PFF grade above 67.0. This past year was his best season and played to his strengths more, allowing him to showcase his speed and playmaking ability. He had six picks and three pass breakups but finished his college career with a missed tackle rate over 20%. Otito Ogbonnia was a promising rotational defensive tackle for three seasons before finally becoming a starter as a senior this past fall. It was in 2021 that Ogbonnia finally started to make a difference as a pass-rusher. That continued at the Senior Bowl, where his length played routinely in the one-on-ones. Still, he was regularly too high in the run game and had a rough week of practices in that regard.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Logan Bruss has played over 1,400 career snaps at right tackle and 352 career snaps at right guard, but he projects best as a guard in the NFL. His PFF grade has improved every year of his career and earned an impressive 82.8 PFF run-blocking grade in 2021. After barely playing as a true freshman in 2019, Kyren Williams has been the focal point of the offense the past two seasons. Not only in the running game but as a receiver, as well. Williams' 77 receptions the past two years were the second-most among Notre Dame receivers. He did all that despite checking in under 200 pounds. The one red flag on his production profile is his eight fumbles over that span.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Miami had no first-round pick after trading with Kansas City for receiver Tyreek Hill. Miami's first pick in the draft came in the third round at No. 102 where they drafted linebacker Channing Tindall. He isn't nearly as instinctual as his teammate Nakobe Dean, but man can the kid fly sideline to sideline. Blitz him consistently and never ask him to turn his back to the line of scrimmage, and Tindall is going to produce. This is a great fit in Miami. Erik Ezukanma brings some size (6-foot-2, 209 pounds) to the outside, which Miami needed after dealing DeVante Parker. He put up over 600 receiving yards in each of the past three seasons at Texas A&M and averaged over 15.0 yards per reception over the course of his college career. Miami continues to add talent for Tua Tagovailoa to work with on offense.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Minnesota Vikings traded all the way back from No. 12 to No. 32 in the first round, picking up No. 34 (2nd) and No. 66 (3rd) in the process and sending No. 46 (2nd) the other way. After trading back, the Vikings land PFF's No. 2 safety and 26th-best prospect overall, Lewis Cine, at No. 32. The Georgia Bulldog — like most players on the team — is an elite athlete. He posted a 4.37-second 40-yard dash and an 11-foot-1 broad jump at the NFL Scouting Combine. He was one of the best safeties in college football last year, turning in an 82.4 PFF grade that ranked eighth in the Power Five. Cine was also one of the best tacklers in the country at Georgia, with just 11 misses on 159 career attempts. He was primarily a deep safety in college, but he can fill a more versatile role in Minnesota. The Vikings were trading back in the second round as well, first trading back from No. 34 before trading up to No. 42 to select Andrew Booth Jr., the cornerback from Clemson. Booth projects as a scheme-versatile starter on the outside with some of the best feet in the class. Medical concerns pushed him into Day 2, but he's a first-round talent. Patrick Peterson, who is playing on another one-year deal, is a short-term solution for the Vikings, who need to continue to add competition at the position. Ed Ingram started as a true freshman in 2017 as a four-star recruit coming out of DeSoto, Texas, but he missed all of 2018 after he was charged with two counts of aggravated sexual assault. The charges were eventually dropped, and he went on to play over 400 offensive snaps in all three seasons following (2019-21). He never earned a PFF grade above 75.0 in his career due in large part to lackluster pass protection, but he's a people-mover in the run game. He's a project in the passing game but a Day 1 impact player as a run-blocker. Few linebackers have the same range and potential in coverage as Brian Asamoah. At the Senior Bowl in drills set up for losses on the defensive side, Asamoah was able to cover backs and tight ends well. The Vikings have a need alongside Eric Kendricks, and Asamoah has the capacity to complement him very well. Ty Chandler spent his first four seasons at Tennessee in a timeshare role every single year. Despite seeing the bulk of the carries his last few years there, Chandler grad-transferred to North Carolina this past fall to see an expanded role. He set career highs in every category imaginable for the Tar Heels. Known for his speed, Chandler more than doubled his previous career-high for explosive runs.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2022,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "Cole Strange is the biggest reach of Round 1, as the Chattanooga Moc was 86th on PFF's big board. His anchor and footwork are suspect, making it highly unlikely he slots in as a major contributor early on. On a positive note, Strange is a versatile and elite athlete who excels in space. The 6-foot-5, 307-pounder ranked above the 89th percentile at the position historically at the combine in the 40-yard dash (5.03 second), broad jump (120-inches), three-cone drill (7.44 seconds) and pro agility (4.5 seconds). Before blowing up the event in Indianapolis, Strange impressed many across the league by spending almost all of the Senior Bowl at center despite not playing a single down at the position for Chattanooga. After the Saints reached for their pick at 49th overall, the Patriots topped them by taking Tyquan Thornton — the 192nd ranked player on the PFF big board. Everyone knows that he brings deep speed to the table after clocking a 4.28-second 40-yard at the NFL scouting combine. While those wheels are a huge plus, his play strength at the next level is cause for concern. Thornton isn't much of an after-the-catch threat, as evidenced by averaging 3.9 yards after the catch and breaking just 11 tackles on 143 career receptions. Marcus Jones has extremely concerning size at 5-foot-8, 177-pounds, and that pushed him down this far in the draft, but at No. 85 overall for New England, Jones provides immense value. He is a fluid athlete who is, at a minimum, going to be a quality return specialist, as he was the highest-graded kick returner in the country last season. He's not going to be playing outside corner as he has for Houston the last three years, but he can contribute in the slot due to his physical mindset and quickness, and maybe even play snaps on offense. It's interesting that Bailey Zappe comes off the board here before Sam Howell, but it's still good value for a quarterback who put up gaudy numbers last season at Western Kentucky. Zappe projects as an ideal backup for Mac Jones in New England after earning a 95.8 PFF grade in 2021.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "After trading to get a second first-round pick this season, the Saints jumped up just a little more to make sure they got their guy. The fit here is seamless, with Chris Olave stepping into the vertical-threat role in New Orleans' offense as the WR2 opposite Michael Thomas. Olave recorded 12 touchdowns on passes thrown 20-plus yards downfield over the last two seasons at Ohio State, fourth in the FBS. It's just a lot easier to get behind the value here at one of the Saints' original pick selections rather than by executing a trade that they lose 61% of the time, per PFF data scientist Timo Riske. Going from Terron Armstead, an absolute technician at left tackle, to Trevor Penning, who is very much raw, is a major downgrade for New Orleans. The Northern Iowa product is a high-level athlete at 6-foot-7 and 325 pounds, and he plays with a killer mindset — so much so that he might need to tone it down a bit. While he did rack up 33 big-time blocks against lesser competition in 2021, he also drew 16 penalties. Along with that, Penning's pass protection needs to be completely reworked, and he has to do better at playing low. Those significant issues may have him facing a steeper-than-expected learning curve in the NFL. This is going to be in the conversation for the biggest reach in the 2022 NFL Draft, according to the PFF big board. Alontae Taylor is fresh off a breakout campaign for the Volunteers in 2021, earning an 83.1 PFF grade after producing a sub-65.0 mark for three straight seasons. While fast and physical, the lack of instincts, playmaking and quality change-of-direction ability are major concerns when projecting him to the NFL level. Jackson first saw real playing time as a redshirt sophomore in 2019, making a name for himself as a run defender for the Mountaineers. He didn't earn his full-time role, however, until 2020 when he showed out as an all-around linebacker with two picks and six pass breakups. The coaching staff must have liked what they saw from him as a blitzer that season because he got deployed in that role more times in 2021 than he had in his entire collegiate career and racked up five sacks, 11 hits and 11 hurries.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2022,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "It was always going to be a surprise if Kayvon Thibodeaux fell much further than this, even with \"concerns\" about his fit and reports that different teams had pushed him down their boards over recent months. There was just too much talent there. The Oregon product recorded over 30 pressures as a true freshman in 2019, and he's coming off a career-high 91.5 PFF pass-rushing grade last season. He fits the mold of the impact pass-rusher New York desperately needed off the edge. The Giants' decision to draft Thibodeaux at No. 5 signals that they were comfortable with multiple tackles at this spot. Evan Neal is the cleanest fit as the player who spent time at right tackle in 2020 with Alabama. The 6-foot-8, 337-pound tackle is one of the best pound-for-pound athletes in this class and is coming off back-to-back seasons with PFF grades north of 83.0. There's a lot to be excited about with the Andrew Thomas-Neal tandem at tackle. This is the biggest reach of the draft so far per the PFF Big Board, which had Wan'Dale Robinson at 125th overall. It's tough to see Robinson being much more than a gadget player who will need to be schemed touches given his 5-foot-8, 179-pound frame with sub-28-inch arms. Robinson wasn't an elite athletic tester at that size, either. His skill set overlaps with Kadarius Toney's, which could indicate that the Toney trade rumors last week weren't entirely smoke. It may be a reach according to the PFF big board, but Joshua Ezeudu has the potential and traits to become a starting NFL offensive lineman. And the Giants still need to find some of those types of players despite limited opportunities to get it done. 2021 was his best season and his first truly above-average year despite three years of starting. Cordale Flott has an unusual size profile for a player who might need to find his role at the next level, but he has the traits to be an outside corner and contribute to this defense if he can take on that sort of responsibility. Flott had his best season in 2021, earning a PFF coverage grade of 84.8 and allowing 51.1% of passes thrown his way to be caught. McFadden played 121 snaps as a true freshman before taking over as a full-time starting linebacker as a sophomore in 2019. He earned an 81.9 pass-rushing grade that season and has only seen it go up in the two subsequent years. In 2021, his 92.0 pass-rushing grade led the entire country in the off-ball linebacker position.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "A lot of the talk in the pre-draft process was that the Jets would target an edge defender or offensive tackle in this spot. Instead, they opted for the cornerback who didn't allow a single touchdown in his college career. Ahmad 'Sauce' Gardner is a strong fit in Robert Saleh's defense, and it's hard to poke holes in his profile from size to athleticism to college production. Gardner allowed just 43% of the passes thrown into his coverage to be completed across his three seasons with the Bearcats. The Jets continue to add talent around second-year quarterback Zach Wilson with a 6-foot, 184-pound wide receiver who wins in space before and after the catch. Garrett Wilson averaged over 3.0 yards per route run in each of the last two seasons at Ohio State. He rounds out a receiving corps that has added Corey Davis, Elijah Moore, C.J. Uzomah and Tyler Conklin in the last two offseasons. There were murmurs that the Jets were thinking of selecting Jermaine Johnson with their No. 4 overall pick, yet they managed to land him at No. 26 after moving up in a trade with Tennessee. The Florida State product, who also played at Georgia and the JUCO level, was one of the biggest winners at the Senior Bowl, impressing scouts so much that he opted out of the final day of practice and the game itself. The 6-foot-4, 259-pounder has over 34-inch arms and the tools to put them into action. He produced multiple pressures in every game he played for Florida State last season and ended the campaign with an 81.0 PFF grade. The Jets were clearly worried that Houston had its sights set on a running back at Pick No. 37, jumping the Texans to land their RB1. Breece Hall has outstanding contact balance, can produce as a receiver and tested extremely well athletically at the combine. This is a bit early to take a running back, particularly following a trade-up, but there's not much to dislike about Hall's profile as a prospect. The Jets now have a 1-2 punch at running back with Hall and Michael Carter. Jeremy Ruckert is arguably the best blocking tight end in the draft class and has uber-reliable ball skills. He dropped only two passes on 56 catchable targets in his college career. He complements what the Jets already have in C.J.Uzomah and Tyler Conklin really well. After drafting several skill players earlier this draft, the Jets finally decided to help out quarterback Zach Wilson from a protection standpoint. Max Mitchell entered the draft as the 88th overall player on PFF's big board and the 13th best tackle. Last season, he earned a very impressive 94.8 PFF grade.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2022,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Eagles came into the draft with multiple first-round picks and used one of them on a veteran player, trading with Tennessee for superstar wide receiver A.J. Brown and giving him the contract extension the Titans wouldn't. Their other pick was spent on monster defensive tackle Jordan Davis. There have been concerns about Davis' ability to play a high volume of snaps, but there are so many things to love about what the 341-pounder can bring to Philadelphia's defense. He can single-handedly change the way a defense operates against the run, allowing the Eagles to devote more resources to coverage and creating more third-and-long situations. And Davis' rare athleticism at his size points to the idea that he's not just an early-down run-stuffer. He represents the future at the position, with Fletcher Cox trending in the wrong direction the past few years. Cam Jurgens is a prospect that PFF is lower on than the consensus, as he was barely a top-100 player on the big board. The Nebraska Cornhusker is an uber-athlete, but he has to do a much better job playing with better balance. Jurgens was a poor performer during his first two years at the position in 2019 and 2020 with 44.1 and 42.7 PFF grades, but he showed some modest growth in 2021 with a 71.4 overall mark. Still, there's a long road ahead to refinement for the center, but the Eagles are in a position to get him there. Nakobe Dean was the best player on the best defense college football has ever seen. He slid in the draft largely because of injuries, but even if he has to redshirt an entire season, Dean will be a steal at this spot in the draft. Few linebackers have ever had the kind of play recognition that Dean possesses, and his tape is full of elite playmaking. This is one of the steals of the draft. An above-average athlete, Kryon Johnson will likely make his mark on special teams as he fights for a roster spot in Philadelphia. A four-year starter with the Kansas Jayhawks, Johnson produced at a number of different positions and should provide some depth and versatility for the Eagles.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Landing a quarterback without having to trade up is a big win for Pittsburgh, but taking Kenny Pickett is not. He was the No. 4-ranked quarterback on PFF's 2022 big board. There's some serious concern with how his game translates to the NFL. The Pittsburgh product averaged 3.19 seconds per throw in 2021, tying for the third-lowest mark in the FBS. In fact, it would have been the slowest among NFL quarterbacks this past season. While Pickett is a quality athlete, he's nowhere near dynamic enough to make hay on the ground in the professional ranks. Holding onto the ball often welcomes pressure, and Pickett was charged with 34 pressures this past season, tying for the second-most in the FBS. He has to be quicker and more decisive with his decision-making. And speeding up a quarterback's processing is easier said than done — it's a significant issue. George Pickens carries some risk given his medical history and unknowns off the field, but there's no denying he possesses true \"X\" receiver potential. He's physical with a massive catch radius, elite ball skills and good acceleration. Pickens earned an incredible 88.0 receiving grade as a true freshman before injuries derailed the last couple of years. Before his final season, DeMarvin Leal was seen as a high first-round prospect. He regressed in his final season and is a little bit stuck between positions, but there is real talent there — and at this point in the draft the risk is well worth taking. Leal had an 88.3 PFF grade in 2020 and goes to a team with the right environment to find his best play. Calvin Austin's size is going to be a limiting factor in the NFL — there's no way around that. Nonetheless, this still looks like good value for a dynamic playmaker like Austin. He's an explosive athlete who can be used in a movable gadget role in Matt Canada's offense. Kenny Pickett, George Pickens and Austin all add some much-needed talent on offense for the Steelers in this draft.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The 49ers didn't have a Day 1 pick after trading up for quarterback Trey Lance a year ago. Drake Jackson is a phenomenal value at No. 61 overall for San Francisco. He uses his hands really well and has great bend for the position. Even though he's 6-foot-3, 273 pounds, Jackson is much more of a finesse rusher who lacks any sort of power move. If he develops some counters to his speed rushes, he can be a fantastic pass-rusher for the 49ers. Tyrion Davis-Price is average, and that's reflected in just how few of PFF's users like this pick for San Francisco. He rushed for over 1,000 yards across 500-plus offensive snaps with LSU in 2021, but he averaged fewer than three yards per carry after contact and broke just 37 tackles on 211 carries. He's not overly elusive or explosive. His 30-inch vertical ranked in the seventh percentile among running backs. We are not fans of this pick for the 49ers. Danny Gray's hands are awful, but everything else about him is pretty fantastic. He's a legit separator with deep speed (4.33-second 40-yard dash). San Francisco knows what they're doing when evaluating the wide receiver position. This is one of the best picks of Round 3. Spencer Burford is a bit undersized at 6-foot-4 and 304 pounds, but his nearly 35-inch arms help in that regard. Burford started the first two seasons of his college career at left guard before kicking out to left tackle. His grading profile at UTSA leaves something to be desired, but Burford is coming off a career-high 76.8 PFF grade in 2021. He fills a need for the 49ers, who needed to add some depth upfront.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2022,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Seattle snags PFF's OT1 and the last of the top tier of offensive tackles available without trading up. Charles Cross has been billed as the top pass-protector in the class, and his 84.7 PFF pass-blocking grade in a pass-happy Mississippi State offense last year backs that up. He's no slouch in the run game, either. Cross earned positive grades in the run game at a top-four rate and played in several different offensive schemes during his career at Mississippi State. He fills a clear area of need for the Seahawks with Duane Brown and Brandon Shell both hitting free agency. From a measurables standpoint, Boye Mafe is near the top of a loaded edge defender class. The 6-foot-4, 261-pound edge rusher out of Minnesota ran a 4.53-second 40-yard dash (96th percentile) and a 42-inch vertical jump (99th percentile). He's an explosive athlete who can have success getting after the quarterback from wide alignments. That shows up in PFF pass-rushing grades above 80.0 in three of his four college seasons. Kenneth Walker is one of the best pure runners to come out of college football in the past five years. Last season, Walker was one of two FBS running backs since 2017 to average over 4.0 rushing yards after contact per attempt and 0.3 missed tackles forced per carry on 250-plus carries; the other was his new teammate Rashaad Penny in 2017. The biggest hole to pick in his game is a lack of production as a receiver, but a lot of that can be pinned on how Michigan State's offense operated. This is still an interesting fit on a roster that just re-signed Penny to play alongside Chris Carson. There is still some work to do with Abraham Lucas, given the offense he played in at Washington State, but he is one of the most athletic tackles in the draft and has some real pass-blocking traits to fall in love with. He posted a 91.0 PFF pass-blocking grade in 2021, and even after adjusting for true pass sets, it falls only to 86.0. This is a classic pick with upside. There aren't many 6-foot-4, 205-pound cornerbacks in the first place, and there are precisely zero others with a 4.26-second 40-yard dash time. Tariq Woolen has been playing cornerback for only two years and already made massive strides. He's a high-upside cornerback prospect who earned a 65.3 coverage grade last season.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2022,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Tampa Bay traded out of the first round, moving back from No. 27 to No. 33 and adding No. 106 (4th) and No. 180 (6th) to do so. The 72nd-ranked player on PFF's Big Board, Logan Hall is a bit of a reach in our eyes for a player who projects as a pass-rushing project. The fit in Tampa Bay makes a lot of sense, though. Hall can line up as a 3-5 technique in Todd Bowles' defense and use his length to create problems for interior offensive linemen as another piece to put in place alongside Vita Vea. A former tight end who ate 7,000 calories per day to add enough weight to play tackle at Central Michigan, Luke Goedeke is wholesale trending in the right direction as a prospect. He earned a 92.2 PFF grade playing right tackle for the Chips in 2021 and allowed zero sacks. He's a plug-and-play starter at guard for a Bucs team that lost Ali Marpet to retirement this offseason. It's luxury pick time for the well-rounded Buccaneers, and they pick an excellent receiving back in Rachaad White, who turned in the third-best receiving grade among FBS backs in 2021. White's rushing ability is a work in progress, though. Heck, he could even be a wide receiver convert at the next level, just get White the ball in space and watch him go to work. Zyon McCollum is one of the handful of five-year starters in this draft class. He was Sam Houston State's best cornerback since his true freshman year in 2017. Unfortunately, we only have his past two seasons graded, but in those he was stingy as the Bearcats' boundary corner. The worry is, given the competition level, he wasn't that stingy. He allowed 661 yards on 60 catches from 108 targets the past two seasons. In his opportunity to go against top competition at the Senior Bowl, McCollum earned the third-lowest grade of any cornerback in attendance.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2022,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Tennessee executed the blockbuster of the night by trading wide receiver A.J. Brown to the Philadelphia Eagles for the No. 18 and No. 101 picks. And to replace the star pass-catcher, Tennessee drafts Arkansas' Treylon Burks. The 6-foot-2, 225-pound wide receiver will offer value vertically and with schemed touches underneath because of his size-speed combo. Burks averaged 8.6 yards after the catch per reception and broke 24 tackles on 115 receptions across the past two seasons. Still, his overall route-running leaves a lot to be desired. He projects as a big slot and has a major hill to climb to get to the level Brown was at for Tennessee. Roger McCreary has an interesting profile as a player with impressive press-man coverage tape but 29.5-inch arms — a 6th percentile mark at the position. McCreary had 15 combined pass breakups and interceptions this past season at Auburn. The production has been there each of the past three years. Now, it's just a question of whether he can stick on the outside given his lack of length. A player that's lower on PFF's big board than the consensus draft board, Nicholas Petit-Frere has NFL-caliber traits, but he was lit up when he played against elite competition, such as No. 2 overall pick Aidan Hutchinson. The Titans have needs along the offensive line, and this is a gamble that they can coach Petit-Frere to reach his full potential. Malik Willis may have his fair share of concerns, but late in Round 3, he provides insane value. His physical tools are off the charts, and they helped him to an FBS-leading big-time throw rate and rushing grade in 2021. The Liberty quarterback was never going to be an immediate contributor considering how raw of a passer he is — the mechanics, pocket presence and decision making are all major concerns. Landing in Tennessee will give him a chance to sit and develop. Chigoziem Okonwko checks all the athletic boxes with a 4.52-second 40-yard dash and 36-inch vertical jump. He broke 14 tackles on 76 catches in his college career.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2022,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Washington selected Jahan Dotson as the fifth wide receiver taken in the first round, representing one of the biggest reaches on Day 1. Dotson was No. 56 on PFF's Big Board but he did have his fans. He has some of the best hands in the draft, dropping just 5.2% of catchable targets in his college career. The success of this pick will be determined by how successful he can be on the outside and not just the slot at the next level. Few people like anything as much as Washington seems to like Alabama defensive linemen, and they added another one in the second round with Phidarian Mathis. It was their second straight major reach according to PFF's Big Board, selecting Mathis around 50 spots higher than his ranking. As you would expect coming from Alabama, Mathis is long, strong and violent in his play but he isn't tremendously explosive which calls his ceiling into question. He does have a high floor considering his NFL-ready technique but just don't expect game-wrecking ability, as evidenced by his solid 78.5 PFF grade in 2021. Brian Robinson was the 146th-ranked player on PFF's draft board but still offers a skill set Washington doesn't have a whole lot of in their backfield: physicality. He can be an immediate impact player as a short-yardage back behind starter Antonio Gibson. Sam Howell's slide finally ends at Pick 144. He may have taken a step back as a passer in 2021, but he proved to be a legitimate threat as a runner, breaking an absurd 63 tackles and running for 1,072 yards. The 34th-ranked player on PFF's big board, Howell will push Carson Wentz in the nation's capital and will likely get starting reps.",
    "sourceName": "PFF",
    "sourceUrl": "https://www.pff.com/news/draft-2022-nfl-draft-grades",
    "playerGrades": []
  }
]