[
  {
    "teamName": "Arizona Cardinals",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Overall, the Cardinals did a tremendous job of generating early trade value, getting Murray some help and not ignoring one of the worst defenses in the league.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Robinson was a pure luxury pick, which brings down the Falcons' grade a bit. However, if the Falcons' plan is to have an explosive offense while getting better on defense and seeing if Ridder can be the long-term answer at quarterback, they had a sound draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Overall, the Ravens did a great job of reloading their defense while getting another dynamic target for Jackson. While Baltimore didn't have a ton of early draft capital—it used its second-round pick to acquire Smith ahead of last year's trade deadline—it was a pretty good weekend to be a Ravens fan, particularly with the Jackson saga finally resolved.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Bills did well to grab a receiving weapon and an interior lineman early. However, they still don't have a reliable third receiver, and they failed to address a pass rush that sagged following after Von Miller tore his ACL in November.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Credit the Panthers for making the bold move to trade up and get their quarterback and still coming away with a potential starting-caliber receiver and rotational edge-rusher. However, this wasn't a big draft class, and everything rests on Young's ability to become a good early starter. Because of the significant cost to get the No. 1 pick, the grade here isn't exceedingly high. That won't matter if Young proves to be Carolina's quarterback of the future, though.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "While the Bears might have reached for a few of their middle-round targets, they had a clear plan for improving their defense, grabbing a key supporting player for Fields and turning the No. 1 pick into valuable pieces for their ongoing rebuild.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Overall, the Bengals did a great job of adding value and addressing needs early while finding valuable depth late. They could have used more offensive line depth, though, and the decision not to take a top tight end early means Cincinnati will bet heavily on the inconsistent and oft-injured Irv Smith Jr.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Browns didn't have many glaring holes coming into the draft, but despite not having early draft capital, they did an excellent job of addressing the big ones—receiver depth and the defensive line—with their picks. It was a good all-around weekend for general manager Andrew Berry.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2023,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Dallas clearly stuck with its draft board and did a fine job of addressing needs. However, the Cowboys didn't do the best in the value department.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2023,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "It's an underwhelming draft class overall, especially if Mims doesn't go on to make GM George Paton look like a genius for flipping the switch early. Expect this draft to be judged by any success Wilson and Payton have on the field this season. Payton in Denver remains an unknown, and to this point, the Wilson trade has been a bust.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Outsiders are free to question Detroit's draft strategy at the very top of the draft, but coming away with Gibbs, Campbell, LaPorta and Branch is a huge win for the hottest team in the NFC North.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "If supporting Love was the goal, Green Bay did a nice job of throwing proverbial darts at its target. The Packers didn't come away with one of the very best pass-catchers, but they added offensive volume without ignoring the other side of the football.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Did the Texans give up a bit too much to move back up for Anderson? Maybe, but there's no way to argue that Houston isn't dramatically better than it was a few days ago. The Texans have their quarterback of the future, now have legitimate building blocks on offense and defense, and they significantly improved the depth on one of the league's most lackluster rosters.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "General manager Chris Ballard did solid work addressing Indy's glaring needs, and he came away with the quarterback with arguably the highest upside in this class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "It was a fairly by-the-numbers draft for the Jaguars, who focused on addressing needs without making any major reaches or truly surprising selections. If Jacksonville is the favorite in its division—and it should be after last season—that didn't change over draft weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Kansas City addressed its three biggest needs with its first three selections while adding depth prospects like defensive back Chamarri Conner and BJ Thompson in the latter rounds. Considering we just saw 2022 late-round picks like Jaylen Watson and Isiah Pacheco contribute in the Super Bowl, there's a chance that even the talent-laden Chiefs find roles for most of their draft picks this season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Was it a perfect all-around draft for the Raiders? Perhaps not, but general manager Dave Ziegler did a wonderful job of finding value and addressing needs. It's hard to argue with landing two of the top 18 prospects on the B/R board.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2023,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "This wasn't a bad draft class by any means, but it's worth wondering if adding two receivers, and one in the first round, was the right strategy for a team that ranked ninth in offensive yardage and 20th in yards allowed last season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2023,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "While Young might be the only early starter, the Rams desperately needed players to round out their roster after doing next to nothing in free agency. L.A. did a decent job of that, even without a first-round pick and without hitting a home run with any single selection.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting Ramsey, Chubb and a couple of potential early contributors is a win, even if the actual 2023 class doesn't do much to excite.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Vikings also added some running back depth by grabbing UAB's DeWayne McBride late. Minnesota's class is filled with logical selections that address critical and future needs, even if there isn't a day-one difference-maker in the group after Addison.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Patriots did a solid job of addressing needs throughout the draft and got incredible value early. However, while they took late fliers on Kayshon Boutte and Demario Douglas, they could have done more to support quarterback Mac Jones.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This was a sensible and sound draft class for a franchise hoping to return to NFC South contention with Carr at the helm.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "New York didn't land the top-tier receiver it has needed, but it did address the line, add an ancillary receiver and land a potential lockdown cornerback on the perimeter. The biggest disappointment is that the Giants did virtually nothing to address a run defense that ranked 31st in yards per carry last season (5.2).",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "If the move to acquire Rodgers gets the Jets into the AFC title game, this draft will be viewed as a success. However, New York didn't get the best value in the Elijah Moore trade and whiffed on landing an anchor tackle early in the draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2023,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Simply put, Roseman nailed this draft from start to finish, and the Eagles remain the team to beat in the NFC.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The only negative here is that Pittsburgh didn't add the explosive slot receiver it lacks—though the trade for Allen Robinson II may help alleviate the issue. The Steelers nailed three of their first four picks and have a markedly better roster than they did last week.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "It was an odd draft by the 49ers, who admittedly don't have many glaring needs. Brown was a logical target, but San Francisco didn't do a good job of maximizing value with its two other Day 2 picks. The fact that the 49ers do have McCaffrey makes the draft look better, but this was one of the more underwhelming classes.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Seahawks did a wonderful job of identifying needs and adding value with their first three selections. The fact that Seattle grabbed two running backs when Walker is already a budding star keeps this from being a perfect grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Tampa did a nice job of reloading on both sides of the ball, but it could have used a true left tackle to help replace Donovan Smith—maybe Mauch can compete there, maybe not—and it still has a significant need at running back.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Tennessee got the best overall offensive lineman in the draft and a possible quarterback of the future. That's a big win for a franchise hoping to get back to winning in the AFC South.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Overall, Washington's strategy made sense, but the Commanders failed to get another reliable receiving weapon for second-year quarterback Sam Howell and probably flipped the switch on Forbes far too early.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10074273-2023-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Monti Ossenfort did a nice job trading down from the third spot and still getting tackle Paris Johnson in the first round. They added a 2024 first-round pick from the Texans in doing so, which is huge. The rest of the draft was filled with talented players who need to fill a roster that lacked a lot of top-level players. They also have a bunch of picks next year, including two in the first round. It was a good start for Ossenfort.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "B.J. Ojulari",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Second-rounder B.J. Ojulari can rush the passer with speed, which they need in a bad way. He was a little undersold in this draft, but he can be a 10-sacks-a-season player on the next level."
      },
      {
        "playerName": "Garrett Williams",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love the choice of third-round corner Garrett Williams. He's coming off a torn ACL and there were better options. But they are turning over the roster, so I get it. They can be a little more patient."
      }
    ]
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "It's obvious by their draft what Smith's top priority is for this team. He wants to run the ball like he did with Derrick Henry in Tennessee. Getting Robinson and second-round pick Matthew Bergeron as a starting guard will help that run game. But did they really need a back with Tyler Alllgeier on the roster? I didn't love this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Clark Phillips",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "I love fourth-round corner Clark Phillips. He is a small corner, but he can cover and will hit. He will be a really good slot corner for a long time in the NFL."
      },
      {
        "playerName": "Bijan Robinson",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": "I like Bijan Robinson as a player. I just don't think backs in the top 10 make sense anymore. Arthur Smith likes to run the ball, but this is a passing league. Check back with me in four years."
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I liked the pick of Flowers, but the rest of the draft didn't excite me. Fifth-round corner Kyu Blu Kelly has talent and fits the defense. But there's not a ton to like about this draft. Then again, the draft was a sideshow this year to getting Lamar Jackson signed just before the draft began. That's the best thing that happened this past week for the Ravens. That makes them competitive in the AFC North.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Zay Flowers",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I really like receiver Zay Flowers for their new offense. New coordinator Todd Monken and Lamar Jackson will come to love this kid. He has the tools to give them a true outside playmaking threat for the next five years or so."
      },
      {
        "playerName": "Trenton Simpson",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "I didn't like the pick of linebacker Trenton Simpson in the third round. He's inconsistent. By drafting him, they are admitting they missed on 2019 first-round pick Patrick Queen since Simpson will be a replacement in 2024."
      }
    ]
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They took tight end Dalton Kincaid in the first, which will help the passing game. He is a move tight end who will make things easier in the middle of the field. He's not a great blocker. Torrence will be a brute if his knees hold up. Fifth-round receiver Justin Shorter is a taller receiver who can run.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "O'Cyrus Torrence",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Second-rounder O'Cyrus Torrence has first-round talent, which makes this a heck of a pick. The guard is a nasty, violent player who will amp up a run game that badly needs it. He does need to get in better shape. But he moves people."
      },
      {
        "playerName": "Dorian Williams",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "The Bills needed help at linebacker with Tremaine Edmunds gone in free agency, but I think there were better options than Dorian Williams, their third-round pick. He has speed, so that has to be what they loved about his game."
      }
    ]
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Their entire draft will be decided by how good quarterback Bryce Young is after they moved up to take him. He's the best passer in this class, but you can't ignore his size. The question is whether he can hold up. We've never seen a player like him before in terms of size at the quarterback position. If he's a star, this is a killer draft. If not, it will cost people their jobs.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Jonathan Mingo",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "It would be easy to say it's Bryce Young, but I am going to go with second-round receiver Jonathan Mingo. I think Mingo has the tools to be their No. 1 receiver in a year, which Young will love. He is strong and really was a player who scouts loved more than maybe draft Twitter did."
      },
      {
        "playerName": "D.J. Johnson",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Third-round pass rusher D.J. Johnson went a little high for my liking. He has some talent, but he didn't play to it. He was a tight end at some points of his college career, which shows he has athletic ability."
      }
    ]
  },
  {
    "teamName": "Chicago Bears",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I didn't like them trading down and passing on Jalen Carter in the first round. They moved down one spot and took tackle Darnell Wright, who is a good player, but they had a chance to get Carter, the best player in the draft. They added a lot of big bodies the rest of the way. They made a smart move to trade the top overall pick to land a great package from the Panthers, including a first next year. They are moving this team in the right direction.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Roschon Johnson",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Fourth-round running back Roschon Johnson is the type of back who can come in and push for carries right away. Would it shock anybody if he were a starter in a year or two? It wouldn't shock me."
      },
      {
        "playerName": "Gervin Dexter",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Second-round defensive tackle Gervin Dexter from Florida looks the part, but he didn't always play to his talent. If he can get more consistent, this will be a good pick. If not, it could be a major miss."
      }
    ]
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Duke Tobin, the Bengals' director of player personnel, knew that his defense had to be replenished for a chance to get to the Super Bowl. Plus, they need cheap guys to help save money to pay the explosive offensive players. He did just that. He added a pass rusher in Myles Murphy, a fast corner in Turner and a smart safety in Jordan Battle. That's how you keep a team moving forward, especially one with a dynamic offense. Well done.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "D.J. Turner",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I like second-round corner D.J. Turner from Michigan. He is fast and can fit into Lou Anarumo's scheme. They are getting younger and cheaper in the secondary, which they had to do. That works."
      }
    ]
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I really like their draft. They didn't have picks in the first or second (see: Deshaun Watson trade), but they made the most of the rest of the draft. I love Ika and fellow third-round pick, receiver Cedric Tillman. Sixth-round center Luke Wypler has starter qualities, especially in their offense. If Watson reverts to from, this draft is sensational. Until then, we can't give it an 'A'.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Siaki Ika",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love third-round pick Siaki Ika from Baylor. He is a big, powerful man who will help their run defense in a big way. He is also better pushing the pocket than people think. He needs to keep his weight in check."
      },
      {
        "playerName": "Dawand Jones",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Their worst pick could end up being their best. How? It's fourth-round right tackle Dawand Jones. If he can get his weight down — and there were stories of him being close to 400 at his pro day — he can be a quality starter. If not, major bust."
      }
    ]
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I loved first-round defensive tackle Mazi Smith, who will be a force on their front, especially in the run game. Fehoko will prove to be a quality rotational player. Second-round tight end Luke Schoonmaker was a nice pick. They picked three players on my Better-Than team in Smith, Fehoko (captain) and Schoonmaker. So I like this draft. Sixth-round running back Deuce Vaughn isn't big, but he can play.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Viliami Fehoko",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Fourth-round edge rusher Viliami Fehoko was the captain of my Better-Than team. He is a power player who plays with violence. He isn't twitchy, but he has the ability to get 6-7 sacks a season. He will be in the rotation as a rookie."
      },
      {
        "playerName": "Demarion Overshawn",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I wasn't as high on third-round linebacker Demarion Overshawn as some. He can run, but he's just too inconsistent. They have to love his speed as a converted safety, but the tape was inconsistent."
      }
    ]
  },
  {
    "teamName": "Denver Broncos",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They didn't have a first-round pick, trading it to Seattle in the Russell Wilson deal, then giving up one they acquired from Miami for Bradley Chubb to New Orleans to make Payton their coach. But they added some good players. Their draft wasn't great, but it was solid. Third-round linebacker Drew Sanders has tools to become a quality starter.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Marvin Mims",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Second-round receiver Marvin Mims can fly. He averaged over 20 yards per catch at Oklahoma, which will help the passing game and get Russell Wilson going."
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Lions and general manager Brad Holmes did some really good things over the weekend. They have positioned their roster for now and the future if third-round quarterback Hendon Hooker is good. I don't like taking a back high, but Gibbs might be more than that. Watch out for third-round defensive tackle Brodric Martin. He is a power player inside. Nice job.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Sam LaPorta",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love the pick of tight end Sam LaPorta in the second round. He's a playmaking tight end who can run like a receiver. Jared Goff will love him. The offense will be better with his skills."
      },
      {
        "playerName": "Jamyr Gibbs",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Can you like a player and not like the pick? That's the way I see it with 12th overall pick Jamyr Gibbs. He is a running back who is more of an air back, but I still think he went too high. You don't take backs that high."
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "It was obvious that they wanted to get help for Jordan Love in the passing game and also for their defensive front, which the did. They added four pass catches and two defensive front players, including first-round edge rusher Lukas Van Ness. This draft would have made Aaron Rodgers happy. Too bad it's all for Love.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Luke Musgrave",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Second-round tight end Luke Musgrave will be a nice addition to their offense for Jordan Love. Tight ends are security blankets for young quarterbacks and Musgrave will be that."
      },
      {
        "playerName": "Jayden Reed",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love second-round receiver Jayden Reed with better options on the board. Reed can run, but he wasn't one of my top-10 receivers."
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They feel like they got two long-term important positions solved here by taking Stroud with the second overall pick at quarterback and Anderson as their edge guy. I just think they gave up way too much for Anderson. If Anderson is Von Miller, this could be an all-time drat. Dell will be a steal. Stroud has to prove to be their franchise quarterback, which they think he can be. Center Juice Struggs was over-drafted in the second round in my book.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Tank Dell",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round pick Tank Dell will bring electrifying speed to the passing game, which will make rookie C.J. Stroud a happy man. Dell will be an immediate impact player as a return man."
      },
      {
        "playerName": "Will Anderson Jr.",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "It's not the player in Will Anderson Jr., but it's what they gave up to get him. They moved up to the third spot in a trade with Arizona, but they gave up way too much. Anderson better be a Hall of Fame rusher, and I don't think he will be."
      }
    ]
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Their draft will be decided by what quarterback Anthony Richardson becomes as a player. He was taken in the first round with the fourth overall pick, which could pay off in a big way. Richardson has the tools to become a star with development. I liked Will Levis more, but I see why the Colts took him. They had some nice picks after Richardson, including Brents, fellow corner Darius Rush and tight end Will Mallory in the fifth.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Julius Brents",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Second-round corner Julius Brents fits perfectly into the Gus Bradley scheme. He is a long corner who has a lot of cover ability. Nice pick."
      },
      {
        "playerName": "Josh Downs",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Third-round receiver Josh Downs went a little higher than I would have taken him, He's a solid player, but I don't think he will be as good as some others do."
      }
    ]
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Trading down and adding picks and still getting tackle Anton Harrison makes sense, considering they have to give Trevor Lawrence a mega-deal, which means cheap labor will be needed. That's also why having 13 picks matters. But I didn't love the second-round pick (TE Brenton Strange) or Bigsby that much. They better hope a lot of those third-day guys play. I liked fifth-round safety Antonio Johnson and sixth-round corner Christopher Braswell in addition to Abdullah.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Yasir Abdullah",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I really like fifth-rounder Yasir Abdullah from Louisville. He is a tough, physical player who can rush off the edge, which the Jaguars need. He was on my Better-Than team."
      },
      {
        "playerName": "Tank Bigsby",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of running back Tank Bigsby in the third round. He's a solid enough back, but there were better options and they could have used that pick for defense. He was picked to help their problems in short-yardage situations."
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "It's hard to doubt this organization, but I didn't love this draft. I think they left meat on the bone. I think there were better options when they picked the positions they did. After what they did in last year's draft, pinging them is tough. This wasn't a wow draft, yet with Patrick Mahomes they don't really need those anymore.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Rashee Rice",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "Second-round receiver Rashee Rice is a big-bodied receiver who doesn't have blazing speed, but he can help try to fill the void that JuJu Smith-Schuster left when he departed in free agency. I think they had better choices on the board when they picked Rice."
      },
      {
        "playerName": "Felix Anudike-Uzomah",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": "First-round pass rusher Felix Anudike-Uzomah fills a need, but his tape wasn't as impressive as I expected. He did play reduced to an interior alignment too much for Kansas State, which he won't do for the Chiefs, which will help."
      }
    ]
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "In addition to Bennett in the fourth, I liked their first three picks. First-rounder Tyree Wilson has the tools to be a Pro Bowl player on a consistent basis and second-round tight end Mike Mayer was the best at his position in this draft. Third-round defensive tackle Byron Young is a rising player who plays hard all the time. If Wilson is who they think he is, which is a dominant pass rusher, they got a solid haul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Jakorian Bennett",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I went with fourth-round corner Jakorian Bennett. He is a speedy corner who was on my Better-Than team because he really impressed on tape. The Raiders nailed this one. He will be a starting corner at some point as a rookie."
      },
      {
        "playerName": "Tre Tucker",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love third-round receiver Tre Tucker. He was a reach. Despite great speed, he had three 100-yard games in his career. There were better options, but we know how this team loves speed."
      }
    ]
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "By getting Henley and third-round edge Tuli Tuipulotu, the Chargers addressed a defense that needed it. But they didn't get a run stuffer inside, which they need, although sixth-round defensive tackle Scott Matlock has talent. Johnston has to be a Pro Bowl-type of talent for this draft to really hit.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Daiyan Henley",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love third-round linebacker Daiyan Henley, who is a fast, speedy linebacker. The Chargers have run-defense issues and adding help in the front seven was a top priority."
      },
      {
        "playerName": "Quentin Johnston",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": "I didn't love the pick of receiver Quentin Johnston in the first round. There were better options on the board at receiver and they needed help inside on defense. He does fit their receiver profile."
      }
    ]
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Rams didn't have a first-round pick — shocking, right? — but they made the most of the picks they did have. They picked a lot of good players. In addition to Avila, I liked a lot of their picks, including third-round edge Byron Young. Sixth-round corner Tre'Vius Hodges-Tomlinson is a quality player, who could be a good nickel. This team is being overhauled and this is the kind of draft that gives a team some good, young bodies to help make it happen.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Steve Avila",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Second-round offensive lineman Steve Avila is a nasty mauler who can play both guard and center. The Rams need help on their line, which is why Avila was a perfect pick."
      },
      {
        "playerName": "Stetson Bennett",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "I didn't like the pick of Stetson Bennett in the fourth round. Will he ever be anything more than a backup? I doubt it. So why bother?"
      }
    ]
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They lost their first-round pick because they violated the league's policy on integrity of the game when they tampered with Tom Brady. So their first pick was Smith, which I didn't like. The rest of the draft was just OK, and they didn't take an offensive lineman with their first three picks, waiting until the seventh round when they took tackle Ryan Hayes. That could end up being a problem.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Devon Achane",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "I like third-round running back Devon Achane. In this scheme, with his one-cut ability and speed, he will be a home-run threat as soon as this season. Maybe the Dolphins won't abandon the run as quickly as they did last season."
      },
      {
        "playerName": "Cam Smith",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love taking South Carolina corner Cam Smith in the second round. He has talent, but he didn't always play to it. He needs to be more consistent, but Jalen Ramsey and Xavien Howard will help that."
      }
    ]
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "After Addison, I didn't love their draft. I do like fifth-round defensive tackle Jacquelin Roy from LSU. He has talent and he's strong. Seventh-round running back DeWayne McBride was on my Better-Than team, so I like him. He does have some health issues and he doesn't catch the football.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Jordan Addison",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": "It's first-round receiver Jordan Addison. I think he was the best receiver in this class, so they got value after three others were taken before him. He will be a nice 1-2 complement to Justin Jefferson."
      },
      {
        "playerName": "Mekhi Blackmon",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": "I didn't like the pick of USC corner Mekhi Blackmon in the third round. There were a lot better options on the board when they picked Blackmon, even though corner is a major need."
      }
    ]
  },
  {
    "teamName": "New England Patriots",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They had seven picks in the first five rounds, but I am not sure they used them very well. First-round corner Christian Gonzalez will be a star. The kicker made no sense. I didn't love second-round edge Keion White or Sow. Sixth-round receiver Kayshon Boutte has a ton of talent, but has off-field issues that Bill Belichick will have to fix. Smallish receiver Demario Douglas is one of my Better-Than guys in this draft. A kicker and a punter in the same draft? That's over-thinking it.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Atonio Mafi",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "I liked fifth-round guard Atonio Mafi more than I liked their fourth-round guard Sidy Sow. Mafi is a mauler who just needs to improve his technique since he was a defensive player to start his college career. The Patriots will do that for him."
      },
      {
        "playerName": "Chad Ryland",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "They took a a kicker in Chad Ryland from Maryland in the fourth round. Why? You can find kickers. And it's not like Ryland was automatic. Kickers come and go. Don't like it. At least they waited to take the punter in the sixth."
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They took defensive tackle Bryan Bresee in the first, which filled a major need. Bresee has a ton of talent, but injuries and other issues prevented him from truly playing to it. If healthy, he can be dominant. Foskey also filled a need, but there were better options. I like Miller and fourth-round guard Nick Saldiveri as major bargains. Sixth-round receiver A.T. Perry has talent and was productive in college.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Kendre Miller",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Third-round running back Kendre Miller is a tough runner who will give them a nice combo with Alvin Kamara. Miller will bring back the power part of the offense like Mark Ingram used to do when he split carries with Kamara."
      },
      {
        "playerName": "Isaiah Foskey",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't like edge Isaiah Foskey as much as some scouts. They took him in the second round, but I think that was in large part because they had to take somebody at the position. The need was there, but does he solve it?"
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "First-round corner Deonte Banks fills a major need and he has the tools to be an outstanding man-cover player. Hyatt will help the passing game, but I didn't love their draft as much as others. Fifth-round running back Eric Gray has talent. They did fill some important spots.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Jalin Hyatt",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Third-round receiver Jalin Hyatt will give them a speed threat on the outside. If he learns the entire route tree early, he will give them a home-run threat."
      },
      {
        "playerName": "John Michael Schmitz",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I differed from a lot of evaluators, but I didn't like second-round center John Michael Schmitz as much as some. I know he fills a need, but there were better options."
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They took a defensive lineman and an offensive lineman with their first two picks, which is alway a good strategy. Joe Tippman, the second-round center-guard, is a good player who could push for time as a rookie as they upgrade their line. I liked their down-the-line guys more in Bernard-Converse, tackle Carter Warren and running back Israel Abanikanda. The best news they had: Aaron Rodgers is in the fold. They have their quarterback.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Jarrick Bernard-Converse",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Jarrick Bernard-Converse, their sixth-round pick, is a talented player with a lot of starts. He's a bigger corner who can play safety. Love the pick."
      },
      {
        "playerName": "Will McDonald",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love first-round pick Will McDonald. I know he was miscast some in Iowa State's defense, but I think he went too high. At this spot, he has to be a dynamic edge player. Can he be?"
      }
    ]
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Howie Roseman killed it with his haul this year. Getting Carter and Nolan Smith in the first round with their two picks is an impressive draft for a team that needed to get young players up front. Third-round guard Tyler Steen is a good player, who will be a starter in a year to two. Then they traded to land running back D'Andre Swift from the Lions. Nice job.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Jalen Carter",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": "It's their first pick, defensive tackle Jalen Carter. Yes, he has some off-field issues, but he is the best player in this draft. As one scout told me, he's generational. If he can stay away from issues, and work harder at the game, he will be a Hall of Fame player."
      },
      {
        "playerName": "Sydney Brown",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "It's hard to find a bad pick, so I will nitpick and say I didn't love safety Sydney Brown in the third as much as others did. They did need a safety, but I liked some other guys better in that spot."
      }
    ]
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They traded up to land Broderick Jones in the first round, which will be an immediate help up front, and that was a must. Second-round corner Joey Porter Jr. was a nice pick as well, playing for the same team as his father. They did a solid job all the way around. Second-round tackle Keanu Benton didn't play up to his traits, but he has the body.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Nick Herbig",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I like fourth-round edge player Nick Herbig from Wisconsin. He is a perfect fit for that the Steelers want in their rush players. He will be a hit on the outside in their scheme, although some think he should play inside. I don't."
      },
      {
        "playerName": "Darnell Washington",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't like the pick of Darnell Washington in the third round. I just don't think he's sudden enough, and he has knee issues. Please put weight on him and make him a tackle. He can be Jason Peters 2.0."
      }
    ]
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2023,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They didn't have a first- or second-round pick because of the trade up to draft Trey Lance two years ago and the trade to acquire Christian McCaffrey last year. One out of two isn't bad, I guess. They did have three third-round picks and used them at a variety of spots. Third-round safety Ji'Ayir Brown is a big hitter. I didn't love this draft",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Dee Winters",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Sixth-round pick Dee Winters is a perfect 49ers linebacker. He can run and hit and knows how to find the football. This converted safety will be a good special-teams player as he learns behind the 49ers' special linebacker group."
      },
      {
        "playerName": "Jake Moody",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "Taking kicker Jake Moody in the third round is way too high. I hate that. Kickers come and go, so why not just bring two to camp and let them compete? Haven't teams learned yet from drafting kickers?"
      }
    ]
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Getting Witherspoon and receiver Jaxon Smith-Njigba in the first round will really improve this roster. Both will be starters right away. I didn't love the rest of their draft, but they had a lot of picks. General manager John Schneider usually does well with those picks and is coming off an outstanding draft last year. So it's tough to doubt him. Keep an eye on fourth-round defensive tackle Cameron Young and seventh-round running back Kenny McIntosh.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Devon Witherspoon",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It was their first, corner Devon Witherspoon. He is a talented player, but he weighs 185 pounds. That's the concern, especially the way he throws his body around."
      },
      {
        "playerName": "Zach Charbonnet",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't like the decision to take running back Zach Charbonnet in the second round. He's a good player, but they have Kenneth Walker. The Seahawks love them some running backs."
      }
    ]
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "First-round defensive tackle Calijah Kancey is a player who can really amp up their interior pass rush. Playing next to Vita Vea, he is the perfect complement. I liked that pick. Mauch is a nice second-round choice. Keep an eye on fifth-round pick SirVocea Dennis, a linebacker from Pittsburgh. Seventh-round receiver Trey Palmer can fly. This was a draft based on speed. They got faster.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Cody Mauch",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Second-round pick Cody Mauch is a nasty player who will step in and likely be a starter at guard. He was a college tackle, but he is more guard than tackle in my mind. That line will be happy he's around."
      },
      {
        "playerName": "YaYa Diaby",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of pass rusher YaYa Diaby in the third round. I didn't love his tape, but I get it since they need help at edge. He is athletic, so this is a traits pick in my mind."
      }
    ]
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting offensive lineman Peter Skoronski in the first round and Levis in the second were good picks. Skoronski can be an All-Pro, while Levis has the tools to be a big-time starter. The rest of their draft didn't wow me, but sixth-round tackle Jaelyn Duncan has talent. This is a draft that will be defined by Levis.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Will Levis",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Yes, it's taking Will Levis in the second round. They made the move up to go get him, which was the right thing to do. He had a rough first night, but this is a great spot for him to sit behind Ryan Tannehill. He has the talent to be a big-time passer in the league — no matter what the masses think."
      },
      {
        "playerName": "Tyjae Spears",
        "grade": "B-",
        "gradeNumeric": 2.7,
        "text": "I like third-round running back Tyjae Spears, but he has some injury issues and I think they had more pressing needs. Spears will be a nice change of pace back to Derrick Henry, but it seems like a luxury pick for the Titans."
      }
    ]
  },
  {
    "teamName": "Washington Commanders",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They needed to get help in the secondary and on the offensive line, which they did. In addition to Forbes, second-round safety-corner Jartavius Martin is a good player who can do a lot of things. Fifth-round pass rusher K.J. Henry has a ton of talent and will help behind Chase Young and Montez Sweat, who will be looking for new deals soon. This draft showed one thing: They firmly believe in Sam Howell — and they should —even if nobody wants to believe it.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2023-grades-for-all-32-teams-cowboys-eagles-among-as-chiefs-49ers-receive-poor-marks/",
    "playerGrades": [
      {
        "playerName": "Emmanuel Forbes",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "First-round corner Emmanuel Forbes is light at 170 pounds, but he can play. He is a big-play specialist who can cover. He is needed in that secondary. He will push for time right away."
      },
      {
        "playerName": "Braeden Daniels",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love the pick of guard Braeden Daniels in the fourth round. I think there were better options. He is a developmental guy in my book. He played tackle in college, but should move inside."
      }
    ]
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Cardinals traded down with the Texans from the third pick, getting a ton of draft capital in the process, and they took Johnson, the best true left tackle in this class. He'll be a Day 1 protector for Kyler Murray, and he's got a ton of potential with a few technical fixes. New head coach Jonathan Gannon ran a ton of five-man fronts as the Eagles' defensive coordinator, and if he's going to do that in the Valley of the Sun, he has his speed end in BJ Ojulari, who has a ton of speed and bend around the edge. Garrett Williams and Kei'Trel Clark are nice additions to an iffy cornerback room, and Michael Wilson is a bigger (6-foot-2, 213 pound) receiver who almost looks like a tight end at times. Owen Pappoe is a good speed linebacker, and Clayton Tune is a fascinating guy on tape — his top 20 highlights make you think he's going to be an NFL starter someday, and then, there's a lot of randomness. Arizona came into this process with perhaps the NFL's worst roster, and they did their best to reinforce that roster with not only talent now, but more draft capital in the future to get back to relevance. You might like a bit more interior defensive line work in this draft, but not a bad haul at all.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I don't have a problem with Bijan Robinson going in the first 10 picks — he's the best running back prospect I've seen since Adrian Peterson, he broke 104 tackles last season for the Longhorns, and he can win as a receiver at all three levels. Head coach Arthur Smith has said that he sees Robinson as a weapon as opposed to a running back, and I get it. But with all the needs here, it's a bit odd. I'm also not in love with Bergeron going this high — he's got a lot of athleticism, but some messy tape, at offensive tackle. If the plan is to make him a guard, okay, but this seems like a reach. Harrison is an underrated tweener end with a lot of production and disruption against some major opponents, and Phillips could be one of the steals of the draft in the fourth round. If he were a couple inches taller and a few pounds heavier, he would have been seen as a first-round talent.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Flowers was my top-rated receiver in this class — not only because of all the ridiculous things he did on tape, but also because he did it with a quarterback situation that was borderline unwatchable. He might be the most talented receiver on the Ravens' roster outside of a healthy Odell Beckham Jr., and I can't wait to see what he does with Lamar Jackson throwing him footballs. Simpson is like other recent high-profile Clemson linebackers — he can do just about everything on the field, some of it very well, and we'll see about the rest. The Ravens would be wise to keep him in the middle and let him shoot out to the slot once in a while. Tavius Robinson wasn't a big name in this draft, but he grabbed eight sacks and 40 total pressures last season at 6-foot-6 and 257 pounds, and Baltimore needs edge guys who can also win inside. Kyu Blu Kelly and Malaesala Aumavae-Laulu are athletic, developmental prospects who might need a year of finishing work each, but the payoff might be worth it in both cases. And Andrew Vorhees would have been a mid-round pick were it not for injury. The Ravens addressed their primary needs in this draft to a greater or lesser degree, and Flowers is an absolute grand slam of a pick.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Bills have had issues getting past the Chiefs in recent years, and the fact that the Chiefs have Travis Kelce is one of the primary reasons. So, the Bills went out and got the closest thing to Kelce in this class. Kincaid can demolish defenders in contested-catch situations, he can shred man and zone coverage with his route and spacing awareness, and he's going to be Josh Allen's new best buddy. Getting TE1 with the 25th pick? No problem there. Buffalo also needed beef in the offensive line, and this is about where Torrence should have gone — he's a dominant earthdog who struggles with agility situations, but as he's used to blocking for Anthony Richardson, Allen's game will seem quite similar. The loss of Tremaine Edmunds in free agency left the Bills in need of a linebacker, and Dorian Williams is one of the better run-and-chase guys in this class; perfect for a team that plays nickel about 90% of the time. Shorter, who stood out at times when I was watching Richardson's tape, is a huge (6-foot-4, 229-pound) target who can really move in a straight line.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The success of this draft of course depends on how well Young plays at the next level. I might have preferred C.J. Stroud here, especially given what the Panthers had to spend for the first overall pick, but we're splitting hairs here. If Young was 6-foot-2 and weighed 220 pounds, nobody would have a question, and he has every other attribute you want in a franchise quarterback. Mingo might be a bit of an overdraft here to me, but there are a lot of people I respect who like him better than I do. Johnson is a hybrid end whose production last season made him a bit underrated, and I absolutely love the last two picks. Zavala is one of the better power guards in this class, and he has a positive history with former college teammate Iken Ekwonu. And Robinson might be a bit undersized, but you wouldn't know it when you're watching his tape — he has a tonesetter's alpha personality that shows up all over the place. The Panthers were clearly going for players who could win in the locker room as well as on the field.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Bears had all kinds of needs along their offensive line, and they started this start by trading down with the Eagles and still getting Wright, the best offensive tackle in this class. Wright is coming off a season in which he erased Will Anderson Jr., BJ Ojulari, and Bryan Bresee, so he projects pretty well to the NFL. On the other side of the line, Dexter is a formidable athletic prospect with some technique work to do, and Zacch Pickens is another guy with hybrid size who can get things done on the move. General manager Ryan Poles and head coach Matt Eberflus clearly have a type here. Tyrique Stevenson is a nice developmental cornerback, but it's the third day where the Bears' draft REALLY gets interesting. Roschon Johnson probably would have been a second-day guy were he not backing up Bijan Robinson, Tyler Scott is one of the more underrated receivers in this class, Noah Sewell is a fine two-down linebacker who can thump, and Terell Smith is a big cornerback who locked his opponents down in 2022 to the tune of an opponent passer rating of 68.2. This is a great combination of guys who are ready to contribute, and guys who need a bit of work, but were drafted about where they should have been. A great haul for a team under construction.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bengals clearly want to be more explosive all over the field in 2023, and their opponents would generally say that they were explosive enough. Turner and Iosivas are especially freaky athletes, and in both cases (especially Turner's), that shows up on tape right away. Turner might have been a first-round pick in a narrower cornerback class, and he projects as a Day 1 starter with ridiculous range. Myles Murphy may seem a weird first-round pick to some, but there isn't a lot of depth under Trey Hendrickson and Sam Hubbard, and Murphy can win from just about every gap. Battle is a versatile safety who had a bit of a down 2022 season, but his 2021 tape was pretty nice. Charlie Jones is an excellent slot receiver who can do cool things when the Bengals decide to go Air Raid, and Brown is a proven, productive back who should fit in right away in the running back rotation. Beyond positional needs, the Bengals obviously wanted to get faster and tough to deal with, and they took care of that with authority.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Browns got a pretty nice haul for a team with no picks in the first two rounds. Tillman, Ika, and Jones are immediate contributors who I would have given second-round grades, and Dorian Thompson-Robinson is a highly intriguing athletic quarterback with more of the nuances for the position than you might expect. The steal of this Browns draft, though, is Luke Wypler — I have no idea how he lasted until the sixth round, but he's another potential plug-and-play guy. The Browns did an outstanding job of getting prospects who can help them on the field right away. That's impressive if you have a couple of first-round picks. Here, it's hard not to give this class an A+. The only thing knocking the grade down is that the quarterback who cost them all those picks might be washed.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Dan Quinn's defense needed beef and pressure up the middle in this draft, and they got both in Mazi Smith, a 6-foot-3, 323-pound tackle who put up 25 total pressures last season and reminds me of Dontari Poe. Dallas also needed a tight end who could win in space, and they got that in the underrated Schoonmaker. Watch out for Fehoko, who had 12 sacks and 66 total pressures for the Spartans last season, and seems like an ideal Quinn guy with his ability to wreck dudes from multiple gaps at 6-foot-4 and 276 pounds. But the steal and the story of this class has to be Deuce Vaughan, who has a history with the Cowboys franchise. The Cowboys don't generally get the credit they deserve for their quality drafts, but we'll sign off on this one.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Like the Browns, the Broncos gave up a boatload of draft capital for a quarterback whose best days might be behind him, but they did a very impressive job with the picks they had. Mims is one of the better and more nuanced deep receivers in this class, and if he's not catching passes right away in Sean Payton's offense, it won't be his fault. Drew Sanders trnafered from Alabama because he couldn't get reps as an edge-rusher and moved to off-ball linebacker, which now gives him a really interesting two-level skill set. You'll hear people saying that Riley Moss should move to safety, but the tape doesn't show that at all — he's a quick, aggressive cornerback who will give up the occasional big play, but is just as likely to erase his target. And I had a third-round grade on Skinner, who is one of the more interlining deep safeties in this class. The Broncos are the inverse Jay-Z — they have one (huge) problem, and about 99 things going well, and this draft class is in the latter category.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "There is the Detroit Lions' concept of positional value, and there is everybody else's. They proved that with the first-round picks of Jahmyr Gibbs and Jack Campbell. Running backs and linebackers might not matter to other teams, but they do to these guys. My only issue is that I had borderline second-round grades on each player, and these aren't the kinds of positions where other teams are generally trading up to grab them. In any event, Detroit's second round saved their draft. Brian Branch is a do-it-all defensive back who projects well everywhere from slot to safety, and I can't wait to see how defensive coordinator Vance Joseph deploys him, Chauncey Gardner-Johnson, and Kerby Joseph. And Sam LaPorta will do a lot more in Ben Johnson's offense than he was able to in Iowa's \"three yards and a cloud of meh\" system. The Hendon Hooker and Brodric Martin picks (Martin is a massive dude who can also get after the quarterback) are cool, and the Hooker pick may turn out to be one of the steals of this draft. But that first round is tough to overcome.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2023,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Maybe it was the number of picks the Packers had, or maybe they felt freed from the shackles of whatever mystery spell Aaron Rodgers had put on them, but the Packers' draft was… odd. Let's start with the picks I liked. Clearly, head coach Matt Lafleur is going to call a bunch of 12 personnel packages with the addition of Musgrave and Kraft, and they're two of the most explosive tight ends in a loaded class. Jayden Reed is a competitive receiver who will add to the room, I love Karl Brooks as a legitimate 300-pound edge defender (you don't see that every day), and getting Anthony Johnson Jr. in the seventh round is absolute larceny. And now… time to avert your eyes, Cheeseheads. I had Lukas Van Ness as my eighth-ranked edge-rusher, Sean Clifford has an undraftable grade from a lot of people (I do not disagree), and there's more reaches than steals here. Even Reed, who I like, seems more like a third-day guy. Maybe it all works out, but starting with the Van Ness pick, this is hard to endorse.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Stroud was my QB1, so no argument with getting him with the second overall pick the Texans had. Trading up (and giving up a lot) for Anderson is a suspect move, though Anderson does seem to have everything to transform Houston's defense as Stroud can do for the offense, and I'm not going to tell DeMeco Ryans what to do with his defensive players. Scruggs seems like a massive overdraft based on his tape, but I love the idea of Tank Dell in Bobby Slowik's offense. Skowik is from the Kyle Shanahan tree, and Dell seems like a total Shanahan \"creative gadget\" receiver, so there you go. The steal of this draft, though, is Xavier Hutchinson in the sixth round. No clue how he lasted this long, but he's a potential WR1 in the NFL with speed, route awareness, and nuance to get open in contested situations. The Texans have gone through a lot in the Bill O'Brien and Jack Easterby eras. They needed a solid draft with franchise-defining players up top, and the fact that they did that is a positive step. But Will Anderson Jr. had better be something else…",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Colts general manager Chris Ballard, who has been feeling some heat in recent years, nailed this draft, and he did it by focusing in traits-based players, which can get some GMs in trouble. Richardson could nuke the NFL in the kind of QB run game new head coach Shane Steichen just ran with Jalen Hurts in Philly, and that's an easy like-as-like transition. Defensive coordinator Gus Bradley has three new big, athletic cornerbacks in Julius Brents, Darius Rush, and Jaylon Jones, who should thrive in Bradley's single-high, island-based coverages. Josh Downs will be a great target for Richardson, and he has some aspects of his game that are similar to former Colts star T.Y. Hilton. Blake Freeland needs to add about 20 pounds to his frame to deal with NFL defenders, but he may be the best pure athlete at his position in this class. Combine star Adetomiwa Adebawore is a guy that Bradley can move around in his fronts to great effect. Getting their franchise quarterback was the big, obvious move, but Ballard and his staff had a draft here that could open things up for a good, long time.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Jaguars GM Trent Baalke was pretty busy with all these picks, and the hits could be serious. Anton Harrison is a plug-and-play left tackle who can slide right in and succeed. Brenton Strange should combine with Evan Engram to give Doug Pederson some really interesting two-TE packages, and Tank Bigsby lives up to his nickname on the field with his violent running style. The two fifth-round picks really stand out — Yasir Abdullah is a smaller edge-rusher who wins with estimable quickness and bend; he was one of my more underrated speed ends. And Antonio Johnson should help a secondary that needs a lot of it. I would have liked to see more cornerback help here, but the Jags did add important pieces to a roster that is supposed to be playoff-pound in 2023.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2023,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The defending Super Bowl champs started out with a bang getting Felix Anudike-Uzomah with their first pick. Anudike-Uzomah had eight sacks and 46 total pressures last season for the Wildcats, and he's exactly the kind of speed-to-power pass-rusher defensive coordinator Steve Spagnuolo prefers. Rashee Rice fits right in as the speed receiver who Patrick Mahomes can hit downfield — he caught 18 passes of 20 or more air yards last season on 40 targets last season for 566 yards and four touchdowns. Wanya Morris was Anton Harrison's bookend for the Sooners, and he might be able to fit in at right tackle here sooner than later. If there's a steal here, it's Keondre Coburn in the sixth round. He's a 6-foot-2, 332-pound tackle who can plug up run lanes and get after the quarterback, aligning him with another Spagnuolo preference. GM Brett Veach had so many rookies making a difference all the way to the Lombardi Trophy last season, and maybe he has a re-run here.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Raiders needed a bad-ass bookend for Maxx Crosby, and they certainly filled that with Tyree Wilson. The Texas Tech pass-rusher is still a bit raw, but he's also an athletic freak, and he should be able to help Patrick Graham's fronts outside and inside sooner than later. Michael Mayer was considered to be the \"safe\" pick at his position, but he's got a full skill set, he led all tight ends in his class last season with eight catches of 20 or more air yards, and he'll start Day 1. Byron Young is that rarest entity — an underrated player from Alabama — and Graham can deploy him inside and outside in different ways than Wilson. I also like the Jakorian Bennett pick — like Maryland teammate Deonte Banks, he's an aggressive press cornerback who can win at the line of scrimmage. Add in Christopher Smith II and Nesta Jade Silvera as important pieces in the later round, and it's nice to see the Raiders addressing so many positions of need along a defense that needs to do a lot more than it did in 2022.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "This draft didn't start out entirely positively in my mind — while Quentin Johnston is a big, fast receiver who can blow defenses up after the catch, he needs to expand his route palette and cut out the drops. However, head coach Brandon Staley got two great guys in the second and third rounds. Tuipulotu is a bigger (6-foot-3, 266-pound) edge-rusher who had 13 sacks and 56 total pressures for the Trojans last season, and he has the toolkit to win in Staley's concepts right away. Staley's concepts need athletic linebackers, and Daiyan Henley absolutely fits that profile. What you'd like to see here is more to solve the Chargers' seemingly endless issues stopping the run, and the Johnston pick up top is a bit iffy, so that takes the grade down a bit.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I love the addition of Steve Avila up top — he's a natural power blocker who will work his way into that depleted offensive line right away. And Tennessee's Byron Young is a hybrid-sized (6-foot-2, 250-pound) rusher who had nine sacks and 42 total pressures last season. The fifth round was a value round for the Rams — Warren McClendon Jr. was a personal favorite as was Puka Nacua, Davis Allen should thrive in Sean McVay's offense, and if Tre'Vius Hodges-Tomlinson was six feet tall and weighed 200 pounds, we'd have been talking about him as we were talking about Devon Witherspoon, Christian Gonzalez, and Joey Porter Jr. At 5-foot-8 and 178 pounds, he puts me in mind of Antoine Winfield Sr., and don't be surprised if he's a difference-maker sooner than later. Getting Zach Evans in the sixth round is another steal — he'll add to that offense with his speed and shiftiness. I'm not at all sure what McVay and GM Les Snead were thinking with the fourth-round selection of Stetson Bennett — maybe the back-to-back championships clouded the tape — but maybe they see something I don't. In any event, the \"F them picks\" Rams did a lot of good business in the later rounds, which bumps up the grade.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2023,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Losing your first-round pick because you were messing around with Tom Brady is automatically going to sink your overall draft grade, and with just four picks overall, the Dolphins don't have a lot here. However, I'm fully on board with their first two selections. Cam Smith is an NFL-ready cornerback who is just as good in off-coverage as he is in press; he does everything well with no real liabilities. And for a team that under head coach Mike McDaniel wants to put a track team on the field on offense, Devon Achane is a literal perfect fit, as his track background shows up all over the field. He will be quite fun to watch in that offense. Achane ran a 4.32 40-yard dash at the combine, and last season, 18 of his 196 rushing attempts went for 15 or more yards. And Ryan Hayes could break through in Miami's iffy line — last season, he allowed no sacks and 11 total pressures in 357 pass-blocking reps. Elijah Higgins is a huge (6-foot-3, 235-pound) receiver who isn't an obvious deep receiver, but the Dolphins already have enough of those guys, and this is a good change of pace. Not a bad draft for the Dolphins; you would have liked to see more of it, is all.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Kudos to the Vikings for addressing their most prominent need with two cornerbacks in the second day of the draft, but the real star of this group is Addison, the best pure route-runner in this class. Pairing him with Justin Jefferson will tie opposing cornerbacks in knots. Mekhi Blackmon is an underrated defender who allowed an opponent passer rating of 46.1 last season, and while Jay Ward needs more finishing work, it's good to see progress at a position in need of legitimate island guys — because when Brian Flores is your defensive coordinator, you're going to play on islands. I'm not sure how Jaquelin Roy lasted until the fifth round — his tape seemed more like second- or third-round stuff to me — and if UAB running back DeWayne McBride can solve his fumbling issues, his speed and contact balance will win out impressively.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Patriots got a lot of \"my guys\" in this draft, so of course I'm going to like it. We can start with Christian Gonzalez, who somehow lasted to the 17th pick. Perhaps other teams were put off by the fact that Gonzalez is more of a technician than an aggressor, but there is no more purely athletic cornerback in this class, and he's in the right environment to bring out a bit more of that aloha stuff. And I love the addition of Keion White, who can win inside and outside as a speed/power pass-rusher who will also surprise you with his ability to drop and cover. I will be fascinated to see how Belichick deploys Marte Mapu, who, like Kyle Dugger a few years back, is a smaller-school safetybacker who shows his athletic tools from multiple spots. SIdy Sow and Atonio Mafi especially project well to help an offensive line in transition, and if the Patriots can get the most out of Kayshon Boutte, that's going to be one of the steals of this class. Boutte was thought to be a first-round prospect before his disappointing 2022 season.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Saints lost a lot of talent along their defensive line in free agency, and they addressed that with authority in this draft. If Bryan Bresee can stay healthy, he'll be one of the best interior disruptors in this entire draft class. He's a natural one-gap penetrator, and you can line him up everywhere from nose shade to edge. I liked Isaiah Foskey's tape more than some people I've talked to, and head coach Dennis Allen won't have any trouble taking Foskey's 12 sacks and 33 total pressures from last season and extracting that kind of production in his concepts. The steal of this group is Wake Forest receiver A.T. Perry, who I thought would go in the second day. Perhaps the Demon Deacons' offense is tough for NFL people to project (I would understand that), but Perry caught 81 passes for 1,100 yards and 11 touchdowns last season. I'm not sure how much \"projecting\" you need to do there. And the Saints can have Fresno State Alumni Day every day with Derek Carr and Jake Haener, who is a quality developmental quarterback.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The first four picks of this draft alone should have fans of Big Blue doing handsprings and huzzahs. Defensive coordinator Wink Martindale dials up as much aggressive press coverage as anyone in the NFL, and Deonte Banks is absolutely the best press cornerback in this class. There are few better immediate fits between player and scheme in this entire class. John Michael Schmitz is a 10-year, plug-and-play starter in the middle of the offensive line; he's a power blocker who reminds me of Alex Mack. And how happy is Daniel Jones right now? He got his big contract, the Giants added Darren Waller and Parris Campbell in the offseason, and now, he's got Jalin Hyatt to throw to, as well. Hyatt is a pure speed guy who can leverage defenders upfield even as he fills out his route palette. And Eric Gray is one of the more underrated backs in this class. There was a lot to like about the Giants in Brian Daboll's first season as head coach. Based on this draft, there should be even more in 2023.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2023,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Sometimes as an NFL evaluator, you need to separate a prospect from a set of schemes that does him no favors. That was the case for the Jets and Will McDonald IV, who played inside the tackles far too often in Iowa State's three-man fronts at 6-foot-3 and 239 pounds. After selecting McDonald with the 15th pick, both general manager Joe Douglas and head coach Robert Saleh said that McDonald's days as a 4i were done, and thank goodness for that. He's one of the quickest edge-rushers in this class, and his spin move will give offensive tackles fits. Douglas then added quality to an offensive line in need with Joe Tippman and Carter Warren, and Israel Abanikanda will add some thump to the run game. Perhaps the most interesting pick is Old Dominion's Zack Kuntz, who comes to Aaron Rodgers' offense with measurables out the wazoo, and the ability to beat defenses deep over time.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2023,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "At this point, I think we can see what Eagles general manager Howie Roseman's master plan is. He wants to unleash every Georgia Bulldog he can on the rest of the league. Let's start with Jalen Carter, who I believed to be the best player in this draft based solely on his 2022 tape. Carter's 2023 offseason was far less conclusive, of course, but the Eagles are betting hard that the right environment (and so many former Georgia teammates) will unlock all of that potential. It's a risk, but with the ninth pick, not a huge one, based on what Carter could be. As far as Nolan Smith — well, I compared him to Haason Reddick, and now, the Eagles have two Haason Reddicks to deploy in their five-man fronts. Unlike Carter, Smith has no off-field dings at all — his only question was injury recovery. The Eagles concluded their Georgia trio with Kelee Ringo in the fourth round, which is right where I would have had him, based on tape. Ringo has been working with Richard Sherman this offseason to clean up the things that could cause trouble at the next level, and who better? We're not done yet, folks. Philly also stole Illinois' Sydney Brown in the third round, and I had Brown as my second-best safety in this class behind only Alabama's Brian Branch. And I don't know how the Eagles got Texas' Moro Ojomo in the seventh round, but he's a nice hybrid tackle with five sacks and 26 quarterback hurries last season. Add in the lowball trade for ex-Lions running back D'Andre Swift, and once again, we have to stand back in wonderment at how Howie Roseman is getting away with all of this.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2023,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "While one Pennsylvania team was taking every Georgia defender in sight, the other Pennsylvania team was doing the same with the Bulldogs' best offensive prospects. Broderick Jones fits right away as a power tackle, but I am of the belief that he'd be an even better guard at the NFL level Either way, it's a massive upgrade. And Darnell Washington should add some color to Matt Canada's \"all-stop\" passing game with his blocking ability and Godzilla-like frame. The marquee pick was Joey Porter Jr., the son of the linebacker the Steelers selected in the third round of the 1999 draft. Porter is a pure aggressive press cornerback with a wingspan longer than some offensive tackles in this class, which leads me to believe that Pittsburgh wants to play more in that style. Mike Tomlin isn't stupid, and he's a former defensive backs coach, so take that for what it's worth. I also love the addition of Wisconsin's Keeanu Benton, who should solve this team's recent interior defensive line issues that have forced Cameron Heyward to be Superman all the time. And Wisconsin's Nick Herbig is an interesting edgebacker hybrid guy who can add pass rush in a situational sense. The Steelers were not messing around in this draft — they went all out for physically dominant players who bring production and attitude right off the bus.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2023,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The 49ers had until the end of the second day of the draft to sit around and think about things, which led them to take a kicker with their second pick. My favorite factoid about Jake Moody comes from the 49ers' PR department: Once met his idol, NFL K Matt Prater at a Detroit pizza parlor and was so excited to meet Prater that he blew off HOF WR Calvin Johnson, who eventually introduced himself during the conversation. Well, at least the kid's a kicker at heart. The pick I like the most in this group is Penn State's Ji'Ayir Brown, who projects well as that kind of versatile safety the 49ers have loved through recent years. Think Jimmie Ward, and you won't be far off. Beyond that, there are some reaches here, and perhaps not as many immediate contributors as you'd like, though I do like Georgia's Robert Beal Jr. as a speed end. General manager John Lynch spoke after the pick of Beal's \"GTFO\" ability, which is apparently a metric the 49ers' staff uses to discern a defensive lineman's ability to get off the snap as quickly as possible.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2023,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Thanks to the Russell Wilson trade, Seahawks general manager John Schneider and head coach Pete Carroll came into this draft with the ability to make two first-round selections for the first time since 2010 — their first year together in the Emerald City. Schneider and Carroll got this draft rolling with Devon Witherspoon, the best cornerback in this class, and if you're factoring in Jalen Carter's off-field stuff, perhaps the best defensive player. Witherspoon has every attribute you want in a cornerback, and his combination of aggressiveness and match footwork should make him an instant star. Then, Seattle got Jaxon Smith-Njigba with the 20th pick, and Smith-Njigba probably would have gone in the top 10 had he not lost so much of his 2022 season to injury. He's Cooper Kupp, the sequel. Seattle's second round was far more like last year's in that they took an edge-rusher and a running back. Derick Hall reminds me of Boye Mafe as a productive pass-rusher, and Zach Charbonnet is more of a Marshawn Lynch type than Kenneth Walker's Melvin Gordon-style slasher profile. Charbonnet was my RB3 behind Bijan Robinson and Jahmyr Gibbs, for what it's worth. Perhaps the sleeper of this group — and a guy who might be a Day 1 starter — is Michigan center Olusegun Oluwatimi, who fills a need that Schneider and Carroll wouldn't stop talking about before the draft.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Calijah Kancey was my IDL2 in this class, and in other classes without a stud like Jalen Carter, me might have topped the list. Yes, he's just 6-foot-1 and 281 pounds, but he's a perfect attack rusher with ridiculous combine measurables that show up all over his tape. The Bucs have had to deal with Falcons tackle Grady Jarrett twice a year for a long time, and now, they have their own version. I also like Pitt linebacker SirVocea Dennis, who projects well as a speed/chase defender with a fascinating physical profile. He's got Tyree Wilson's upper body, and Russell Wilson's lower body. North Dakota State's Cody Mauch looks more like a center to me than a tackle or guard, so we'll see where the Bucs think he fits best. And YaYa Diaby, who had 10 sacks and 36 total pressures for Louisville last year, was a common name on sleeper lists. You still have to wonder what the plan is at quarterback beyond Baker Mayfield and Kyle Trask, but starting with Kancey, who has total game-wrecking potential, there's a lot of talent here.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The addition of Peter Skoronski combines best player available and positional need quite well. I'm not sure whether Skoronski will be an NFL tackle, but if the Titans kick him inside to guard, I think he could be the next Zack Martin. And Tulane's Tyjae Spears is a personal favorite — few prospects in this class were more fun to watch, and with his power, contact balance, and ability as a receiver, Spears is more than just a smaller gadget guy. He could be another Austin Ekeler. Maryland's Jaelyn Duncan went about where he should have as a monstrously gifted blocker with all kinds of technical work ahead of him. The extent to which you deem Tennessee's draft an eventual success is how the Titans hit on Will Levis, who they traded up to take early in the second round. Levis is a power thrower with plus athleticism, but the accuracy and decision-making are below par. I thought that Levis had third-round tape, but we'll see if the Titans can give him the offensive structure and defined reads he'll need to succeed over time.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2023,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Washington is already getting poleaxed for taking Emmanuel Forbes with Christian Gonzalez still on the board, but if your preference is for a rangier, aggressive cornerback with insane production (14 interceptions and an FBS-record six pick-sixes in his collegiate career), Forbes hits the mark, especially if he's able to add to his 166-pound frame. There should be fewer arguments about the addition of Illinois' Jartavius Martin; he's a corner-to-safety convert who can succeed all over your secondary. Ricky Stromberg and Braeden Daniels add to a line in need, and if there's a sleeper here, it might be Andre Jones Jr., who racked up 20 sacks and 109 total pressures over for seasons as a starter for the Ragin' Cajuns. And watch out for KJ Henry, who had five sacks and 53 total pressures last season for Clemson. The Commanders have made their statement at quarterback — they are clearly all-in on Sam Howell, and I don't disagree with that assessment.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2023-nfl-draft-final-grades-155414197.html",
    "playerGrades": []
  }
]