[
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Cardinals did a nice job over the first two days of the draft. They acquired picks via trade, found home-run hitters on offense in Harrison and Benson and added an inside/outside pass-rush threat in Robinson. They landed athletic corners in Melton and Elijah Jones, as well. Adams and Reiman also met needs, though they were picked a bit earlier than I expected. Taylor-Demerson was my pick for the Cardinals in the fourth round of my seven-round mock draft because of his quickness as a slot defender and tackling ability. Thomas is athletic enough to stand up on the edge for the Cardinals, while Christian Jones and Palmer have the talent to take back-end roster spots and compete for playing time down the road.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "It was a strange draft for the Falcons, primarily because of the Penix selection, which was perplexing given their investment in Kirk Cousins this offseason. Penix's strong arm and accuracy from the pocket could make him a star if the injury woes that plagued him at Indiana don't return. Trading up to grab the athletic Orhorhoro was a reach, in my opinion, especially given the team's need at corner. Trice met a crucial need on the edge. Dorlus fits the mold of Atlanta's defensive linemen. He should be able to play 5-technique or 3-technique depending on where he is needed. Bertrand should contribute on special teams before moving to defense in time. McClellan and Washington -- who broke out as a senior at Illinois -- offer depth at the skill positions. They'll need to find cornerbacks in the undrafted free agent pool after failing to address the position in the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Ravens had yet another solid draft. Wiggins' elite recovery speed earned him a first-round slot, but he must answer questions about how his lean frame and inconsistent tackling translates to the next level. Rosengarten and Isaac were great value picks at two need spots. I liked the selection of Walker, an outside playmaker, early in Round 4, even after the team re-upped Rashod Bateman. Tampa's size and strength at the catch point made him worthy of a Day 2 pick, but Baltimore landed him on Day 3. Ali is coming off a biceps injury suffered at the Senior Bowl. Leary's arm and experience gained him a draft spot. Samac's a powerful interior lineman.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Buffalo found the potential big-play receiver it needed in Coleman after trading down twice in Round 1 (for relatively small gain). It will be interesting to see if dealing with the Chiefs so Kansas City could pick speedy pass-catcher Xavier Worthy comes back to bite the Bills. Bishop should be a good starter. Carter adds determination and leadership to the defensive line, although he was picked a bit earlier than I expected. Davis' tenacity as a runner is the perfect complement to James Cook. I projected Van Pran-Granger to the Bills a bit later in the fifth round in my final mock draft, but he was still a good value for a stout pivot. Securing a 2025 fourth-round pick for a fifth-rounder this year in a trade with the Bears will pay dividends down the road. Solomon is shorter than most Bills edge rushers, but he gets to the quarterback. Hardy could be a nickel candidate and is a strong return man.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Carolina gave up what eventually turned into the No. 1 overall pick in this year's draft as part of last year's trade to select quarterback Bryce Young. The Panthers moved up a spot to pick Legette at the end of Round 1. He will need to show he was a better pick than several other receivers selected in the second round. Brooks should be an excellent back once recovered from his knee injury. Wallace was an excellent value in Round 3 and can take over for Frankie Luvu, who exited in free agency. Sanders is a smooth pass-catching tight end who will be looking to outperform past Carolina draft picks Ian Thomas and Tommy Tremble. Smith-Wade is quicker than fast, making life difficult for receivers by sticking like glue.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Williams and Odunze, combined with DJ Moore and Keenan Allen, could give the Bears their best passing attack since the merger. The second-round pick that was dealt to Washington for Montez Sweat should pay off now that his contract has been extended. Amegadjie should contribute as a backup in 2024 and has potential to start down the road. Taylor has a good leg and had plenty of reps at Iowa, but I believe picking him in the fourth round was a reach. Booker has potential as an edge rusher, but the Bears had to give up a 2025 fourth-round selection to get him because they had unloaded their other Day 3 picks in previous trades. They improved their interior offensive line by sending a fifth-round pick to Buffalo for Ryan Bates earlier this offseason.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Mims is a boom-or-bust pick at tackle. He certainly has the size to win at the next level, but his limited experience (eight starts at Georgia) is a concern. The team doubled up on defensive tackles on Day 2 as it looks to replace D.J. Reader. Burton presented excellent value. He could become a key contributor on offense, especially if the Bengals and Tee Higgins don't work out a long-term agreement. Cincinnati was part of the tight end run in the fourth round, picking All despite injury concerns. Newton had a tough go at times during his senior year, but he could prove to be a nice find in the fifth round. Same goes for sixth-rounders McLachlan and Johnson. The Bengals picked Anthony with the seventh-round pick acquired from Houston for running back Joe Mixon.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Browns' 2022 trade for Deshaun Watson is still very much a work in progress; the QB's performance thus far has not provided the team with much of a return on the raft of picks shipped to Houston, including first- and fourth-round picks this year. Hall and Zinter stay in Big Ten Country, with the former Buckeye looking to wreak havoc on the defensive line and Zinter likely to bounce back from injury to be a long-term starter. Cleveland did not have many Day 3 picks because of past trades, including one this offseason for receiver Jerry Jeudy. Thrash could work himself into the role of a fourth or fifth receiver because of his speed. Nathaniel Watson's ferocious nature meets a need in the middle of the team's defense late in the draft, and Harden was one of the steals of the seventh round because of his fierceness and athleticism.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Gaining a third-round pick in a move down the board and still landing a starting tackle made for a successful Thursday night for Dallas. Kneeland and Beebe should prove to be excellent values, while Liufau will be a solid addition to the middle of the Cowboys' defense. The Notre Dame 'backer was picked a bit early for my taste, though. In Round 5, Dallas added Carson, a versatile corner/safety who was considered a Day 2 prospect near the start of last season. Flournoy has the tools to make the squad his rookie year. The Cowboys did not take a running back with any of their eight picks, leaving a sizable hole on their roster they'll still need to fill this offseason. Dallas had four picks within the top 90 selections, but were without a fourth-rounder, having sent theirs to San Francisco last August for Trey Lance. That investment could work out quite well if the former No. 3 overall pick is able to find his game at the pro level.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Time will tell whether Nix will be a top-notch starting NFL quarterback or viewed as a reach by a team in desperate need of talent under center. Time will also tell whether the 2023 first- and 2024 second-rounders the Broncos sent the Saints to acquire coach Sean Payton (along with a 2024 third-round pick) will lead to a championship in Denver. Elliss isn't a fantastic athlete but was productive at a need position for Utah, where he played for his father, former NFL lineman Luther Elliss. Denver traded up early in Round 4 to unite Franklin with Nix; the former is not the toughest receiver, but he can make defenders miss after the catch. The Broncos then found value at corner in wiry competitor Abrams-Draine before grabbing a power back in Estimé.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Lions doubled up at corner in the first and second rounds, flexing their aggressiveness by trading a third-rounder to move up for Arnold instead of staying put and possibly selecting his 'Bama teammate, Kool-Aid McKinstry. Detroit got fair value on Rakestraw at the end of Round 2, though the team also could have used another edge rusher or receiver. With Taylor Decker and Penei Sewell already in place at the two bookends, the Lions were one of the few teams able to take a chance on a massive, super-athletic tackle like Manu, a developmental prospect out of Canada. Vaki could turn out to be a hammer of a running back and special teamer, but the 32-spot jump to get him cost Detroit its fourth-rounder next year.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Morgan's pass-protection skills give him a chance to replace three-time Pro Bowler David Bakhtiari at left tackle, or he could prove himself a nice positional blocker at guard, allowing the Packers to get their five best linemen on the field together. Cooper and Bullard were excellent picks in Round 2, with both filling needs, but I was a bit ambivalent on the team using third-round selections on a running back (albeit a good one in Lloyd) and a second linebacker. Monk and Glover should provide depth on the offensive line, while Williams' reliable tackling should make him a good special teams player. Trading a pick to move up for a second safety didn't seem like the best value, though -- especially when you consider Green Bay took another safety just one round later. Oladapo is also a quality defender, but using three choices on the same position means the team must now rely on free-agent edge rushers and 3-techniques to round out the defense. Pratt was an excellent value pick late in the draft, as was King, who has more upside than his pre-draft evaluation might suggest.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Houston built on the momentum from last season's playoff run with a strong 2024 draft plan. The pre-draft trade with Minnesota to move out of the No. 23 overall slot -- and out of Round 1 entirely -- netted the Texans a 2025 second-rounder and didn't prevent them from addressing a roster sore spot with Lassiter. The Vikings used their original second-round pick on Fisher, who still needs more polish to his game. Time will tell whether Bullock was the right pick over the numerous other safeties still on the board. Stover was an excellent choice in Round 4. He'll be reunited with C.J. Stroud, who frequently leaned on the tight end on third downs when the two were teammates at Ohio State. Hill should be a special teams demon. Acquiring veteran running back Joe Mixon for a seventh-round pick earlier this offseason also factors into the grade above.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Latu was the most consistent pass rusher in the draft class and will be productive if the neck injury he suffered while at Washington is not an issue moving forward. The team found a potential steal in Mitchell, provided his game matures, while trading down for two Day 3 picks. Trading up for Gonclaves seemed unnecessary, though he should be at least a solid swing tackle; he's been recovering from a foot injury but said after the draft that he feels 100%. Bortolini looks like Ryan Kelly's heir apparent; he also has the experience, strength and athleticism to play guard until needed in the middle. Gould brings real value as a returner, especially with the new kickoff rules. Carlies moves from safety to linebacker for the Colts. Simpson could man corner or safety; the athletic defender played both spots in college. Abraham is the son of former NFL player Donnie Abraham and a tough-minded corner in his own right, but the team is still looking for depth at edge.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Trading down for three picks (including two mid-rounders in 2025) and still landing a downfield target like Thomas was a win for the Jaguars. Smith and Jones filled needs with good value in the second and third rounds, respectively. Calvin Ridley restarted his career in Jacksonville, but essentially renting the receiver in exchange for two picks (including a third-rounder this year) did not really pay off for the Jags. Foster provides depth at offensive tackle and could start in 2025 if Cam Robinson and Walker Little do not return. Defensive tackle Jefferson joined Smith in fortifying the defensive line. Prince is a great athlete at cornerback. Robinson will be a change-of-pace back and explosive returner. The team got backup quarterback Mac Jones for a sixth-round pick this offseason. Starting guard Ezra Cleveland was also acquired for a sixth-rounder last October; he re-signed in March.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "If you're wondering how the Chiefs stay on top, just look at this draft haul. Worthy is the sort of speedy difference-maker the Chiefs have searched for since trading Tyreek Hill away in 2022, and they did not give up much value to AFC rival Buffalo in the trade up to select him. They also did not have to reach for Suamataia, who should work himself into the lineup at tackle or guard if he's able to improve on his footwork. Wiley's potential as a mismatch against smaller defenders made him one of the top picks of the fourth round. Hicks joins past Chiefs picks L'Jarius Sneed and Chamarri Conner as yet another potential bargain defensive back in the fourth round. Nourzad could start at center or guard in the NFL. They'll be looking for corners, running backs and linebackers after the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Bowers was too strong a value to ignore and will be a nice third-down and red-zone option for whomever is quarterbacking the squad over the next decade. Powers-Johnson was also a good find in the mid-second at a position of need. Glaze will need to show he was picked at the right time by eventually earning a starting spot. Richardson is exactly the kind of NFL-sized, physical corner the Raiders required. Eichenberg will be a reliable inside player for many years. Laube was a nice pick in the sixth round who will get carries off the bench and be a special teams ace. No quarterback was selected to enter the competition between Aidan O'Connell and Gardner Minshew, so that position should be their top priority in rookie free agency.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Alt will doubtlessly be a good offensive tackle for the next decade or more, but Chargers fans will keep one eye on receiver Malik Nabers, who went sixth overall to the Giants, to see if he would have been a better pick. McConkey could quiet any such concerns with his quickness and excellent routes if able to stay health. Head coach Jim Harbaugh found a leader on defense in Colson, who played that role for Harbaugh at Michigan. Eboigbe fits as a rotational defensive lineman who gives full effort on each play. Hart and Still fulfill the team's need at corner for good value, and Rice (son of Hall of Famer Jerry Rice) and Johnson were needed for a thin receiver room. Vidal is a low-center-of-gravity back who could take over for departed veteran Austin Ekeler if veteran JK Dobbins is not ready to go following last year's torn Achilles.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The run on offensive players in Round 1 allowed the Rams to land a bargain edge rusher (which they really needed) in Verse, their first first-round pick since 2016. Fiske will help make up for the loss of Aaron Donald to retirement, but we'll have to see if it made sense to trade a 2025 second-rounder to acquire him instead of getting Michael Hall at their original pick (No. 52; he went to the Browns 54th overall). Corum will play bigger and faster than his numbers indicate, and Kinchens is a downhill player at a soft spot for the Rams. Jackson and Davis bolster the depth on the defensive line with former Florida State teammates Verse and Fiske. The Rams needed to find a kicker in his draft, and they chose Karty over Cam Little (who went to the Jags at No. 212). Limmer and Leveston should be long-time pros at center and guard, respectively. Rookie cornerbacks not drafted this weekend should be getting calls from the Rams.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Miami needed another edge rusher, especially with Jaelan Phillips coming off an Achilles injury and Bradley Chubb coming off a torn ACL, but Robinson must show he can be a factor in the run game and convert pressures into sacks more regularly in the NFL. Left tackle Terron Armstead's difficulty staying on the field made Paul a good pick in the second round. The teams' forfeiture of its third-round pick dragged down its grade. Trading a future third-round pick for a fourth in the current draft is usually not wise, and Miami has a few backs in the stable already, but finding a potential star in Wright waiting around made it easier to swallow. It would not surprise me if the relentless Kamara is as productive as Robinson early in his career. Both pass-catchers with the surname Washington (not related) will flourish as tough-minded slot receivers in Mike McDaniel's offense.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Vikings gave up pick value in 2023, Day 3 picks this year and much of their 2025 draft in moves that landed them McCarthy, tight end T.J. Hockenson (in a 2022 deadline deal with Detroit) and edge rusher Turner. McCarthy and Turner possess the skill set to make that investment worthwhile, though McCarthy will need to continue his winning ways at the next level and Turner must be an impact defender. Jackson is a Riq Woolen-type corner, long and quick-footed, who presents excellent value in the fourth round. Rouse is a strong, experienced lineman who takes over for departed veteran Oli Udoh as the swing tackle. Don't overlook Jurgens' chances of making the roster. Reichard is the FBS' all-time leading scorer, and the Vikings need a reliable field goal kicker; I'm interested in how his career compares with that of Cam Little, who was picked by the Jags with pick No. 212.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "New England needed a new signal-caller in the worst way. Refining Maye's skills could help the team compete in the AFC East over the next few seasons. The selections of Polk and Wallace addressed needs for the Patriots, but we'll see if staying put in the second round to take Ladd McConkey -- instead of trading down -- and focusing on a different position early in Round 3 would have been better choices. Robinson should have been a third-round pick, so I understood the selection, even after the team's investment in interior lineman in last year's draft. It would not surprise me if Baker turned out to be just as good as Polk in two years because of his ability to win downfield. The team picked the strong-armed but inconsistent Milton with the sixth-round selection it acquired from the Jaguars for Mac Jones.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New Orleans took a step forward in the NFC South race this weekend. Fuaga and the Saints seemed like a perfect pairing, with the nasty lineman fitting the team's mold and filling a big need. They traded up in Round 2 for McKinstry, a potential first-round value at a position where you can never have enough talent. Rattler will learn how to lead a team and take advantage of his physical gifts from a consummate professional in Derek Carr. He should compete against Jake Haener for the backup spot. Means is a tough receiver with athleticism and could fight for a roster spot. Ford's a pounder inside and I love Boyd's value in the sixth round. He can stuff run plays and get in the face of quarterbacks more often than you'd think.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Giants ignored the historic quarterback run early on to grab Nabers, an explosive receiver with a game similar to the team's 2014 first-rounder, Odell Beckham Jr. We'll see if sticking with Daniel Jones and Drew Lock instead of taking another QB was the correct move. Nubin and Phillips were fair value in the secondary, where the team needed more talent. Johnson will be an excellent fourth-round pick if he can fully translate his athleticism to the field. Tracy is an offensive weapon in the making, whether at running back or receiver. Muasau will be a starter in the league despite being picked in the sixth.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Even after picking up veteran tackles Tyron Smith and Morgan Moses this offseason, the Jets selected Fashanu to help protect Aaron Rodgers. They spent their second-rounder on Rodgers last year and moved up for the tough-running Corley to improve the talent surrounding the future Hall of Famer. The Jets did well picking up a 2025 third-rounder for one of their fourth-round selections. Adding in the big, nimble Allen to the backfield behind Breece Hall and Israel Abanikanda makes sense given how injuries have impacted depth at the position. I projected the Jets to bring in productive team leader Travis on Day 3, so trading up for him in the fifth wasn't surprising. Stiggers is a fantastic story, coming through the CFL to the NFL, and a competitive athlete outside.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Don't forget about the Eagles when identifying 2024 NFC title contenders, especially after this draft. Getting Mitchell to help the cornerback room without having to trade up was a major win. They moved up for DeJean like Detroit did for Brian Branch last year; I suspect he'll have a similar impact as a rookie. Hunt's potential on the edge was worth the third-round pick. The grade reflects the trade of this year's third-round pick for cornerback Kelee Ringo last year; the result is still uncertain. General manager Howie Roseman traded several times Saturday, flipping the script on last year's Ringo deal by getting 2025 third- and fifth-round selections. All-purpose back Shipley and receiver Smith will likely play on special teams and the offense as rookies. My favorite pick of the day was Roseman trading for Trotter, a fine player and legacy pick for the Eagles. McMahon could start at center this year if Cam Jurgens does not, and Keegan was a great pick late to add youth to the guard depth chart.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "It was just another value-filled draft for Pittsburgh. It was likely the Steelers would take offensive linemen on Day 1 or 2, and they found good value in Fautanu and Frazier. Both Wilsons selected on Day 2 were also fantastic finds and should make impacts in 2024 and beyond. The Steelers went O-line again on Day 3, getting McCormick at least a round later than I placed his value because of his toughness and athleticism. Lee is a nice sixth-round pick who will excel at 5-technique due to his strength and motor. Watts will get a chance to use his physicality in the secondary, though the team could have used an earlier pick at cornerback instead of picking three offensive linemen.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Pearsall's quickness and hands warranted first-round consideration, and the team needed a receiver with the potential trading away of Deebo Samuel or Brandon Aiyuk down the road. The 49ers could have also picked a cornerback or tackle at that spot. Green and Puni will contribute in areas of need, but trading up for Puni was a bit of a stretch. They did not re-sign Chase Young after sending a third to Washington at the deadline. Mustapha, picked with the selection gained from Dallas for quarterback Trey Lance, should see time on defense and special teams as a rookie. The 49ers hope to get more from Guerendo than recent running back picks Trey Sermon and Tyrion Davis-Price. Cowing is small but crafty, and Kingston's guard/tackle versatility makes him a valuable backup.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Murphy was always the pick for Seattle if available at No. 16 because of his ability to pressure quarterbacks and play the run. Haynes will start as a rookie for the Seahawks due to his athleticism and toughness. Re-upping defensive lineman Leonard Williams paid off the second-round investment in that trade with the Giants. Knight is the strong tackler the Seahawks needed in the middle of their defense, though others like Jeremiah Trotter Jr. were available. Barner is a reliable receiver and blocker who can replace Will Dissly. Pritchett should have been picked much earlier. Laumea played well at tackle but projects as a power blocker at guard. No edge rushers were selected, so I suspect a couple top undrafted free agents will be signed.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Barton's versatility, intelligence and toughness will make him one of the top linemen in this draft despite falling into the back part of the first round. Braswell met the team's need for an edge rusher but will need to prove he was worth his draft standing. Smith should contribute immediately, and McMillan could be a playmaker as his game matures. The Buccaneers could have picked Will Shipley over Irving, but the former Oregon Duck will compete for playing time with Chase Edmonds as a complementary back in 2024. Another interior lineman was picked in Klein, but no cornerbacks were brought on board.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "With Joe Alt off the board, the Titans picked the other top 10-caliber tackle. Latham's a wall on the outside who will excel on either side of the line. The team needed a big body like Sweat on the defensive line and chose him even after Sweat's recent DWI arrest; GM Ran Carthon said he discussed the incident with Sweat, and that Sweat \"accepted his responsibility.\" Tennessee will hope he can be dominant at the next level. The Titans' third-round pick was part of the package to move up for quarterback Will Levis last April. Gray's recognition skills and quickness make him a fit in the middle of Tennessee's defense. Brownlee has the talent to step into the fray as a rookie and earn a starting job down the line. Jackson's quickness helps fill two needs: depth at receiver and as a returner. Harrell should have been picked much earlier as an edge rusher, a spot where the Titans needed depth.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Commanders entered a new era with an excellent draft. Daniels could be an elite dual-threat playmaker if he becomes more efficient from the pocket. Newton is a force in the front four. Sainristil is a pain for opposing receivers to handle. Sinnott is an underappreciated receiving/blocking weapon. Coleman is a powerful guard/tackle. And McCaffrey is a reliable WR2 or WR3 option. Washington did not have a fourth-round pick after moving up to the third in the Sam Howell trade with Seattle. It found a future starting linebacker in Magee, whose explosiveness was underappreciated while he was playing at Temple. Hampton possesses a nice combination of size and quickness, and it won't be surprising if he plays as a rookie.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  }
]