[
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": null,
    "sourceName": "ESPN",
    "sourceUrl": "https://www.espn.com/nfl/draft2024/insider/story/_/id/40030429/2024-nfl-draft-grades-all-32-teams-mel-kiper-winners-losers-steals-sleepers-favorite-picks-classes",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This was largely a volume draft for the Cardinals. While Ossenfort didn't exactly manage value from start to finish, Arizona had a ton of needs, and with a bevy of prospects, it stands a good chance of filling a few of them before the end of training camp. Harrison was a slam-dunk pick at No. 4. The rest of the class appears more good than great.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "Either the Falcons believe they can chase a championship now or they don't. The draft did nothing to clarify how the franchise actually feels.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Overall, it was another solid draft for Eric DeCosta and the Ravens. Baltimore could have benefited from addressing the offensive interior early in the draft, but it did get some very good prospects who can become contributors over the next few seasons. The Ravens also avoided making a substantial reach at any one position of need. This class may not completely offset Baltimore's free-agent losses, but it should help ensure that the Ravens are back in the Super Bowl conversation for the 2024 season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Beane and the Bills purged some expensive veteran talent early in the offseason. While this draft class might not make Buffalo better than it was a year ago, it should help ensure that the team is again the AFC East favorites. It's a formula that has worked well for the AFC rival Kansas City Chiefs over the past few seasons. Only time will tell if it pays off for the Bills as well. Regardless, credit Buffalo for adding picks, still finding a No. 1-caliber receiver and finding solid value throughout the weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Carolina desperately needed to find new support pieces for Young. General manager Dan Morgan did a solid job of doing just that, especially considering he entered the weekend without a first-round selection. Brooks can become the long-term running back that Carolina currently lacks—the investment in Miles Sanders has yet to pay off—while Legette can develop into Young's No. 1 receiver of the foreseeable future.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Poles didn't enter the draft with a high volume of picks, but it's hard not to love what he did over the weekend. Odunze puts the finishing touches on the best supporting cast Chicago has given a quarterback in recent memory. Williams should put an end to the franchise's quarterback futility.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "As is often the case for the Bengals, Cincinnati largely approached the draft with the future in mind. That plan has helped the Bengals to maintain competitiveness over the past few years, but it's hard to believe it will make them more legitimate contenders in 2024. If this class pays off for Cincinnati, it's likely to happen a year or two down the road.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Cleveland didn't have a ton of draft capital, and its 2024 class won't generate many headlines. However, Berry and the Browns managed to come away with a handful of players who can stick with the franchise long-term.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "After watching Dallas draft primarily for the future in 2023 and get little out of its rookie class, this was a refreshing change of pace. The Cowboys took serious swings at their offensive line, which quickly became the team's biggest question mark after early free agency. It would have been wise to do a little more to address a mediocre run defense, and the Cowboys still lack a starting-caliber running back and reliable receiver depth. Viewing this in terms of being an 'all-in' draft for the 2024 season, though, Dallas could have done much worse.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Nix was drafted too highly. The fact that Denver felt pressured to get 'its guy' doesn't change that fact. Head coach Sean Payton may well develop him into a capable starter, but that doesn't mean that taking Nix in the top half of Round 1 was the right decision.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The bottom line is that Detroit entered draft weekend with one obvious need. General manager Brad Holmes addressed it with his first two picks without reaching for prospects who can't contribute early. The rest of Detroit's draft wasn't exactly filled with value, but again, the Lions are adamant about trusting their board.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Did Gutekunst get the most value with each of his selections? Probably not, but he did manage to address most of Green Bay's most notable needs.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "General manager Nick Caserio showed last year that he has an eye for players who fit Ryans' team. He found a few more of those prospects over the weekend, and the Texans exit the draft with few obvious needs.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "General manager Chris Ballard managed to find value throughout the draft while addressing a couple of key needs early. Indianapolis may have preferred to land one of the top pass-catchers at the very top of the draft. However, it still did a good job of improving Richardson's supporting cast while reloading a defense that ranked 28th in points allowed last season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "In all, this feels like a risky draft class for Jacksonville, and the roster doesn't feel stronger than it was at the end of last season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "General manager Brett Veach was aggressive early in the draft, but he landed a handful of prospects with the potential to become long-term pieces of Kansas City's championship puzzle. Worthy will grab most of the attention heading into the regular season, but don't be surprised if Suamataia and Wiley are extremely valuable pieces a couple of years from now.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Raiders deserve a ton of credit for not reaching on a quarterback and instead selecting a tight end with perennial All-Pro potential. Las Vegas also did a fine job of finding value throughout the draft, addressing some needs and setting itself up to make incremental progress in 2024. After years of questionable picks and substantial reaches, this draft class should be considered a win by Raiders fans.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New general manager Joe Hortiz did excellent work in finding players who will fit Harbaugh's plan for rebuilding the franchise. He did it without sacrificing value or failing to find players to develop for the future. The Chargers entered the draft as a team that had a franchise quarterback and a lot of question marks beyond that. They might not be ready to contend right away, but they took a big step toward developing a new identity with this year's draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "For a team that exceeded expectations last season and returned to playoff contention, it's impossible to dislike what the Rams did throughout draft weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "General manager Chris Grier added some fine players who should bolster all three phases. However, he may have prioritized value over need too much, and the Dolphins still have question marks along the offensive interior and in their secondary.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Using both first-round picks instead of flipping them both for McCarthy was a win for Minnesota.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Maye was the top signal-caller on our big board, and general manager Eliot Wolf was smart to secure him instead of trading the No. 3 pick. The Patriots also did a good job of supporting Maye throughout the draft.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "General manager Mickey Loomis essentially nailed his top three selections while finding some late depth. That should cause Saints fans to feel good about the 2024 draft, even though New Orleans didn't enter it with a high volume of picks.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "We'll likely look back on this draft and gauge it on New York's decision to stick with Jones for at least another season. The 2025 quarterback class isn't great, and contract cost is a poor reason to stick by an underwhelming signal-caller. However, general manager Joe Schoen landed a couple of potential long-term contributors at the top of the draft, including a receiver who may help usher in New York's next franchise quarterback.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Jets didn't have a ton of draft capital, and its 2024 class won't generate many headlines. However, Berry managed to come away with a handful of players who can stick with the franchise long-term. Some Jets fans may have preferred another offensive playmaker in Round 1, but working to protect Rodgers first was the right call. They'll still get their playmaker in Corley.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "It was another very strong draft for Roseman and the Eagles, with bargains through and through and multiple future starters likely in the mix.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "This was a masterful exercise in allowing the draft to develop while still marrying need with value.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Lynch might not have gotten the best value at the top of the draft, but he did address needs while fleshing out the roster in the later rounds. It wasn't a bad strategy for a team that came painfully close to winning the Super Bowl, even if it wasn't a home run draft overall.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Seahawks didn't do anything incredibly flashy over the weekend, but they managed to address a few critical needs early while also landing arguably the top defensive player in this class. With no second-round pick and a lack of late depth in this draft, Schneider should be commended for potentially coming out of it with a handful of potential future starters.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Tampa was a playoff team in 2023, albeit a flawed one. General manager Jason Licht did a lot of work to keep the roster together and did an even better job of strengthening it through the draft. The Falcons may be the new favorites in the NFC South due to their quarterback additions. However, the Bucs are well-positioned to stay at the top.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Latham addresses arguably the team's biggest need, but the Titans still have questions in the secondary and at edge-rusher. In a division with C.J. Stroud, Anthony Richardson and Trevor Lawrence, that's a problem. Sweat was a risky luxury pick who doesn't help Levis or a pass defense that ranked 23rd in net yards per pass attempt allowed last season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Everything will come down to Daniels for Washington. If he proves worthy of the No. 2 pick, no one will remember the rest of this class. If he struggles, it'll be fair to wonder if Washington could have done more to support him.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/10118547-2024-nfl-draft-grades-for-every-team",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "First-year general manager Adam Peters, who came over from San Francisco, nailed his first draft, starting with quarterback Jayden Daniels, who they took second overall. He will be a star. Peters kept going after that, loading up on good, talented players, many of whom I liked throughout the process.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Jayden Daniels",
        "grade": "A+",
        "gradeNumeric": 4.3,
        "text": "It was their first one, quarterback Jayden Daniels. I think he will be the best quarterback from this draft. They locked up a franchise passer with pick No. 2. He will be dynamic."
      },
      {
        "playerName": "Johnny Newton",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I liked all their second-round picks in defensive tackle Johnny Newton, corner Mike Sainristil and tight end Ben Sinnott."
      },
      {
        "playerName": "Mike Sainristil",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I liked all their second-round picks in defensive tackle Johnny Newton, corner Mike Sainristil and tight end Ben Sinnott."
      },
      {
        "playerName": "Ben Sinnott",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I liked all their second-round picks in defensive tackle Johnny Newton, corner Mike Sainristil and tight end Ben Sinnott."
      },
      {
        "playerName": "Luke McCaffrey",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I didn't love the pick of third-round receiver Luke McCaffrey, although he has talent and is improving. I think there were better options on the board -- like Troy Franklin -- when the pick was made."
      }
    ]
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Cardinals had a lot of ammunition with 12 picks and Monti Ossenfort used it well. I liked a lot of their picks, starting with receiver Marvin Harrison Jr., who is a much-needed, dynamic playmaker. They added a bunch of potential starters the rest of the way, giving this rising team a lot of talented players. They also added four defensive backs, which was a must.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Marvin Harrison Jr.",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I liked a lot of their picks, starting with receiver Marvin Harrison Jr., who is a much-needed, dynamic playmaker."
      },
      {
        "playerName": "Trey Benson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Loved the pick of running back Trey Benson in the third round. That is the right area to take a back, and Benson was my top-rated back. He will give them a nice 1-2 combo with James Conner."
      },
      {
        "playerName": "Tip Reiman",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of tight end/H-back Tip Reiman in the third round. He's a brute when it comes to blocking, so I get it, but if they needed a tight end I thought there were better options."
      }
    ]
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Chiefs had a good draft. They traded up to get receiver Xavier Worthy in the first, then did the same to take Suamataia in the second. Worthy will be a game changer for Patrick Mahomes. Taking two of my Better-Than team players makes this grade go up.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Xavier Worthy",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "They traded up to get receiver Xavier Worthy in the first, then did the same to take Suamataia in the second. Worthy will be a game changer for Patrick Mahomes."
      },
      {
        "playerName": "Kingsley Suamataia",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "I heard they really liked tackle Kingsley Suamataia from BYU, but I wasn't as high on him as others. He does fill a need and they didn't have to take him until the second, even though it was rumored he could go in the first."
      },
      {
        "playerName": "Jared Wiley",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I picked two because they drafted two of my Better-Than team members in the fourth round. They took tight end Jared Wiley and safety Jaden Hicks to add depth at two positions early in their careers and then they will be starters in a few."
      },
      {
        "playerName": "Jaden Hicks",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I picked two because they drafted two of my Better-Than team members in the fourth round. They took tight end Jared Wiley and safety Jaden Hicks to add depth at two positions early in their careers and then they will be starters in a few."
      }
    ]
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They took a lot of quality players, including three offensive linemen in their first five picks. It started with tackle Troy Fautanu in the first and then got Frazier in the second and guard Mason McCormick in the fourth. Wilson and third-round receiver Roman Wilson will play early.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Troy Fautanu",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It started with tackle Troy Fautanu in the first and then got Frazier in the second and guard Mason McCormick in the fourth."
      },
      {
        "playerName": "Zach Frazier",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Taking center Zach Frazier in the second round is a need pick, but I wasn't as high on him as some others. But who am I to question the Steelers when it comes to the center position?"
      },
      {
        "playerName": "Payton Wilson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love the pick of third-round linebacker Payton Wilson. He might have some medical issues, but the Steelers fans will come to love him and his style of play. He will start early."
      },
      {
        "playerName": "Roman Wilson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Wilson and third-round receiver Roman Wilson will play early."
      }
    ]
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "They finally had a first-round pick after not having one since 2016 and used it on edge Jared Verse. He fills a need and will be a tough, edge player. They followed that up by trading up to take Florida State defensive tackle Braden Fiske in the second. They gave up a lot to get him, so they must love him. Les Snead had another good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Jared Verse",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "They finally had a first-round pick after not having one since 2016 and used it on edge Jared Verse. He fills a need and will be a tough, edge player."
      },
      {
        "playerName": "Braden Fiske",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "They followed that up by trading up to take Florida State defensive tackle Braden Fiske in the second. They gave up a lot to get him, so they must love him."
      },
      {
        "playerName": "Blake Corum",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of running back Blake Corum in the third. They have a good back in Kyren Williams, who they got in the fifth round. They could have waited to take a back."
      },
      {
        "playerName": "Brennan Jackson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I loved the pick of Washington State defensive end Brennan Jackson in the fifth. He will bring a relentless style that will keep him in the league for a long time. He is perfect for the Rams defense."
      }
    ]
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "This draft will be all about how the Falcons play out the Cousins-Penix dynamic. They had a chance to get a much-needed edge rusher if they didn't take Penix. Trading up to get defensive tackle Ruke Orhorhoro in the second round was questionable as well. They did add some good players in third-round edge Bralen Trice and Dorlus.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Michael Penix Jr.",
        "grade": "C-",
        "gradeNumeric": 1.7,
        "text": "It's not that taking Michael Penix Jr. with the eighth overall pick was a bad move, but rather signing Kirk Cousins and then taking him was the bad move. If you liked him so much, don't sign Cousins."
      },
      {
        "playerName": "Ruke Orhorhoro",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Trading up to get defensive tackle Ruke Orhorhoro in the second round was questionable as well."
      },
      {
        "playerName": "Bralen Trice",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "They did add some good players in third-round edge Bralen Trice and Dorlus."
      },
      {
        "playerName": "Brandon Dorlus",
        "grade": "A-",
        "gradeNumeric": 3.7,
        "text": "Fourth-round defensive tackle Brandon Dorlus from Oregon has a chance to be an early rotation player. He's not huge at 6-3, 295, but he can push the pocket. He will be a steal in the Grady Jarrett mold."
      }
    ]
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Ravens and general manager Eric DeCosta are usually among the best in the league when it comes to drafting. This was a solid draft as usual, filling a bunch of needs. First-round corner Nate Wiggins should be a long-term starter. He can cover, but needs to work on tackling.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Nate Wiggins",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "First-round corner Nate Wiggins should be a long-term starter. He can cover, but needs to work on tackling."
      },
      {
        "playerName": "T.J. Tampa",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Fourth-round corner T.J. Tampa will prove to be really good pick. He can play the corner, but I also think he can move inside to safety. Versatility is huge in the Ravens defense."
      },
      {
        "playerName": "Devontez Walker",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Fourth-round wide receiver Devontez Walker can run, but he is inconsistent. If he can be more consistent and catch the ball better, he will be a steal. For now, it's risky."
      }
    ]
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I like the way general manager Brandon Beane managed his picks, moving down in the first round to add more ammunition. They still ended up with a good haul for a team that needed an influx of players, starting with second-round receiver Keon Coleman, a bigger target that was needed.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Keon Coleman",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "They still ended up with a good haul for a team that needed an influx of players, starting with second-round receiver Keon Coleman, a bigger target that was needed."
      },
      {
        "playerName": "DeWayne Carter",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Third-round defensive tackle DeWayne Carter is a bit undersized, but he will be a good player. They need rotation guys inside and he will fill that role early in his career."
      },
      {
        "playerName": "Cole Bishop",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love the pick of safety Cole Bishop in the second round. I know it helps to fill a need, but there were better options on the board when he went."
      }
    ]
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They didn't have a first-round pick -- traded away in the Young deal -- but they still ended up with one by trading up to land receiver Xavier Legette in the first round. They then moved around in the second and third to add extra picks, which I liked, and added good players like third-round linebacker Trevin Wallace and Sanders. Legette has to be Young's go-to guy.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Xavier Legette",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "They didn't have a first-round pick -- traded away in the Young deal -- but they still ended up with one by trading up to land receiver Xavier Legette in the first round."
      },
      {
        "playerName": "Jonathon Brooks",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I like Jonathon Brooks as a player, but why take a running back in the second round with so many other needs? The thinking is to probably help Bryce Young, but they had other needs."
      },
      {
        "playerName": "Trevin Wallace",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "They then moved around in the second and third to add extra picks, which I liked, and added good players like third-round linebacker Trevin Wallace and Sanders."
      },
      {
        "playerName": "Ja'Tavion Sanders",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Fourth-round tight end Ja'Tavion Sanders from Texas has the skills to be a big-time pass catcher. He isn't a blocking tight end, but even though he didn't time well him the 40, he plays fast."
      }
    ]
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting Williams and receiver Rome Odunze (ninth overall) will give the Bears a lot of firepower on offense. If Williams can seamlessly step in and be a good starter right away, the Bears will push for a division title. It would have been tough to mess this draft up with the first and ninth picks in the first round, but I didn't love what they did after that.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Caleb Williams",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Even though he wasn't my top quarterback, getting Caleb Williams with the first overall pick could change the fate of this franchise. He has all the tools to be a star and could be their first true star passer since Sid Luckman."
      },
      {
        "playerName": "Rome Odunze",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Getting Williams and receiver Rome Odunze (ninth overall) will give the Bears a lot of firepower on offense."
      },
      {
        "playerName": "Tory Taylor",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "They took a punter in the fourth round in Iowa's Tory Taylor. Why? There are a million punters out there. Plus, that is a luxury pick for a team with only four picks."
      }
    ]
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Duke Tobin has done a nice job drafting for the Bengals and this is a nice group -- and could be a great one. The risk is first-round offensive tackle Amarius Mims, who has just eight starts in his career. He is a boom-or-bust player in my book. Taking Kris Jenkins and Jackson will help offset the loss of D.J. Reader in free agency.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Amarius Mims",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "The risk is first-round offensive tackle Amarius Mims, who has just eight starts in his career. He is a boom-or-bust player in my book."
      },
      {
        "playerName": "Kris Jenkins",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Taking Kris Jenkins and Jackson will help offset the loss of D.J. Reader in free agency."
      },
      {
        "playerName": "McKinnley Jackson",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Third-round defensive tackle McKinnley Jackson has run-stuff skills that can help on the inside of their defense. He has the size at 6-2, 325 to be a power player inside, but he has to be more consistent."
      },
      {
        "playerName": "Jermaine Burton",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "Third-round receiver Jermaine Burton from Alabama has the tools to be a big-time player. But there were reportedly some character questions about him. If he's focused, he will be a good receiver."
      }
    ]
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "They didn't have a first-round pick -- sent to the Texans for Deshaun Watson -- so they had to wait until until the 22nd pick of the second round to make a pick. That pick was Michael Hall Jr., a defensive tackle from Ohio State. He's a good player. The rest of the draft was just OK.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Michael Hall Jr.",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "That pick was Michael Hall Jr., a defensive tackle from Ohio State. He's a good player."
      },
      {
        "playerName": "Zak Zinter",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love guard Zak Zinter, their third-round pick. He is also coming off a broken leg suffered last season. But the Browns do seem to know a thing or two about developing guards."
      },
      {
        "playerName": "Jamari Thrash",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fifth-round receiver Jamari Thrash is a good route runner who is a physical to give them a young weapon to add to their group. He will make the team."
      }
    ]
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "I thought the Cowboys had a solid draft. Trading down and adding an extra pick and taking tackle Tyler Guyton in the first was a hit. He will start as a rookie and has the tools to do so. They added some good football players the rest of the way, guys like Beebe and Wake Forest corner Caelen Carson (fifth). It wasn't splashy, but it was solid.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Tyler Guyton",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "Trading down and adding an extra pick and taking tackle Tyler Guyton in the first was a hit. He will start as a rookie and has the tools to do so."
      },
      {
        "playerName": "Marshawn Kneeland",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of defensive lineman Marshawn Kneeland in the second. He's a power end who plays hard, but I think they had better options."
      },
      {
        "playerName": "Cooper Beebe",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Third-round offensive lineman Cooper Beebe can play anywhere on the line, although I think he will be an inside player for Dallas. Beebe played tackle at Kansas State."
      },
      {
        "playerName": "Caelen Carson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "They added some good football players the rest of the way, guys like Beebe and Wake Forest corner Caelen Carson (fifth)."
      }
    ]
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "This draft will be defined by how well Nix plays. If Nix is starting for Payton in three years, it will be a great pick. Otherwise, Payton's job could be tied to him. At least they got Franklin in the fourth. Fifth-round corner Kris Abrams-Draine from Missouri has talent.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Bo Nix",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "It's not that they drafted Nix with the 12th overall pick, but rather why not trade back and take him? Nix has talent and Sean Payton knows quarterbacks, but this one will be fun to watch."
      },
      {
        "playerName": "Troy Franklin",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love fourth-round receiver Troy Franklin. He is a player who will add speed to the offense and he's joining former teammate Bo Nix, the Broncos' first-round pick. I don't know why he went in the fourth because he's better than that."
      },
      {
        "playerName": "Kris Abrams-Draine",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fifth-round corner Kris Abrams-Draine from Missouri has talent."
      }
    ]
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They landed one of the best corners in the draft in the first round in Terrion Arnold, then came back and used a second-round pick on corner Ennis Rakestraw Jr. from Missouri. That's good drafting, addressing need with two players who will be starters at some point -- one this season. I love Vaki and sixth-round defensive tackle Mekhi Wingo has some good tape.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Terrion Arnold",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "They landed one of the best corners in the draft in the first round in Terrion Arnold, then came back and used a second-round pick on corner Ennis Rakestraw Jr. from Missouri."
      },
      {
        "playerName": "Ennis Rakestraw Jr.",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "They landed one of the best corners in the draft in the first round in Terrion Arnold, then came back and used a second-round pick on corner Ennis Rakestraw Jr. from Missouri."
      },
      {
        "playerName": "Sione Vaki",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Fourth-round safety-running back Sione Vaki was the captain of my Better-Than team. He is a tough, physical player who can be a starting safety, but also a major contributor on special teams. He also has played running back."
      },
      {
        "playerName": "Mekhi Wingo",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I love Vaki and sixth-round defensive tackle Mekhi Wingo has some good tape."
      }
    ]
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Packers do a nice job with the draft, and this one will give them some players who could start as rookies. The Packers clearly drafted for need, landing Morgan, Cooper and second-round safety Javon Bullard. Running back MarShawn Lloyd will be a nice addition to the offense behind Josh Jacobs. Quarterback Michael Pratt in the seventh is a nice pick, even if he won't play other than for injury.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Jordan Morgan",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of Jordan Morgan in the first. I know they need line help, more for depth, but I am not a huge fan of Morgan's game."
      },
      {
        "playerName": "Edgerrin Cooper",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Second-round linebacker Edgerrin Cooper will pay off in a big way. He can fly and will add a ton of speed on the second level for the Packers."
      },
      {
        "playerName": "Javon Bullard",
        "grade": "B+",
        "gradeNumeric": 3.3,
        "text": "The Packers clearly drafted for need, landing Morgan, Cooper and second-round safety Javon Bullard."
      },
      {
        "playerName": "MarShawn Lloyd",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Running back MarShawn Lloyd will be a nice addition to the offense behind Josh Jacobs."
      },
      {
        "playerName": "Michael Pratt",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Quarterback Michael Pratt in the seventh is a nice pick, even if he won't play other than for injury."
      }
    ]
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "After having a great draft last year, I didn't love this year's version. They didn't have a first-round pick -- traded to Minnesota -- and then they picked a tackle in Blake Fisher (who won't start) and two secondary players who probably won't start with their next two picks. Hard to doubt Nick Cesario after last year, but I will for this draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Blake Fisher",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "They didn't have a first-round pick -- traded to Minnesota -- and then they picked a tackle in Blake Fisher (who won't start) and two secondary players who probably won't start with their next two picks."
      },
      {
        "playerName": "Kamari Lassiter",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't like the pick of corner Kamari Lassiter in the second round. I think there were better options there when he went, guys like Mike Sainristil. He ran 4.64 at his pro day, which is not great for a corner."
      },
      {
        "playerName": "Calen Bullock",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Third-round safety Calen Bullock is a rangy safety who will give them depth this season, but will eventually become a starter. He can run."
      }
    ]
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I liked the Colts' first four picks, but I would have taken Dallas Turner at No. 15 rather than Laiatu Latu, the pass rusher the Colts took. Latu does fill a need. Mitchell might end up being a steal. He is big and can run. The Colts had a good, solid haul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Laiatu Latu",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I liked the Colts' first four picks, but I would have taken Dallas Turner at No. 15 rather than Laiatu Latu, the pass rusher the Colts took. Latu does fill a need."
      },
      {
        "playerName": "Adonai Mitchell",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love the pick of receiver Adonai Mitchell in the second. He is a tall, fast receiver who will give them a nice addition to Michael Pittman and Josh Downs."
      },
      {
        "playerName": "Matt Goncalves",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I like third-round offensive lineman Matt Goncalves from Pittsburgh, but he went a round or two too high. He will be a backup early in his career and might end up being a guard."
      }
    ]
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I have been critical of Trent Baalke's drafts in the past, but this was a good one. First-round receiver Brian Thomas Jr. gives them a game-changer on offense that they've lacked, while Smith can be a beast up front. Trading down and adding picks in this draft and next year's draft was a smart move by Baalke.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Brian Thomas Jr.",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "First-round receiver Brian Thomas Jr. gives them a game-changer on offense that they've lacked, while Smith can be a beast up front."
      },
      {
        "playerName": "Maason Smith",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love second-round defensive tackle Maason Smith from LSU. His skill set is impressive. A torn ACL in 2022 set him back, but he started to look like himself late last season. He can be dominant."
      },
      {
        "playerName": "Myles Cole",
        "grade": "D",
        "gradeNumeric": 1,
        "text": "The knock is they didn't address edge until the seventh round when they took Myles Cole from Texas Tech. They have depth issues there and that could show up if they have injuries to their starters."
      }
    ]
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They didn't get a chance to take one of the top quarterbacks since they were all gone, so they took Bowers. Like I said, good player, but needed other positions. Oregon center Jackson Powers-Johnson came in the second, and he is moving to guard. I didn't love fourth-round tackle Delmar Glaze.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Brock Bowers",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I think tight end Brock Bowers is a good player, but why take him when you took Michael Mayer last year and he flashed big time late last season? They had other needs. This was a luxury pick."
      },
      {
        "playerName": "Jackson Powers-Johnson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Oregon center Jackson Powers-Johnson came in the second, and he is moving to guard."
      },
      {
        "playerName": "Decamerion Richardson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fourth-round corner Decamerion Richardson from Mississippi State is a long corner who can play man coverage and will compete for playing time right away. He's a good corner and the Raiders need one to emerge."
      },
      {
        "playerName": "Delmar Glaze",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love fourth-round tackle Delmar Glaze."
      }
    ]
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They took tackle Joe Alt in the first round with the fifth overall pick, passing on taking a receiver to do so. Alt will play right tackle, which will be an adjustment for him. It's a solid pick, rather than sexy. That's the Harbaugh way. I think second-round receiver Ladd McConkey can start right away.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Joe Alt",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "They took tackle Joe Alt in the first round with the fifth overall pick, passing on taking a receiver to do so. Alt will play right tackle, which will be an adjustment for him. It's a solid pick, rather than sexy."
      },
      {
        "playerName": "Ladd McConkey",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I think second-round receiver Ladd McConkey can start right away."
      },
      {
        "playerName": "Junior Colson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round linebacker Junior Colson reunites with college coach Jim Harbaugh and he will be a starter early in his career. He is a tough, physical player who can run and cover as well as play the run."
      },
      {
        "playerName": "Justin Eboigbe",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of Alabama defensive tackle Justin Eboigbe in the fourth round. They've had trouble stopping the run, and he's good against the run, but that's high for him in my book."
      }
    ]
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Many will question their first two picks -- tackle Patrick Paul was the second-round pick -- but not me. I love Robinson and Paul was on my Better-Than team. He might not start right away, but Terron Armstead is up in the years and missed seven games last season. They added a bunch of other good players.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Chop Robinson",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It was their first one, edge Chop Robinson. He didn't have a lot of sack production, but he can get after the quarterback. He has an explosive first step and helps fill a need with their two top edge players coming off injury."
      },
      {
        "playerName": "Patrick Paul",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "I love Robinson and Paul was on my Better-Than team. He might not start right away, but Terron Armstead is up in the years and missed seven games last season."
      },
      {
        "playerName": "Jaylen Wright",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "In my view, they really didn't have one. I liked every one of their picks, but they gave up a 2025 third-round pick to take running back Jaylen Wright. I know he's fast, and we know they love speed, but that's rich after taking De'Von Achane last year."
      }
    ]
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Like all the teams that took quarterbacks, their drafts will be defined by how well they play. That's the Vikings with McCarthy. Even if Turner becomes a true star, which I think he will, this draft is about McCarthy. Period. They also traded a lot of future picks to get McCarthy and Turner, so they better be stars.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Dallas Turner",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "The Vikings moved up in the first round to take pass rusher Dallas Turner. That was a good move. He will be a big-time rusher in Brian Flores' scheme. Turner's best pass-rushing days are ahead of him."
      },
      {
        "playerName": "J.J. McCarthy",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I get the whole idea of finding a quarterback, and landing J.J. McCarthy where they did makes sense, but I don't love his game. He just shot up boards after the season, and I never saw it. I thought he would be a late first-round pick."
      }
    ]
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "It doesn't matter what else the Patriots do in the draft, this one will be defined by taking North Carolina quarterback Drake Maye with the third overall pick. If he's a star, this draft will be special. If not, it won't be. I like his game, but it might take time. The cast around him isn't great.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Drake Maye",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "It doesn't matter what else the Patriots do in the draft, this one will be defined by taking North Carolina quarterback Drake Maye with the third overall pick. If he's a star, this draft will be special. If not, it won't be. I like his game, but it might take time. The cast around him isn't great."
      },
      {
        "playerName": "Caedan Wallace",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Third-round tackle Caedan Wallace from Penn State started for four years, but he was drafted a bit too high. Some teams think he might have to go inside to guard."
      },
      {
        "playerName": "Javon Baker",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fourth-round receiver Javon Baker will help the passing game right away. He is already squawking about teams passing on him. I love that attitude -- and he plays with it, too."
      }
    ]
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They addressed major problems with their first two picks, taking tackle Taliese Fuaga in the first round and then McKinstry in the second. Fuaga will be a plug-and-play starter, while McKinstry could start. Means and fifth-round quarterback Spencer Rattler are nice value picks.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Taliese Fuaga",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "They addressed major problems with their first two picks, taking tackle Taliese Fuaga in the first round and then McKinstry in the second. Fuaga will be a plug-and-play starter, while McKinstry could start."
      },
      {
        "playerName": "Kool-Aid McKinstry",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I actually liked all their picks. I think they had a good draft. If I had to pick one to question it would be corner Kool-Aid McKinstry in the second round since he's coming off a foot injury."
      },
      {
        "playerName": "Bub Means",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fifth-round receiver Bub Means is a long receiver who can run. With a little polish in terms of his route running, Means can become a nice addition to their offense when it comes to the deep ball."
      },
      {
        "playerName": "Spencer Rattler",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Means and fifth-round quarterback Spencer Rattler are nice value picks."
      }
    ]
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Giants made the decision to pass on a quarterback to take Nabers. They supposedly tried to move up to get Drake Maye, but when they didn't they passed on McCarthy to take Nabers. Smart move. The rest of the draft was just OK in my book, but keep an eye on fourth-round tight end Theo Johnson.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Malik Nabers",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It was their first one, receiver Malik Nabers. Some will say they should have taken quarterback J.J. McCarthy in that spot, but I like taking the best receiver in the draft. Nabers will be special."
      },
      {
        "playerName": "Tyler Nubin",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love the pick of safety Tyler Nubin in the second. I think there were better safeties available when they took Nubin."
      },
      {
        "playerName": "Theo Johnson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "The rest of the draft was just OK in my book, but keep an eye on fourth-round tight end Theo Johnson."
      }
    ]
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "By taking tackle Olu Fashanu, the Jets did the right thing. But it sure didn't look like an all-in move for Rodgers since Fashanu is going to likely sit for a year. Corley will be a nice pick, but this wasn't a great draft for immediate help.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Olu Fashanu",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "By taking tackle Olu Fashanu, the Jets did the right thing. But it sure didn't look like an all-in move for Rodgers since Fashanu is going to likely sit for a year."
      },
      {
        "playerName": "Malachi Corley",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round receiver Malachi Corley will come in and immediately help the passing game. He is a strong player after the catch. Aaron Rodgers had to be happy with that pick."
      },
      {
        "playerName": "Braelon Allen",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't like using the fourth-round pick on running back Braelon Allen. They have Breece Hall and could have used it on maybe a tight end or an offensive lineman. They also took a back later in the draft."
      }
    ]
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "General manager Howie Roseman usually likes to trade up on draft night, but he refrained from that in the first round and it worked by landing Mitchell. He did trade up in the second to land corner-safety Cooper DeJean. In fact, he made eight trades enhancing his reputation as the trader GM. The best thing is a team problem in coverage last year likely got fixed with the first two picks.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Quinyon Mitchell",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Rather than panicking and trading up, they stayed put and landed the top cover corner in the draft in Quinyon Mitchell in the first round. It was a gamble that paid off."
      },
      {
        "playerName": "Cooper DeJean",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "He did trade up in the second to land corner-safety Cooper DeJean."
      },
      {
        "playerName": "Jalyx Hunt",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "Third-round edge Jalyx Hunt has some explosive ability, but he probably went a little higher than I would have taken him. He will take some time. But the Eagles clearly know he is a developmental player."
      }
    ]
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The 49ers clearly are drafting for the future with Pearsall in the first -- or readying to trade one of their starters, either Brandon Aiyuk or Deebo Samuel. Third-round offensive lineman Dominick Puni could develop into a starter -- probably at guard. Green will be good value, while fourth-round receiver Jacob Cowing could be a sleeper.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Ricky Pearsall",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "First-round receiver Ricky Pearsall will be a good player, but I don't think he will ever be a star. There were better receivers left when they took him late in the first round."
      },
      {
        "playerName": "Renardo Green",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Second-round corner Renardo Green fills a need and might be able to be their corner right away. Green had just one pick in college, but he is a playmaker and would fit in their scheme."
      },
      {
        "playerName": "Dominick Puni",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Third-round offensive lineman Dominick Puni could develop into a starter -- probably at guard."
      }
    ]
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Murphy will be a star, which will make this draft a hit down the road. But the rest of it was just OK for me. I do like third-round guard Christian Haynes, who fills a need.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Byron Murphy",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It was their first pick, defensive tackle Byron Murphy. He has the tools to be a dominant inside player. He will be a lot like Baltimore's Justin Madubuike for Seattle."
      },
      {
        "playerName": "Christian Haynes",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I do like third-round guard Christian Haynes, who fills a need."
      },
      {
        "playerName": "AJ Barner",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "I didn't love the pick of tight end AJ Barner in the fourth. There were better options on the board at that spot in my mind, including Jared Wiley, who was taken 10 picks later by the Chiefs. Barner can block, but Wiley can catch."
      }
    ]
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They did a nice job landing good players and also filling needs. It started with first-round guard-center Graham Barton, who will likely be the starting center. Braswell was picked for need and will be a rotation player early. I do like McMillan and fifth-round running back Bucky Irving.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "Graham Barton",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "It started with first-round guard-center Graham Barton, who will likely be the starting center."
      },
      {
        "playerName": "Chris Braswell",
        "grade": "C+",
        "gradeNumeric": 2.3,
        "text": "I didn't love the pick of Chris Braswell in the second. I know they need pass-rush help, but this was a little high for Braswell in my book."
      },
      {
        "playerName": "Jalen McMillan",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Third-round receiver Jalen McMillan will prove to be a major steal. He was Washington's leading receiver in 2022, with more catches than Rome Odunze, who went ninth in this draft. McMillan will become a good slot receiver."
      },
      {
        "playerName": "Bucky Irving",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "I do like McMillan and fifth-round running back Bucky Irving."
      }
    ]
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting tackle JC Latham in the first round will pay off in a big way. He will be their starting left tackle for a long time. The Swift pick is feast or famine. Brownlee will prove to be a steal and sixth-round receiver Jha'Quan Jackson can fly and will help the return game.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2024-grades-for-all-32-teams-including-best-and-worst-picks-commanders-receive-only-a/",
    "playerGrades": [
      {
        "playerName": "JC Latham",
        "grade": "A",
        "gradeNumeric": 4,
        "text": "Getting tackle JC Latham in the first round will pay off in a big way. He will be their starting left tackle for a long time."
      },
      {
        "playerName": "T'Vondre Sweat",
        "grade": "C",
        "gradeNumeric": 2,
        "text": "T'Vondre Sweat is a risky pick, especially in the second round. He had a DUI earlier in the draft cycle and his weight was a problem at Texas. He needs to get in better shape or this will be a pick that backfires on them. He does have talent."
      },
      {
        "playerName": "Jarvis Brownlee Jr.",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Fifth-round corner Jarvis Brownlee Jr. will be a nickel starter at some point in his career. Brownlee is a smallish corner, but he can cover."
      },
      {
        "playerName": "Jha'Quan Jackson",
        "grade": "B",
        "gradeNumeric": 3,
        "text": "Brownlee will prove to be a steal and sixth-round receiver Jha'Quan Jackson can fly and will help the return game."
      }
    ]
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "This draft went about how most people expected. The Cowboys got a potential Tyron Smith replacement in the first round, added front seven help and got depth on the offensive line. This draft might not have huge immediate returns for the Cowboys, but they made some strong dice rolls on future starters. The team sits in limbo as Jerry Jones decides what he wants to do next with his franchise, making this an important draft for the Cowboys to nail.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Giants wanted a quarterback, but they still came away with a solid group of players despite not taking one. Malik Nabers is the receiver they've needed for quite some time and they found a solid replacement for Xavier McKinney in Tyler Nubin. Theo Johnson is a smart draft pick in response to Darren Waller being unsure about his playing future. The Giants might not have been able to make the splash they wanted but they should feel good about where they stand.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Eagles played the draft so well. They let Quinyon Mitchell fall right into their lap with the 22nd overall pick and he has all the tools necessary to be a CB1 in the NFL. Then, they jumped back up in Round 2 to grab the falling Cooper DeJean. Taking swings on Ainias Smith and Johnny Wilson on the third day of the draft might work for them and they made the feel-good selection of Jeremiah Trotter Jr. They also added a couple picks in 2025, including a future third-round selection from the Dolphins. Well played, Howie Roseman.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It's a new day for the Commanders. They have a new franchise quarterback, a couple impact defenders and even a freak athlete on the offensive line to develop. The Jayden Daniels pick is risky based on his prospect profile, but he still should be a drastic upgrade over what they had in Sam Howell last season. This class hinges on Daniels being a top-tier starter, but they did grab some solid players in the draft. This draft class should make fans feel more hopeful after a shaky free agency period.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "You made it, Bears fans. A quarterback prospect who has real deal superstar upside is here. Caleb Williams has all the talent in the world to finally be the dynamic passer the Bears have been waiting for — and he is set up well for success. They drafted Rome Odunze with their second top-10 pick and a developmental tackle in the third round with Kiran Amegadjie. Even their fifth-round selection of Austin Booker was quality! This draft class can be so impactful that it gets an A even with picking a punter in the fourth round.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Detroit made some great picks in the first two rounds of the draft and some risky ones to kick off Day 3. They accomplished their goal of getting better at cornerback this offseason, now featuring a completely revamped room as Terrion Arnold and Ennis Rakestraw Jr. will join Carlton Davis in Detroit. The Lions even got a couple sixth-rounders with potential to close out their day. It's really just the selections in the fourth round that are giving a bit of pause here.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Packers made a ton of draft picks and came out looking pretty good. Their linebacker picks were questionable (although the entire linebacker class was down this year), but they found a potential franchise left tackle in Jordan Morgan at the end of the first round. They took three safeties as well and might have a tough, versatile duo now between Javon Bullard and Xavier McKinney. MarShawn Lloyd is a quality addition at running back while they test Josh Jacobs for at least a season.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Vikings went all in and got their quarterback and edge rusher of the future. Whew. As a result, they barely have any 2025 picks. They do have some talented prospects at key positions to build around. J.J. McCarthy and Dallas Turner can be solid NFL players, but the Vikings paid a high price to attain them. Right now, the only top-100 pick they're slated to have in 2025 is their first-round pick (with at least one third-round compensatory pick coming their way for Kirk Cousins). This better work!",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "D-",
    "gradeNumeric": 0.7,
    "text": "Baffling. Pretty baffling use of the eighth overall pick. After signing Kirk Cousins, it was a bit of a shocker for the Falcons to use the pick on a backup quarterback rather than take someone who can play this year. Unless the Cousins signing is a total disaster, it will be years before the Falcons see Michael Penix Jr. on the field. This team is not ready for a resource allocation like that. The Falcons also failed to grab a cornerback in this draft, but they made some very solid picks along the defensive line that should help them finally stabilize that position group. The defensive line picks are the only thing keeping this from being an F grade.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Panthers took some risks in this draft class. It's hard to say whether it's bad or good because making risky draft picks is not inherently a bad thing. Carolina decided to spend its picks taking home-run swings that have low floors and big upside. The gambles are fun, but the Panthers' early draft picks have shaky profiles in one way or another. Even though they're getting a C, it's hard not to be caught by the allure of the unknown here. It's a really interesting class.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "All those trades in the past left the Saints with only two picks in the top 100 of the draft and they went over 100 selections in between their own picks at one point. Still, the Saints grabbed an immediate starter at guard or tackle in Taliese Fuaga. He is another member of an extremely talented offensive line class that should have success in the NFL. The Saints grabbed a starting-caliber cornerback in Kool-Aid McKinstry and a developmental option at quarterback in Spencer Rattler. For as few draft assets as they came into the draft with, the Saints fared pretty well.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Really solid draft for the Buccaneers. Offensive lineman Graham Barton is one of the cleanest prospects in the draft and can play all five positions up front. This is a terrific player to pair with Tristan Wirfs. The Bucs also grabbed a solid wide receiver prospect in Jalen McMillan and a quality running back in Bucky Irving. How linebacker Chris Braswell and defensive back Tykee Smith develop will be important for the overall impact of this draft class. This is a nice haul for the Buccaneers.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Shoutout to Arizona for not overthinking it. Grab the best player in the draft and keep it moving. They took some chances with the selections of Max Melton, Trey Benson and Xavier Thomas, giving them more credible prospects to continue this rebuild. The Cardinals might not win the division this season, but this draft class should help them get to competing for the playoffs soon, especially if Kyler Murray can build on his late-season resurgence.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "This was a safe, logical draft for the Rams, which makes sense for where they are now. They beefed up their defensive line, added a quality back and also a much-needed safety within the top 100 picks. There isn't a lot of big upside here, but most of these players should have high floors for the NFL. It's hard to see this draft class failing for the Rams, but they might not have true star power here.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Weird draft class for the 49ers, but it might not matter. They've turned a former \"Mr. Irrelevant\" into one of the most productive quarterbacks in the NFL. Ricky Pearsall was a surprise and head coach Kyle Shanahan made his patented mid-round running back pick. Yet it's hard to look at a draft class that has Pearsall as a first-round selection and feel super great about it. Dominick Puni is a name to watch for them as a long-term developmental offensive guard. He's has the movement skills Shanahan likes in his linemen.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Mixed feelings is the best way to describe the Seahawks' draft. They grabbed a potentially disruptive defensive lineman in Byron Murphy II — a piece they desperately needed. They also found someone who can compete for a starting role on the offensive line with Christian Haynes in the third round. Still, their Day 3 picks leave a bit to be desired, especially with no second-round pick this year due to the Leonard Williams trade.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Bills played this draft safe and took home 10 players, although only one wide receiver in Keon Coleman. Even though Coleman didn't have the cleanest end to his season and a slow 40-yard dash time at the scouting combine, he still has shown serious talent in college football. Coleman will start right away for the Bills and will immediately have a chance to prove whether he can separate from NFL cornerbacks. The Bills had another solid pickup in Ray Davis, but other than that this draft class was just fine. Probably not too many movers and shakers, but some quality players at positions of need. It will be interesting to see what happens with Travis Clayton, a developmental offensive line prospect from England.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "It's a strong draft haul for the Dolphins. They found a potential 10-sack edge rusher with Chop Robinson in the first round and grabbed a future starter at offensive tackle with Patrick Paul. Their trade-up for Jaylen Wright in the fourth was perplexing. Overall this is still a good group of players. Malik Washington and Tahj Washington are two wide receivers who had a lot of buzz in college and could compete for reps behind Tyreek Hill and Jaylen Waddle.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New England had a tough decision to make on how it wanted to start its rebuild and it ultimately turned down a boatload of draft picks to stay at the top of the draft and pick Drake Maye. Maye has ridiculous upside and gives the Patriots a playmaking option while they fill out the rest of their roster. Ja'Lynn Polk and Javon Baker should compete for starting reps in one of the weaker wide receiver rooms in the league. Joe Milton III is an intriguing pick in the sixth round and it'll at least be fun to track his development. If just one of their offensive line picks hit, this could be the foundation for a new run of excellence in New England.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Jets didn't have a ton of draft capital to work with, but they still found some quality players, including a potential franchise tackle in Olu Fashanu from Penn State. He'll be a fixture up front for a long, long time if the injury issues from last season don't reappear. Wideout Malachi Corley will make fans happy early with his ability to run after the catch and Braelon Allen is a talented running back to develop behind Breece Hall. The trade up for QB Jordan Travis was baffling, but that was in the fifth round so no need to ding too much in the grand scheme of things.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Once again, the Ravens walked away with a strong draft class after letting players fall right into their laps. They started things off with Clemson cornerback Nate Wiggins and doubled back at the position with a potential huge steal by grabbing Iowa State cornerback T.J. Tampa in the fourth round. Tampa was projected to go much higher. The Ravens should also have a Day 1 starter at right tackle in Roger Rosengarten from Washington. They even found some quality depth they can develop on the edge with Penn State's Adisa Isaac. The Ravens, as usual, didn't overthink it and it looks like a great new crop of rookies.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bengals should be happy with how they played the first two days of the draft. Amarius Mims has the ability to be a decade-long starter at either tackle spot — if he can stay on the field. Kris Jenkins is a quality body on the defensive line and Jermaine Burton is an explosive playmaker who gives the Bengals flexibility at wide receiver. McKinnley Jackson might have been a reach to close the third round but the Bengals walked away with immediate impact and long-term potential at key spots.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Browns didn't make their first pick until nearly the end of the second round, taking ultra-athletic defensive tackle Michael Hall Jr. from Ohio State. They added offensive line depth, picked a wide receiver and found some dart throws on defense in the sixth and seventh rounds. You can't be too mad given the amount of capital they held walking into the draft.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Steelers looked at their offensive line from last year and emphatically said \"never again!\" Their two first draft picks were on the o-line and then they came back for a third time to kick off the fourth round. Payton Wilson has his concerns in terms of injury, but he was a great playmaker for NC State. Getting him with the 98th overall pick is a great spot for Pittsburgh. Quarterback will be the ultimate decider in how the Steelers' season turns out, but they may have found two impact starters on the offensive line in Troy Fautanu and Zach Frazier.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Jaguars' offseason has been just OK and the draft followed suit. They did a great job moving down from their original spot in Round 1 of the draft while still landing a big-time wide receiver prospect, which they needed after clumsily letting Calvin Ridley walk to a divisional rival in free agency. Beyond that, it doesn't seem like they got too much positive impact, but if Thomas is the final key that allows the Jaguars' passing game to be consistent in the future, it's fine. Getting Trevor Lawrence another receiver was priority No. 1 and they might have gotten the best of the second wave of wide receivers.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Texans didn't have a first-round pick, but they still grabbed a few quality players, including a starting nickel corner and developmental offensive tackle. Their first four picks have a chance to be immediate contributors, which is all you can ask for without a pick on the first day. It's not the sexy draft that the Texans had last year when they nabbed C.J. Stroud and Will Anderson Jr., but it's a draft that will help strengthen the team's foundation.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Titans nailed their first pick, but could have done better the rest of the way. JC Latham is a \"set it and forget it\" type of offensive tackle who is already penciled in as a starter. It'll be interesting to see how Latham handles being a left tackle in the NFL. He has enough talent to be successful. Getting Cedric Gray in the fourth round could be a long-term steal for the Titans, but overall it wasn't a draft class to get excited about unless T'Vondre Sweat develops into a pass rusher.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This was a productive draft class for the Colts. They found the edge rusher they needed in Laiatu Latu and may have gotten a steal with the Adonai Mitchell pick in the second round. Depth along the offensive line was a need they filled as well and Anthony Gould in the fifth round may be a steal at wide receiver. If Anthony Richardson can stay healthy and build on what he accomplished as a rookie, the Colts might be able to actually get into the playoffs with the additions in this draft class.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "Sorry, Broncos fans. There's no other way to slice this. The Broncos made some fantastic selections on the second and third days of the draft, but taking Bo Nix with the 12th overall pick is a head-scratcher. Nix wasn't a prospect who was highly in demand and his ceiling appears limited in the NFL. Nix should win the starting job over Jarrett Stidham and Zach Wilson, but Nix will need to develop a level of playmaking that wasn't really there on his college tape. Maybe head coach Sean Payton is right and he can make Nix the next Drew Brees, but that's selling the peak of Brees' play awfully short. It's a strange start for the Broncos as they kick off their rebuild. Outside of Nix, they may have found immediate, quality contributors with Utah edge rusher Jonah Elliss, Oregon WR Troy Franklin and Notre Dame RB Audric Estime. Franklin and Estime are younger prospects with legitimate upside.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Hell of a draft for the back-to-back defending champs. They added elite, gamebreaking speed with their selection of Xavier Worthy in the first round and might have found a franchise left tackle in the second. Jared Wiley and Jaden Hicks were quality pickups in Round 4 and they took a couple dart throws on the offensive line later on. Wiley has the potential to be the Chiefs' starting tight end after Travis Kelce moves on, showing off rare movement ability for a 6-foot-6 player. Worthy, Kingsley Suamataia and Wiley may be cornerstones for the Chiefs' offense when this is all said and done.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Raiders got a couple of impact players on offense, even if the fit isn't immediately clear. Brock Bowers has superstar potential in the NFL. Figuring out how he'll mesh with Michael Mayer and where their skills can be used simultaneously will be an interesting challenge for the Raiders' coaching staff. Jackson Powers-Johnson should be a good fixture on the offensive line for the next few years and Delmar Glaze may wind up being a starter too. Solid first Raiders draft for general manager Tom Telesco and head coach Antonio Pierce. Now it's time to figure out how the pieces fit together.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "People might not like the Chargers taking an offensive tackle over a wide receiver with the fifth overall pick, but this is not a team that was a player away from getting to the top. They went 5-12 last season for a reason, mainly because they weren't that good. The Chargers needed help everywhere, including offensive tackle, and got a franchise player in Joe Alt. He and Rashawn Slater will form a tremendously talented tackle duo to protect Justin Herbert and help head coach Jim Harbaugh get his offense off the ground in Los Angeles. They still grabbed an explosive wide receiver at the top of the second and a speedy linebacker from Michigan in the third round. The Chargers will need time to restock their roster with talent.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/2024-nfl-draft-grades-for-all-32-teams-170438870.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Cardinals GM Monti Ossenfort lived up to his reputation as a wheeler and dealer. Since taking over in 2023, Ossenfort has brokered 11 trades, including six on draft day and a pair on draft day this year. Ossenfort's moves helped Arizona secure a handful of impact players, led by the best receiver in this year's draft in Ohio State's Marvin Harrison Jr. Arizona drafted much-needed pass rush help in Missouri defensive lineman Darius Robinson and Clemson's Xavier Thomas. The Cardinals also added an explosive running back in Florida State's Trey Benson and two cover corners in Rutgers' Max Melton and Boston College's Elijah Jones. The 12 picks by Arizona are the most in a single draft by the team since 1992.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Taking quarterback Michael Penix Jr. at No. 8 – after giving Kirk Cousins $100 million guaranteed last month – was easily the most criticized pick of the draft. Giving up a third-round pick to slide up eight spots for DT Ruke Orhorhoro in the second round felt like a reach, though Atlanta made a concerted push to upgrade its defensive front, using five of eight picks there. If Penix finds success in the next two years, it's at the expense of a huge investment in Cousins, and the class as a whole feels underwhelming.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "To be fair, the Ravens' patience doesn't always pay off – but damn if it isn't impressive anyway. Given their holes on the offensive line, it was interesting when they opted for cornerback Nate Wiggins in the first round. Not to worry; they hung out at the back of the second round and got a starter-caliber tackle in Roger Rosengarten, anyway. Adding deep threat receiver Devontez Walker in the fourth round feels like a sneaky good value, too – which would be a fun development for Lamar Jackson. It's worth noting that Baltimore has yet to find a star edge rusher, but those guys are tough to find when you're consistently picking late.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Bills GM Brandon Beane might draft for need as much – or more than – any other executive in the NFL. This draft is a perfect example of that. And he addressed those needs in order of priority: receiver (Keon Coleman), safety (Cole Bishop), defensive tackle (DeWayne Carter), running back (Ray Davis) and interior offensive line (Sedrick Van Pran-Granger). I get leery about GMs drafting for need, because it often means they've reached. There's some of that here. But for the most part, there's more to like about this draft. Buffalo's moves back out of the first round allowed Beane to target what he seemed to think was the sweet spot.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Give the Panthers credit for being ambitious, sliding up a spot for WR Xavier Legette, giving up two fifths to get the draft's top running back in Jonathon Brooks in the second. I expected a pass-rusher, and more splash on defense. Tight end Ja'Tavion Sanders felt like good value in a weak class for the position. Even without the No. 1 pick, you expect more impact from a draft after the worst record in the NFL.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Bears had as good of a draft as they could possibly hope for. They got their quarterback of the future in Caleb Williams and a potential star receiver in Rome Odunze, instantly making him one of, if not the best, No. 3 WR in the league. Chicago's offense now boasts Odunze with veterans DJ Moore and Keenan Allen, as well as D'Andre Swift, Cole Kmet, Gerald Everett and Williams at the helm. On paper, the Bears look to be one of the most complete teams in the league, especially after grabbing a punter with their last original pick. That was a weird gamble, even if Tory Taylor was the best punter in college football last year at Iowa. Chicago also finally addressed edge by trading back into the draft in the fifth round to take Austin Booker out of Kansas. I don't think he's the unquestioned answer opposite Montez Sweat but can add to the rotation. The confusing priorities at the end of the draft tack on a minus to what is otherwise a near-perfect draft in the Windy City.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I love the way Cincinnati drafted ahead of time here. They signed Trent Brown for the short term at tackle, but Amarius Mims will hopefully anchor that line for years to come. They brought in Sheldon Rankins in free agency, but they'll be hoping Kris Jenkins and McKinnley Jackson are the future of the defensive front. They still have Tee Higgins on the roster, but Jermaine Burton is an immediate option and could be a long-term replacement. This is how good teams stay on top: planning for the future.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "On the downside, the Browns had no first-round pick and just two selections in the top 100, so it was going to be hard to improve the roster. On the bright side, they have a quality roster and are getting starting quarterback Deshaun Watson back from injury, so they don't need a ton. I think Michael Hall and Zak Zinter are good players who bolster the offensive and defensive lines, but that doesn't move the needle much for 2024. This is a vet-heavy team that won't lean much on rookies, from the looks of it.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "For a team that had so many holes to fill after they did nothing in free agency, the Cowboys made some curious choices. They did a great job plugging two key holes on the O-line (Oklahoma LT Tyler Guyton in Round 1 and Kansas State C Cooper Beebe in Round 2). But no running back? No receiver until Round 6? Instead, in Round 2, they took Western Michigan edge rusher Marshawn Kneeland, who could be terrific in 2025, but might not be a huge help now, when they're supposedly \"all-in.\" Notre Dame LB Marist Liufau felt like a big reach in the third at another position where they needed help.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Denver's draft is largely a referendum on quarterback Bo Nix, the sixth passer picked in the first 12 slots of the draft. Throwing for 45 touchdowns against three interceptions as a senior at Oregon is impressive, and Denver got his top receiver by taking Troy Franklin in the fourth round. Denver and Sean Payton will have much of their success pinned to how Nix performs.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I had wondered if the Lions' draft strategy would change given they had limited needs coming into this weekend. It did, as general manager Brad Holmes pulled off four trades across all three days to get picks for positions of need, using one for cornerback Terrion Arnold out of Alabama at No. 24 overall. Their next pick was also a corner in Missouri's Ennis Rakestraw. Tell me where they saw a need for improvement without telling me. They started Day 3 with a bang by trading a future third to get an international player in tackle Giovanni Manu in the fourth round. I'm not a huge fan of giving up richer future capital, but Holmes has earned the benefit of the doubt. I appreciate that Holmes again got his guys, consensus big board be damned. The Lions also by far and away won the award for best war-room attire.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Packers entered the 2024 NFL Draft with 11 picks … and ended up making 11 while maneuvering up and down. Jordan Morgan should fit right in on their position-fluid offensive line. Linebacker Edgerrin Cooper can be an excellent complement to Quay Walker. Now that Jeff Hafley is the defensive coordinator, the Packers needed to stock up on his favorite position: safety. They got Xavier McKinney in a splash free agency signing but still drafted three more players at the position. Javon Bullard out of Georgia at No. 58 overall is excellent value. The other big splash was USC running back MarShawn Lloyd, who will go up against his college quarterback twice a year now. Throw in a couple of additional offensive linemen for depth/competition and you have a perfectly solid Green Bay draft. GM Brian Gutekunst is notorious for getting production out of later round picks and this year figures to be no different.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Texans general manager Nick Caserio set the tone for this draft class by saying that it would be difficult for a rookie to make a significant impact on the 2024 team. That indicated a desire to look for depth and to the future, and Houston definitely achieved that objective at a number of positions: corner, offensive tackle, safety and tight end among them. Second-round pick Kamari Lassiter, one of the top corners in college football last season, should still have a chance to start in Year 1 alongside Derek Stingley.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Four of the Colts' first five picks addressed the offense. They've done everything they can to make quarterback Anthony Richardson, returning this season after an abbreviated rookie year, as comfortable as possible – and you can't blame them. Receiver Adonai Mitchell represented great value late in the second round. With that being said, Indianapolis could have used a cornerback high. The team has some uncertainty at the spot, which is especially important in the receiver-loaded AFC South. That represents a gamble for Indy.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Only time will tell, but the Jaguars had a great draft on paper. They were able to trade down in the first round from 17 to 23 to get Brian Thomas Jr., whom general manager Trent Baalke said would've been the pick at 17. He had been valued by many as a mid-first-round pick. Fourth-rounder Javon Foster, a standout offensive tackle in the SEC, could immediately step in as the No. 3 OT with a chance to be a starter in the future. Jacksonville also leaves the draft with tremendous depth and on the defensive line behind standout trio Josh Allen, Travon Walker and Arik Armstead.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Boasting an elite defense, the reigning Super Bowl champion Chiefs entered this draft season needing to get more help for Patrick Mahomes on the offensive side of the ball, especially in the wake of Rashee Rice's legal troubles. They did so in a big way (and Mahomes showed his gratitude to general manager Brett Veach on social media). They added a weapon in Xavier Worthy whose 4.21-second 40-yard dash set an NFL Combine record. That speed figures to be lethal with Mahomes. Kansas City's top three picks were on offense.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Brock Bowers was far and away the draft's best tight end, and second-rounder Jackson Powers-Johnson can be an immediate starter on the interior offensive line. The Raiders didn't take a QB, but small-school running back Dylan Laube could be a steal.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New Chargers coach Jim Harbaugh focused on bringing in prospects from Power 5 conferences who played at big-time, winning programs. The centerpiece of the group is Notre Dame offensive tackle Joe Alt, who will play right tackle with Pro Bowler Rashawn Slater staying at left tackle. Second-rounder Ladd McConkey has a chance to take over the lion's share of the targets lost by the departure of Keenan Allen. Third-round selection Junior Colson has experience calling Chargers defensive coordinator Jesse Minter's defense at Michigan. Harbaugh also added picks with famous family ties. Day 3 selection Troy running back Kimani Vidal's great uncle is Hank Aaron. And Hall of Famer Jerry Rice's son Brenden Rice was taken in the seventh round.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Sean McVay prepared for life without Aaron Donald by selecting five defensive players, including four who can play along the front seven to generate a pass rush. The Rams selected in the first round for the first time since taking Jared Goff No. 1 overall in 2016, grabbing powerful edge rusher Jared Verse at No. 19. They followed that by taking Verse's teammate at Florida State in the second round in defensive tackle Braden Fiske. Michigan RB Blake Corum gives L.A. a similar runner to spell Pro Bowler Kyren Williams. And Stanford product Josh Karty being selected in the sixth round is L.A.'s latest attempt to solve this team's kicking woes. Overall, the Rams put together a solid class to follow up a very productive group from last year.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "You had to laugh when the Dolphins took Jaylen Wright, the draft's second-fastest running back. Last year, they took Devon Achane, one of the fastest players in the NFL. But that didn't stop them from bringing more speed into the offense in the fourth round. Wright followed a good get in the first round in Chop Robinson, an edge rusher who'll help the team manage snaps for Jaelan Phillips and Bradley Chubb, who both ended last year with major injuries. They also managed to snap up a tackle in Patrick Paul, who will develop behind Terron Armstead. It was a great draft, one that matched value with need.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Vikings needed a quarterback and got one. Though he likely wasn't their first choice (they reportedly tried to trade up to No. 3 presumably to select Drake Maye), this may have ended up being the ideal scenario. They needed to trade up just one spot from their first pick at No. 11 to select Michigan quarterback J.J. McCarthy. GM Kwesi Adofo-Mensah was still aggressive with the No. 23 pick, trading up to No. 17 to get Alabama edge Dallas Turner, widely considered one of the best defenders in the draft. Both are arguably top-10 prospects. The drawback is that the Vikings are now extremely low on draft capital next year. They have their first-round pick and just two fifth-round picks. They should expect at least one if not two third-round compensatory picks for losing Kirk Cousins and Danielle Hunter to free agency, but their roster is in solid shape, especially after adding another corner in Khyree Jackson from Oregon and multiple offensive linemen for depth. The Vikings almost certainly won the first round, but they may win the entire draft if McCarthy pans out.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Drake Maye didn't have the support he needed when the Patriots took him third overall. And a prospect like Maye – who is high risk, high reward – will need plenty of support to reach his potential. So it's worth crediting executive Eliot Wolf for spending the next four picks (a second, third and two fourths) on offensive players. New England added receivers Ja'Lynn Polk and Javon Baker. The Patriots even doubled up at QB with Joe Milton (Tennessee), another prospect with an incredible arm (albeit with rough accuracy and touch). It's clear the Patriots wanted to prioritize their offense, and it feels like the board lined up with their needs.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Saints made two strong picks at the top of the class, addressing a glaring need with tackle Taliese Fuaga and moving up to get corner Kool-Aid McKinstry, seen by many as a potential first-round pick. Hit on your first two picks, it's a good draft, but there's not a ton more to this. Spencer Rattler isn't a bad pick, but they used a 2024 fourth to get Jake Haener last year, so will both make the 53 alongside starter Derek Carr?",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Giants wanted to trade up for a new franchise QB, but they couldn't do it. So instead they helped out their old one by taking LSU's Malik Nabers, the most explosive WR in the draft, sixth overall. That alone should re-energize their offense. They turned to their secondary on Day 2 and got one of the draft's best safeties in Minnesota's Tyler Nubin (Round 2), but were too late for the top corners when they took Kentucky's Andru Phillips in the third. Penn State TE Theo Johnson (Round 4) could be big for them if veteran Darren Waller retires.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It was a tough draw that Rome Odunze went at No. 9 – though not unexpected. So the Jets traded down and still added Penn State tackle Olu Fashanu, which made plenty of sense. As good as Tyron Smith is when he's healthy, he's not healthy often. Fashanu will provide much-needed depth at tackle for Smith and Morgan Moses. Brock Bowers might have been tempting because he would instantly start – but I think they'll get more bang for their buck with Fashanu, especially considering how little Aaron Rodgers uses his tight ends. In Round 3, the Jets took a feisty WR in Malachi Corley. New York also added two running backs to their stable – which felt a little unnecessary, but I suppose they went with what the board gave them.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Eagles GM Howie Roseman is a wizard. After trying to trade up in the first round for a CB, the top one – Toledo's Quinyon Mitchell – fell right to him at 22. Then he got another corner with a first-round grade by trading up for Iowa's Cooper DeJean in Round 2. That alone would've made it a great weekend for Philly, but Roseman added to it with a Day 3 deal to bring LB Jeremiah Trotter Jr. to his father's old franchise. Their one curious move was taking Houston Christian edge rusher Jalyx Hunt in the third, but the Eagles can afford a high-ceiling project like that. Oh, and all of Roseman's trades got them some 2025 draft capital, too.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "If these picks hit, the Steelers' offensive line could be something special. Last year's first-round pick, Broderick Jones, is already showing promise. Pittsburgh has now added two likely starters in Troy Fautanu and Zach Frazier. Fautanu was seen by many as a top-10 prospect, and he fell to the Steelers at 20th overall. It was a similar story for Frazier, whom many rated as a top 40 guy, but fell to No. 51. Throw in fourth-round pick Mason McCormick, and things are looking as good as they have up front in a long time. If that wasn't good enough, the Steelers found themselves a versatile slot receiver in Roman Wilson, who should be ready to contribute right away. If he can stay healthy, it's also a good guess that Payton Wilson's high motor and toughness will make him a fan favorite in Pittsburgh. Those are just bonuses, though. If the Steelers have finally fixed their offensive line, this entire class will have been worth it.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The 49ers picked in the first round for the first time since moving up to take Trey Lance at No. 3 overall in the 2021 draft. Florida receiver Ricky Pearsall was somewhat of a surprise at No. 31, but he gives San Francisco another pass catcher who can operate in the slot and make plays over the middle of the field. The 49ers found a potential cover corner in the second round in Renardo Green and an explosive runner on Day 3 in Louisville's Isaac Guerendo. However, the 49ers needed offensive line help and didn't secure upgrades up front offensively until moving up in the third round to grab promising Kansas offensive lineman Dominick Puni, and later in Day 3 in USC offensive lineman Jarrett Kingston. San Francisco should have focused on this obvious need earlier in the draft.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "First-round defensive tackle Byron Murphy is a home-run pick – one of the top defensive players in the draft who should develop into a mainstay on Seattle's defense for the next decade. But Seattle had just two picks in the top 100 because of the Leonard Williams trade, making it tough to secure impact players. Connecticut offensive lineman Christian Haynes should fight for time along the starting offensive line. UTEP linebacker Tyrice Knight is a tackling machine and Michigan's AJ Barner has a chance to earn a role as a blocking tight end. But it appears these late-round picks are more developmental prospects who could take a few years to find roles for Seattle.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bucs made no trades but still pulled in a strong class that hit on key needs. Center Graham Barton leads the way, with edge Chris Braswell, nickel Tykee Smith and receiver Jalen McMillan all in the top 100 picks. There were no trades, no small-school gems to be found, but they brought in potential impact players all over the field. Tampa Bay had the same record as New Orleans, but picked 12 spots later in each round as a result of being division champ.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "At the top of the draft, the Titans showed a commitment to physicality and owning the trenches with offensive-minded coach Brian Callahan. They've taken on some risk with that approach – they're moving JC Latham from right to left tackle, and nose tackle T'Vondre Sweat has some conditioning concerns – but if it pans out, Tennessee could be looked at as big winners two to three years now. Apart from safety and tight end, the Titans leave the draft having addressed every other need.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Rule No. 1 of drafting a franchise QB: surround him with help. But that's not really what the Commanders did after drafting LSU QB Jayden Daniels second overall. They turned to their defense, where they did get great second-round value in Illinois DT Jer'Zhan Newton and Michigan CB Mike Sainristil. Both could be big-time players. The same goes for second-round TE Ben Sinnott. All their top picks were excellent, but their O-line is still a glaring issue and they didn't address that until Round 3 with TCU guard Brandon Coleman. That could turn out to be a regrettable decision.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2024-nfl-draft-grades-analyzing-all-32-teams-classes-who-gets-top-marks",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Cardinals did a nice job over the first two days of the draft. They acquired picks via trade, found home-run hitters on offense in Harrison and Benson and added an inside/outside pass-rush threat in Robinson. They landed athletic corners in Melton and Elijah Jones, as well. Adams and Reiman also met needs, though they were picked a bit earlier than I expected. Taylor-Demerson was my pick for the Cardinals in the fourth round of my seven-round mock draft because of his quickness as a slot defender and tackling ability. Thomas is athletic enough to stand up on the edge for the Cardinals, while Christian Jones and Palmer have the talent to take back-end roster spots and compete for playing time down the road.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "It was a strange draft for the Falcons, primarily because of the Penix selection, which was perplexing given their investment in Kirk Cousins this offseason. Penix's strong arm and accuracy from the pocket could make him a star if the injury woes that plagued him at Indiana don't return. Trading up to grab the athletic Orhorhoro was a reach, in my opinion, especially given the team's need at corner. Trice met a crucial need on the edge. Dorlus fits the mold of Atlanta's defensive linemen. He should be able to play 5-technique or 3-technique depending on where he is needed. Bertrand should contribute on special teams before moving to defense in time. McClellan and Washington -- who broke out as a senior at Illinois -- offer depth at the skill positions. They'll need to find cornerbacks in the undrafted free agent pool after failing to address the position in the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Ravens had yet another solid draft. Wiggins' elite recovery speed earned him a first-round slot, but he must answer questions about how his lean frame and inconsistent tackling translates to the next level. Rosengarten and Isaac were great value picks at two need spots. I liked the selection of Walker, an outside playmaker, early in Round 4, even after the team re-upped Rashod Bateman. Tampa's size and strength at the catch point made him worthy of a Day 2 pick, but Baltimore landed him on Day 3. Ali is coming off a biceps injury suffered at the Senior Bowl. Leary's arm and experience gained him a draft spot. Samac's a powerful interior lineman.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Buffalo found the potential big-play receiver it needed in Coleman after trading down twice in Round 1 (for relatively small gain). It will be interesting to see if dealing with the Chiefs so Kansas City could pick speedy pass-catcher Xavier Worthy comes back to bite the Bills. Bishop should be a good starter. Carter adds determination and leadership to the defensive line, although he was picked a bit earlier than I expected. Davis' tenacity as a runner is the perfect complement to James Cook. I projected Van Pran-Granger to the Bills a bit later in the fifth round in my final mock draft, but he was still a good value for a stout pivot. Securing a 2025 fourth-round pick for a fifth-rounder this year in a trade with the Bears will pay dividends down the road. Solomon is shorter than most Bills edge rushers, but he gets to the quarterback. Hardy could be a nickel candidate and is a strong return man.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Carolina gave up what eventually turned into the No. 1 overall pick in this year's draft as part of last year's trade to select quarterback Bryce Young. The Panthers moved up a spot to pick Legette at the end of Round 1. He will need to show he was a better pick than several other receivers selected in the second round. Brooks should be an excellent back once recovered from his knee injury. Wallace was an excellent value in Round 3 and can take over for Frankie Luvu, who exited in free agency. Sanders is a smooth pass-catching tight end who will be looking to outperform past Carolina draft picks Ian Thomas and Tommy Tremble. Smith-Wade is quicker than fast, making life difficult for receivers by sticking like glue.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Williams and Odunze, combined with DJ Moore and Keenan Allen, could give the Bears their best passing attack since the merger. The second-round pick that was dealt to Washington for Montez Sweat should pay off now that his contract has been extended. Amegadjie should contribute as a backup in 2024 and has potential to start down the road. Taylor has a good leg and had plenty of reps at Iowa, but I believe picking him in the fourth round was a reach. Booker has potential as an edge rusher, but the Bears had to give up a 2025 fourth-round selection to get him because they had unloaded their other Day 3 picks in previous trades. They improved their interior offensive line by sending a fifth-round pick to Buffalo for Ryan Bates earlier this offseason.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Mims is a boom-or-bust pick at tackle. He certainly has the size to win at the next level, but his limited experience (eight starts at Georgia) is a concern. The team doubled up on defensive tackles on Day 2 as it looks to replace D.J. Reader. Burton presented excellent value. He could become a key contributor on offense, especially if the Bengals and Tee Higgins don't work out a long-term agreement. Cincinnati was part of the tight end run in the fourth round, picking All despite injury concerns. Newton had a tough go at times during his senior year, but he could prove to be a nice find in the fifth round. Same goes for sixth-rounders McLachlan and Johnson. The Bengals picked Anthony with the seventh-round pick acquired from Houston for running back Joe Mixon.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Browns' 2022 trade for Deshaun Watson is still very much a work in progress; the QB's performance thus far has not provided the team with much of a return on the raft of picks shipped to Houston, including first- and fourth-round picks this year. Hall and Zinter stay in Big Ten Country, with the former Buckeye looking to wreak havoc on the defensive line and Zinter likely to bounce back from injury to be a long-term starter. Cleveland did not have many Day 3 picks because of past trades, including one this offseason for receiver Jerry Jeudy. Thrash could work himself into the role of a fourth or fifth receiver because of his speed. Nathaniel Watson's ferocious nature meets a need in the middle of the team's defense late in the draft, and Harden was one of the steals of the seventh round because of his fierceness and athleticism.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Gaining a third-round pick in a move down the board and still landing a starting tackle made for a successful Thursday night for Dallas. Kneeland and Beebe should prove to be excellent values, while Liufau will be a solid addition to the middle of the Cowboys' defense. The Notre Dame 'backer was picked a bit early for my taste, though. In Round 5, Dallas added Carson, a versatile corner/safety who was considered a Day 2 prospect near the start of last season. Flournoy has the tools to make the squad his rookie year. The Cowboys did not take a running back with any of their eight picks, leaving a sizable hole on their roster they'll still need to fill this offseason. Dallas had four picks within the top 90 selections, but were without a fourth-rounder, having sent theirs to San Francisco last August for Trey Lance. That investment could work out quite well if the former No. 3 overall pick is able to find his game at the pro level.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Time will tell whether Nix will be a top-notch starting NFL quarterback or viewed as a reach by a team in desperate need of talent under center. Time will also tell whether the 2023 first- and 2024 second-rounders the Broncos sent the Saints to acquire coach Sean Payton (along with a 2024 third-round pick) will lead to a championship in Denver. Elliss isn't a fantastic athlete but was productive at a need position for Utah, where he played for his father, former NFL lineman Luther Elliss. Denver traded up early in Round 4 to unite Franklin with Nix; the former is not the toughest receiver, but he can make defenders miss after the catch. The Broncos then found value at corner in wiry competitor Abrams-Draine before grabbing a power back in Estimé.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Lions doubled up at corner in the first and second rounds, flexing their aggressiveness by trading a third-rounder to move up for Arnold instead of staying put and possibly selecting his 'Bama teammate, Kool-Aid McKinstry. Detroit got fair value on Rakestraw at the end of Round 2, though the team also could have used another edge rusher or receiver. With Taylor Decker and Penei Sewell already in place at the two bookends, the Lions were one of the few teams able to take a chance on a massive, super-athletic tackle like Manu, a developmental prospect out of Canada. Vaki could turn out to be a hammer of a running back and special teamer, but the 32-spot jump to get him cost Detroit its fourth-rounder next year.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Morgan's pass-protection skills give him a chance to replace three-time Pro Bowler David Bakhtiari at left tackle, or he could prove himself a nice positional blocker at guard, allowing the Packers to get their five best linemen on the field together. Cooper and Bullard were excellent picks in Round 2, with both filling needs, but I was a bit ambivalent on the team using third-round selections on a running back (albeit a good one in Lloyd) and a second linebacker. Monk and Glover should provide depth on the offensive line, while Williams' reliable tackling should make him a good special teams player. Trading a pick to move up for a second safety didn't seem like the best value, though -- especially when you consider Green Bay took another safety just one round later. Oladapo is also a quality defender, but using three choices on the same position means the team must now rely on free-agent edge rushers and 3-techniques to round out the defense. Pratt was an excellent value pick late in the draft, as was King, who has more upside than his pre-draft evaluation might suggest.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Houston built on the momentum from last season's playoff run with a strong 2024 draft plan. The pre-draft trade with Minnesota to move out of the No. 23 overall slot -- and out of Round 1 entirely -- netted the Texans a 2025 second-rounder and didn't prevent them from addressing a roster sore spot with Lassiter. The Vikings used their original second-round pick on Fisher, who still needs more polish to his game. Time will tell whether Bullock was the right pick over the numerous other safeties still on the board. Stover was an excellent choice in Round 4. He'll be reunited with C.J. Stroud, who frequently leaned on the tight end on third downs when the two were teammates at Ohio State. Hill should be a special teams demon. Acquiring veteran running back Joe Mixon for a seventh-round pick earlier this offseason also factors into the grade above.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Latu was the most consistent pass rusher in the draft class and will be productive if the neck injury he suffered while at Washington is not an issue moving forward. The team found a potential steal in Mitchell, provided his game matures, while trading down for two Day 3 picks. Trading up for Gonclaves seemed unnecessary, though he should be at least a solid swing tackle; he's been recovering from a foot injury but said after the draft that he feels 100%. Bortolini looks like Ryan Kelly's heir apparent; he also has the experience, strength and athleticism to play guard until needed in the middle. Gould brings real value as a returner, especially with the new kickoff rules. Carlies moves from safety to linebacker for the Colts. Simpson could man corner or safety; the athletic defender played both spots in college. Abraham is the son of former NFL player Donnie Abraham and a tough-minded corner in his own right, but the team is still looking for depth at edge.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Trading down for three picks (including two mid-rounders in 2025) and still landing a downfield target like Thomas was a win for the Jaguars. Smith and Jones filled needs with good value in the second and third rounds, respectively. Calvin Ridley restarted his career in Jacksonville, but essentially renting the receiver in exchange for two picks (including a third-rounder this year) did not really pay off for the Jags. Foster provides depth at offensive tackle and could start in 2025 if Cam Robinson and Walker Little do not return. Defensive tackle Jefferson joined Smith in fortifying the defensive line. Prince is a great athlete at cornerback. Robinson will be a change-of-pace back and explosive returner. The team got backup quarterback Mac Jones for a sixth-round pick this offseason. Starting guard Ezra Cleveland was also acquired for a sixth-rounder last October; he re-signed in March.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "If you're wondering how the Chiefs stay on top, just look at this draft haul. Worthy is the sort of speedy difference-maker the Chiefs have searched for since trading Tyreek Hill away in 2022, and they did not give up much value to AFC rival Buffalo in the trade up to select him. They also did not have to reach for Suamataia, who should work himself into the lineup at tackle or guard if he's able to improve on his footwork. Wiley's potential as a mismatch against smaller defenders made him one of the top picks of the fourth round. Hicks joins past Chiefs picks L'Jarius Sneed and Chamarri Conner as yet another potential bargain defensive back in the fourth round. Nourzad could start at center or guard in the NFL. They'll be looking for corners, running backs and linebackers after the draft.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Bowers was too strong a value to ignore and will be a nice third-down and red-zone option for whomever is quarterbacking the squad over the next decade. Powers-Johnson was also a good find in the mid-second at a position of need. Glaze will need to show he was picked at the right time by eventually earning a starting spot. Richardson is exactly the kind of NFL-sized, physical corner the Raiders required. Eichenberg will be a reliable inside player for many years. Laube was a nice pick in the sixth round who will get carries off the bench and be a special teams ace. No quarterback was selected to enter the competition between Aidan O'Connell and Gardner Minshew, so that position should be their top priority in rookie free agency.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Alt will doubtlessly be a good offensive tackle for the next decade or more, but Chargers fans will keep one eye on receiver Malik Nabers, who went sixth overall to the Giants, to see if he would have been a better pick. McConkey could quiet any such concerns with his quickness and excellent routes if able to stay health. Head coach Jim Harbaugh found a leader on defense in Colson, who played that role for Harbaugh at Michigan. Eboigbe fits as a rotational defensive lineman who gives full effort on each play. Hart and Still fulfill the team's need at corner for good value, and Rice (son of Hall of Famer Jerry Rice) and Johnson were needed for a thin receiver room. Vidal is a low-center-of-gravity back who could take over for departed veteran Austin Ekeler if veteran JK Dobbins is not ready to go following last year's torn Achilles.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The run on offensive players in Round 1 allowed the Rams to land a bargain edge rusher (which they really needed) in Verse, their first first-round pick since 2016. Fiske will help make up for the loss of Aaron Donald to retirement, but we'll have to see if it made sense to trade a 2025 second-rounder to acquire him instead of getting Michael Hall at their original pick (No. 52; he went to the Browns 54th overall). Corum will play bigger and faster than his numbers indicate, and Kinchens is a downhill player at a soft spot for the Rams. Jackson and Davis bolster the depth on the defensive line with former Florida State teammates Verse and Fiske. The Rams needed to find a kicker in his draft, and they chose Karty over Cam Little (who went to the Jags at No. 212). Limmer and Leveston should be long-time pros at center and guard, respectively. Rookie cornerbacks not drafted this weekend should be getting calls from the Rams.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Miami needed another edge rusher, especially with Jaelan Phillips coming off an Achilles injury and Bradley Chubb coming off a torn ACL, but Robinson must show he can be a factor in the run game and convert pressures into sacks more regularly in the NFL. Left tackle Terron Armstead's difficulty staying on the field made Paul a good pick in the second round. The teams' forfeiture of its third-round pick dragged down its grade. Trading a future third-round pick for a fourth in the current draft is usually not wise, and Miami has a few backs in the stable already, but finding a potential star in Wright waiting around made it easier to swallow. It would not surprise me if the relentless Kamara is as productive as Robinson early in his career. Both pass-catchers with the surname Washington (not related) will flourish as tough-minded slot receivers in Mike McDaniel's offense.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Vikings gave up pick value in 2023, Day 3 picks this year and much of their 2025 draft in moves that landed them McCarthy, tight end T.J. Hockenson (in a 2022 deadline deal with Detroit) and edge rusher Turner. McCarthy and Turner possess the skill set to make that investment worthwhile, though McCarthy will need to continue his winning ways at the next level and Turner must be an impact defender. Jackson is a Riq Woolen-type corner, long and quick-footed, who presents excellent value in the fourth round. Rouse is a strong, experienced lineman who takes over for departed veteran Oli Udoh as the swing tackle. Don't overlook Jurgens' chances of making the roster. Reichard is the FBS' all-time leading scorer, and the Vikings need a reliable field goal kicker; I'm interested in how his career compares with that of Cam Little, who was picked by the Jags with pick No. 212.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "New England needed a new signal-caller in the worst way. Refining Maye's skills could help the team compete in the AFC East over the next few seasons. The selections of Polk and Wallace addressed needs for the Patriots, but we'll see if staying put in the second round to take Ladd McConkey -- instead of trading down -- and focusing on a different position early in Round 3 would have been better choices. Robinson should have been a third-round pick, so I understood the selection, even after the team's investment in interior lineman in last year's draft. It would not surprise me if Baker turned out to be just as good as Polk in two years because of his ability to win downfield. The team picked the strong-armed but inconsistent Milton with the sixth-round selection it acquired from the Jaguars for Mac Jones.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "New Orleans took a step forward in the NFC South race this weekend. Fuaga and the Saints seemed like a perfect pairing, with the nasty lineman fitting the team's mold and filling a big need. They traded up in Round 2 for McKinstry, a potential first-round value at a position where you can never have enough talent. Rattler will learn how to lead a team and take advantage of his physical gifts from a consummate professional in Derek Carr. He should compete against Jake Haener for the backup spot. Means is a tough receiver with athleticism and could fight for a roster spot. Ford's a pounder inside and I love Boyd's value in the sixth round. He can stuff run plays and get in the face of quarterbacks more often than you'd think.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Giants ignored the historic quarterback run early on to grab Nabers, an explosive receiver with a game similar to the team's 2014 first-rounder, Odell Beckham Jr. We'll see if sticking with Daniel Jones and Drew Lock instead of taking another QB was the correct move. Nubin and Phillips were fair value in the secondary, where the team needed more talent. Johnson will be an excellent fourth-round pick if he can fully translate his athleticism to the field. Tracy is an offensive weapon in the making, whether at running back or receiver. Muasau will be a starter in the league despite being picked in the sixth.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Even after picking up veteran tackles Tyron Smith and Morgan Moses this offseason, the Jets selected Fashanu to help protect Aaron Rodgers. They spent their second-rounder on Rodgers last year and moved up for the tough-running Corley to improve the talent surrounding the future Hall of Famer. The Jets did well picking up a 2025 third-rounder for one of their fourth-round selections. Adding in the big, nimble Allen to the backfield behind Breece Hall and Israel Abanikanda makes sense given how injuries have impacted depth at the position. I projected the Jets to bring in productive team leader Travis on Day 3, so trading up for him in the fifth wasn't surprising. Stiggers is a fantastic story, coming through the CFL to the NFL, and a competitive athlete outside.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Don't forget about the Eagles when identifying 2024 NFC title contenders, especially after this draft. Getting Mitchell to help the cornerback room without having to trade up was a major win. They moved up for DeJean like Detroit did for Brian Branch last year; I suspect he'll have a similar impact as a rookie. Hunt's potential on the edge was worth the third-round pick. The grade reflects the trade of this year's third-round pick for cornerback Kelee Ringo last year; the result is still uncertain. General manager Howie Roseman traded several times Saturday, flipping the script on last year's Ringo deal by getting 2025 third- and fifth-round selections. All-purpose back Shipley and receiver Smith will likely play on special teams and the offense as rookies. My favorite pick of the day was Roseman trading for Trotter, a fine player and legacy pick for the Eagles. McMahon could start at center this year if Cam Jurgens does not, and Keegan was a great pick late to add youth to the guard depth chart.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "It was just another value-filled draft for Pittsburgh. It was likely the Steelers would take offensive linemen on Day 1 or 2, and they found good value in Fautanu and Frazier. Both Wilsons selected on Day 2 were also fantastic finds and should make impacts in 2024 and beyond. The Steelers went O-line again on Day 3, getting McCormick at least a round later than I placed his value because of his toughness and athleticism. Lee is a nice sixth-round pick who will excel at 5-technique due to his strength and motor. Watts will get a chance to use his physicality in the secondary, though the team could have used an earlier pick at cornerback instead of picking three offensive linemen.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Pearsall's quickness and hands warranted first-round consideration, and the team needed a receiver with the potential trading away of Deebo Samuel or Brandon Aiyuk down the road. The 49ers could have also picked a cornerback or tackle at that spot. Green and Puni will contribute in areas of need, but trading up for Puni was a bit of a stretch. They did not re-sign Chase Young after sending a third to Washington at the deadline. Mustapha, picked with the selection gained from Dallas for quarterback Trey Lance, should see time on defense and special teams as a rookie. The 49ers hope to get more from Guerendo than recent running back picks Trey Sermon and Tyrion Davis-Price. Cowing is small but crafty, and Kingston's guard/tackle versatility makes him a valuable backup.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Murphy was always the pick for Seattle if available at No. 16 because of his ability to pressure quarterbacks and play the run. Haynes will start as a rookie for the Seahawks due to his athleticism and toughness. Re-upping defensive lineman Leonard Williams paid off the second-round investment in that trade with the Giants. Knight is the strong tackler the Seahawks needed in the middle of their defense, though others like Jeremiah Trotter Jr. were available. Barner is a reliable receiver and blocker who can replace Will Dissly. Pritchett should have been picked much earlier. Laumea played well at tackle but projects as a power blocker at guard. No edge rushers were selected, so I suspect a couple top undrafted free agents will be signed.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Barton's versatility, intelligence and toughness will make him one of the top linemen in this draft despite falling into the back part of the first round. Braswell met the team's need for an edge rusher but will need to prove he was worth his draft standing. Smith should contribute immediately, and McMillan could be a playmaker as his game matures. The Buccaneers could have picked Will Shipley over Irving, but the former Oregon Duck will compete for playing time with Chase Edmonds as a complementary back in 2024. Another interior lineman was picked in Klein, but no cornerbacks were brought on board.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "With Joe Alt off the board, the Titans picked the other top 10-caliber tackle. Latham's a wall on the outside who will excel on either side of the line. The team needed a big body like Sweat on the defensive line and chose him even after Sweat's recent DWI arrest; GM Ran Carthon said he discussed the incident with Sweat, and that Sweat \"accepted his responsibility.\" Tennessee will hope he can be dominant at the next level. The Titans' third-round pick was part of the package to move up for quarterback Will Levis last April. Gray's recognition skills and quickness make him a fit in the middle of Tennessee's defense. Brownlee has the talent to step into the fray as a rookie and earn a starting job down the line. Jackson's quickness helps fill two needs: depth at receiver and as a returner. Harrell should have been picked much earlier as an edge rusher, a spot where the Titans needed depth.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Commanders entered a new era with an excellent draft. Daniels could be an elite dual-threat playmaker if he becomes more efficient from the pocket. Newton is a force in the front four. Sainristil is a pain for opposing receivers to handle. Sinnott is an underappreciated receiving/blocking weapon. Coleman is a powerful guard/tackle. And McCaffrey is a reliable WR2 or WR3 option. Washington did not have a fourth-round pick after moving up to the third in the Sam Howell trade with Seattle. It found a future starting linebacker in Magee, whose explosiveness was underappreciated while he was playing at Temple. Hampton possesses a nice combination of size and quickness, and it won't be surprising if he plays as a rookie.",
    "sourceName": "NFL.com",
    "sourceUrl": "https://www.nfl.com/news/2024-nfl-draft-final-quick-snap-grades-for-all-32-teams",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Reuniting Oregon's Nix and Franklin is nice, and the speedy receiver is a great value toward the top of Day 3. I would've preferred the Broncos trade down in the first if they were targeting the Heisman finalist, but this group becomes an A+ if he pans out. Abrams-Draine and Estime are both potential impact starters in 5th.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Bills being complicit in allowing GM Brett Veach to draft Texas' Worthy is reminiscent of a scene in \"Jason X,\" where the famous last words of a science officer before being decapitated by Jason Voorhees is \"Guys, it's OK! He just wanted his machete back!\"",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "This draft felt like the perfect amalgamation of new coach Jim Harbaugh's and new GM Joe Hortiz's philosophies. There's physicality and pedigree up and down this list. Harbaugh landed a few Wolverines, Hortiz grabbed himself an Alabama player (that's his Ravens background showing), and Rice could end up being one of the steals of Day 3.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I truly appreciate new GM Tom Telesco staying true to his draft board by drafting Bowers (the No. 4 prospect on my Big Board), even if it wasn't a need. Picking Glaze in the third feels like a reach, especially with Christian Mahogany still available.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "GM Brandon Beane traded down twice to begin the draft, finally ending up with the first pick of Day 2, where he still landed my No. 4 receiver (Coleman) in this draft class. This is a good haul, but I wish Beane would've added a second receiver (the class was so good this year).",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Dolphins are just hoarding speed now. I like the two edge rushers, and Houston's Paul is a good value in the second, but GM Chris Grier needed to address the offensive line in a more robust way if they plan on giving QB Tua Tagovailoa a $200-plus million extension.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Patriots made the right choice to stick and pick Maye, and utilize their next four picks on offense in support of him. However, I felt both O-linemen were reaches in the third and fourth, especially Wallace with the 68th overall pick.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Prioritizing Aaron Rodgers' protection in the first shows GM Joe Douglas is still in charge here, and Corley is a superstar in the making, but the Jets needed to address the safety position long before Mr. Irrelevant.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "GM Eric DeCosta continues to stockpile textbook draft performances. My only critique of this group is Rosengarten is the only bite of the O-line apple before the 7th round, after three-fifths of last year's starting offensive line departed.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Mims' potential is as massive as he is. D-linemen Jenkins (one of my favorites) and Jackson will help alleviate the loss of DJ Reader. Iowa's All is a potential steal at tight end if he can stay healthy, but Arizona's McLachlan is an equally impressive prospect at the position.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Hall's upside is sky-high, but there's risk taking him in the second. I really like the Zinter selection. He's a potential first-round talent who was only available in the third because he suffered a broken leg late last season, but where's the running back?",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The offensive line is officially fixed. Fautanu, Frazier and McCormick are one of the best trios of O-linemen I've seen a team draft as an analyst. Michigan's Wilson has the potential to be a better pro, and if his body cooperates, NC State's Wilson could propel the Steelers' defense to another level, which is a scary thought.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Texans' big move this draft season was trading their first-rounder to Minnesota and then flipping a 2025 second-rounder they received in the deal to Buffalo for All-Pro receiver Stefon Diggs.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "UCLA's Latu is the best pure pass rusher in this class if he stays healthy and Mitchell had first-round traits but inconsistent production, so it made sense for him to slip into Day 2. I like a lot of GM Chris Ballard's class, but I would've liked to see a corner drafted higher.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Kudos to GM Trent Baalke for trading down and still landing the player we thought he'd target at No. 17. Baalke also continues to stockpile premium traits (LSU's Smith, FSU's Jones and Texas Tech's Cole).",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Upgrading the offensive line was priority No. 1 for GM Ran Carthon and he accomplished that. Would Sweat have been available in the third or even the top of the fourth, considering his DWI and conditioning concerns? The 38th pick in the draft is quite the premium to pay for someone with so many questions that still need to be answered.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Cardinals are the first team to make seven of the first 90 picks since the Cowboys in their iconic 1991 draft class that included Russell Maryland, Alvin Harper, Erik Williams and Leon Lett. GM Monti Ossenfort secured my No. 1 overall player (Harrison) and potentially four or five other starters.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Clearly the focus was on filling the Hall of Fame-sized hole on the D-line, and I'm a fan of most of these players, but I wish they would've addressed linebacker and corner as well.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "This is what GM John Lynch, coach Kyle Shanahan and their scouts do. They identify players with a certain skill set and mentality who have potential to thrive in their system and within the culture they've established. Pearsall, Guerendo and Cowing should infuse elite athleticism into an already top-tier offense, while the selections of O-linemen Puni and Kingston were sneaky good selections. My one true problem here was them passing on Cooper DeJean and Jer'Zhan Newton for Pearsall with the 31st pick.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "GM John Schneider continued to upgrade the trenches in a major way with his first two picks — the Seahawks also traded their second-round pick in October for D-lineman Leonard Williams. Also, Michigan's Barner could end up being one of the better tight ends in this class.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "I like the offensive linemen and Kneeland will help take pressure off of Micah Parsons, but Notre Dame's Liufau went about two rounds too early and the Cowboys failed to secure a running back. Even though it was an underwhelming class for ball-carriers, many of them would've been an upgrade over their current depth chart and Ezekiel Elliott (a potential free agent signing).",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Every player in this group has the potential to start for the G-Men early in their career.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "GM Howie Roseman showed he can draft good players outside of Athens, Ga., while also teaching a masterclass on how to maneuver around a draft board. The Eagles tied an NFL record for most trades in a seven-round draft with eight, tying the 2023 Texans and 2018 Patriots. Roseman also added three picks in 2025, including a third-rounder from the Dolphins, while securing two of the four best cornerbacks (Mitchell and DeJean) in this draft, addressing their biggest need.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "New GM Adam Peters followed up his selection of a potential franchise QB (Daniels) with three of my favorite players, Newton, Sainristil and Sinnott. Newton was No. 9 on my final Big Board of the season.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "GM Ryan Poles made up for a lack of quantity with exceptional quality. Frankly, if Williams is the QB we think he is, it won't matter if any of the other picks hit. However, all four could end up paying huge dividends at positions of significance.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Arnold easily could have been a top-15 pick, but the 14 straight offensive players at the start pushed him down. Mahogany lasting until the sixth round remains one of the biggest surprises of the draft for me. He's a potential steal for GM Brad Holmes.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Arizona's Morgan isn't a first-round draft pick in my opinion. Graham Barton, whom the Buccaneers drafted the following pick, is a better prospect due to his versatility and durability and would have made a lot of sense for the Packers. Cooper and Bullard are Day 1 starters, and if GM Brian Gutekunst's final pick (King) can reach his potential, this grade boosts to an \"A.\"",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Kudos to GM Kwesi Adofo-Mensah for not overspending in order to trade up for McCarthy. This allowed them to also land Turner in the first, a premium prospect in his own right. Jackson and Rouse are solid gets on Day 3, but a lack of Day 2 selections lowers the grade.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "I'm a huge fan of Penix. He's the best pure passer with the best pocket presence in this class of quarterbacks. He almost certainly would've been a top-10 pick without the injury history. I still don't understand why the Falcons drafted him, and believe it could end up a lose-lose situation for him and the team. If Kirk Cousins, who GM Terry Fontenot gave a $180 million deal last month, handles his business, then Penix won't be needed and may not get an opportunity to start, in Atlanta or elsewhere, until his late 20s. Which means the only way the pick of Penix makes sense is if Cousins fails miserably. Also, taking Clemson's Orhorhoro over Jer'Zhan Newton (a Grady Jarrett clone) with the 35th pick has the potential to look very bad in the near future.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "New GM Dan Morgan's goal had to be to surround last year's No. 1 overall pick Bryce Young with better playmakers. South Carolina's Legette, and Texas' Brooks and Sanders all fit the bill.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The mauler Fuaga checks off the Saints' biggest need at offensive tackle and McKinstry is an amazing value in the second (he only fell due to a Jones fracture in his foot). GM Mickey Loomis only had two picks inside the top-100 to play with because of previous trades, so there's a drop-off after McKinstry. Rattler, Boyd and Ezirim are solid fliers on Day 3, but not having enough draft capital kept Loomis from addressing the D-line or wide receiver in a significant way.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Buccaneers needed to address the center position after former Pro Bowler Ryan Jensen retired and they did (Barton). The rest of the group is solid, but unspectacular.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/sports/story/2024-04-28/2024-nfl-draft-grades-for-all-32-teams-what-was-the-falcons-thinking",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Harrison is a middle of the fairway pick for the Cardinals, who have fallen into another generational wide receiver prospect. After seeing how adept this offensive staff was at getting their best playmakers the ball, the expectations for Kyler Murray will be undoubtedly high this year. Arizona dominated the middle rounds and did a great job of obtaining some players who will compete for starting jobs before the projected talent cutoff, which drops significantly after Round 3.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Call me crazy, but I'm a huge fan of the Penix pick. The quarterback landscape could be great in two years. It could be barren. But if the Falcons are truly building toward the future, why not make the inevitable transition easy. I think there's a lot of pro-Kirk Cousins sentiment out there, but Cousins will be 36 in August and is coming off an Achilles injury. He has also never reached a conference title game, so it was time to explore all options.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Baltimore used the first round to reinforce its secondary, nabbing Wiggins as a tough, undersized corner at 173 pounds. In the second round, general manager Eric DeCosta replaced departed right tackle Morgan Moses with Rosengarten, then found a productive edge in Isaac to round out the first two nights.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2024,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Bills spent the first round driving their fans insane, trading back twice, including once with the Kansas City Chiefs. Eventually Buffalo made a few selections including Coleman, a big-bodied receiver with limited speed. Bishop was a better pick, helping replace the departures of Micah Hyde and Jordan Poyer. However, Carter may be the Bills' best choice, giving them a third option inside with DaQuan Jones and Ed Oliver.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I was a fan of this draft because the Panthers followed up on their offseason plan to get Bryce Young back on solid ground. After bulking up the guard play in free agency, Carolina went after the kind of targets who will produce yards after the catch or move the football with loaded boxes. This is a gift for any young quarterback.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Consider me still stunned that the New York Giants did not take Odunze with the No. 6 pick. Either way, this Bears class benefits. Chicago gets a group loaded with star power and attitude. Amegadjie could end up being the steal of this class, and based on how well GM Ryan Poles has mined the lower rungs of the draft for offensive line talent, we could see another deep class for the Bears in a critical season.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Bengals had a clear mission to beef up along the lines. Cincinnati spent three of its four picks in the trenches, including the ultimate boom-or-bust choice with Mims, who started only eight games in college. The Bengals also took a wild card in Burton, whose tape is great but has legitimate off-field concerns.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Once again without a first-round pick due to the Deshaun Watson trade, the Browns made the most of their earliest picks with a talented, local product in Hall before nabbing Zinter. Cleveland will finally have its first-rounder back in 2025, giving the Browns a full draft class for the first time in years.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2024,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "We discussed this on the MMQB podcast, but Dallas's continued insistence on behaving and drafting like a team that has already won something of consequence is puzzling. Guyton may have the highest upside of any tackle in this class, but owner Jerry Jones has to consider who benefits from a longer-term project when everyone on his staff is being held to the fire this year. There needs to be some thought put into Guyton's long-term development.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "This class will be remembered—for better or worse—for the selection of Nix. The Broncos are staking their future on the Oregon product, who struggled mightily at Auburn before transferring and throwing 45 touchdowns against three interceptions last season. The question is which Nix is Denver getting, and at 24 years old, has he already reached his ceiling?",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "GM Brad Holmes is the new Howie Roseman. What do I mean by that? Sensible draft choices that aggressively target areas of need, and a relentless pursuit of those picks. The Lions nabbed two of the draft's best cornerbacks to help them patch a secondary that may have been their biggest Achilles heel last season. Holmes and coach Dan Campbell are a force together, one of the few GM and coach combinations who seem to be truly on the same page.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Morgan was beloved by a few teams with coaches from the Kyle Shanahan tree thanks to his movement ability, which should really shine in the Packers' outside zone system. With some proper coaching—and Green Bay has an excellent offensive line staff—Morgan could end up being one of the best tackles in this draft class. Cooper was the first off-ball linebacker selected in the draft, and his relentless pursuit stands out on tape and should give the Packers a versatile defender who can remain on the field in multiple situations.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "After spending lavishly in free agency and then adding star receiver Stefon Diggs in a trade with Buffalo, the Texans prioritized their secondary in the first three rounds. Houston nabbed both Lassiter and Bullock, adding them to a group already boasting Derek Stingley Jr. and Jalen Pitre. Fisher is also an intriguing pick, with Tytus Howard perhaps ready to move inside.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "This is a quality class for GM Chris Ballard. The Colts snagged Latu to bolster their pass rush before getting a steal in Mitchell, who many believed was a top-25 pick. If those two picks hit, this is already a good haul, not to mention the bevy of high-upside selections in the third round and beyond. Ballard built up his skill-position talent and lines, giving Anthony Richardson the best chance to succeed.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2024,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Thomas is a talented receiver, but the pick was questionable when one considers how badly the Jaguars needed a corner, and none had been picked at that juncture. Down the board, Jacksonville did add defensive help, but is it enough? The Jaguars are betting on mid- to late-round talent to shine through early on that side of the ball.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Kansas City went into the draft with two clear needs: left tackle and wide receiver. GM Brett Veach found both in the early rounds, trading up to land both Worthy and Suamataia. Worthy has blazing 4.21 speed, albeit weighing 165 pounds. If he hits, though, the Chiefs' offense will be back in full force.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Raiders and their fans should be thrilled. Without trading up, Las Vegas was able to select Bowers, who was easily the best tight end in this class. Then, on Day 2, GM Tom Telesco found a pair of starting-caliber offensive linemen in Powers-Johnson and Glaze, with the former ranking as the class's best center.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Chargers have been going about their business wisely. Alt was the best player available in the first round and gives them a nasty tackle combo with Rashawn Slater on the other side. Then, trading up in the second round netted McConkey, who is already Los Angeles' most talented receiver. This is a foundational class for new coach Jim Harbaugh, who is trying to build both culture and a winner.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I want to know who thought it was a good idea to let Rams running backs coach Ron Gould get his hands on Corum, one of the smartest backs in this class. Los Angeles spent last year revamping its running game, utilizing it as a weapon to propel its passing attack. Meanwhile, Verse becomes the team's first first-round pick since the Obama administration. If he's anything like some of GM Les Snead's mid-rounders, he should be playing well and playing right away.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Dolphins were predictable but effective. They built along the offensive and defensive lines with their first two picks, grabbing Robinson and then Paul, who should eventually replace Terron Armstead when he retires. For Miami, Robinson's early maturation will be key with Jaelan Phillips and Bradley Chubb working back from injuries.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I think I am going to regret my dislike of the Vikings draft, just like I did with the Texans draft a year ago. I didn't quite see the value of the Dallas Turner trade, but if defensive coordinator Brian Flores can get the best out of him, what's the difference at the end of the day? I thought the Vikings should have been more aggressive to get the quarterback they really wanted, but I also think that Kevin O'Connell is going to make it work with McCarthy.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2024,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Patriots made the right decision to stay at No. 3 and take Maye, who has been a highly touted prospect for years. GM Eliot Wolf then continued his offensive surge with Polk and Wallace, and Polk may already be the best receiver in New England. If Maye works out, the Patriots have their future franchise quarterback, especially if Jerod Mayo proves a long-term fixture at coach.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Saints played the board well and took a handful of quality players. Fuaga has some position versatility and McKinstry certainly had some first-round grades. Now that the Saints are upgrading to the Kubiak–Shanahan offense, they'll need as much athleticism up front as they can possibly get their hands on.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The hope is that Nabers is everything he's been billed to be. The comparisons for him pre-draft were incredibly glowing, but the Giants have been here before. A star receiver out of LSU wants the ball and an underperforming quarterback is struggling to get it to him. If Nabers lifts Daniel Jones into perpetual above-averageness, then this was worth the major swing. It's also smart to continue rebuilding this secondary post-Wink Martindale as the Giants prepare for something a little less guerilla style.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2024,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Jets deserve credit. They could have made the flashy pick of a pass catcher in the first round, but instead took a top-three tackle in a loaded class with Fashanu. Then, in the third round, New York found its receiver in the 215-pound Corley. The Jets are trying to build a contender around the aging Aaron Rodgers and this class did a nice job of helping that cause.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2024,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Similar in complexion to the Lions draft, this was a targeted rebuild as well as a big swing in the third round to take a former safety-turned-edge rusher who could end up being one of those draft gems. Cooper DeJean is going to shine in the zone-heavy Vic Fangio scheme, and the Eagles, in a division with the pick-prone Dak Prescott and Daniel Jones, plus a rookie in Jayden Daniels, are suddenly a daunting opponent.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "This feels like a class the Steelers will look back on as a foundational group for future success. Pittsburgh showed why it's one of the league's bedrock organizations, finding substance over flash. The Steelers added a pair of versatile, talented linemen in Fautanu and Frazier, then found value in the Wilson duo. For Pittsburgh, it might walk away with four immediate starters from this group.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2024,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Kyle Shanahan played wide receiver and evaluates the wide receiver class each year for the 49ers. He's had tremendous success at picking the position so far during his tenure as the team's coach, and Pearsall seems like a player who can also help San Francisco blend a little bit of McVay into the system by involving the versatile wideout into their blocking scheme intimately.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2024,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "New coach Mike Macdonald gets a defender in the first round who can be mentored by savvy veteran Johnathan Hankins. We'll see if the Seahawks plan on causing a similar amount of targeted chaos in this iteration of Macdonald's defense. He has many different pieces now, but Murphy, like Macdonald's units in Baltimore, can create havoc from multiple positions.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2024,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Barton helps Tampa Bay continue to rebuild its line's interior, which GM Jason Licht has made quick work of since the unit's decay toward the end of the Tom Brady era. Centers are among the safest picks in the draft, and Barton can be an early investment into the Baker Mayfield era, as well as a critical bridge piece into Tampa's quarterback of the future decision.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2024,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Titans landed playmaking in free agency with Tony Pollard and Calvin Ridley. They made a big trade to acquire L'Jarius Sneed on the perimeter. In the draft, GM Ran Carthon focused on the trenches, landing Latham to anchor his offensive line alongside last year's first-rounder, Peter Skoronski. However, Sweat is a controversial pick after being arrested for suspicion of DWI in April.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2024,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "This was a straight-up masterpiece. The Commanders got the best quarterback in the draft (as I see it, at least) and then hammered the top 100, eschewing the relatively worthless picks that will be coming in Rounds 4–7. This is one of the few drafts that I thought elevated a team from its pre-draft status into something promising. Could Washington be this year's Texans? I'm not ruling it out and you shouldn't, either.",
    "sourceName": "Sports Illustrated",
    "sourceUrl": "https://www.si.com/nfl/2024/04/27/2024-nfl-draft-team-grades-analysis",
    "playerGrades": []
  }
]