[
  {
    "teamName": "Arizona Cardinals",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Arizona Cardinals kicked off their draft by taking Mississippi defensive lineman Walter Nolen. While Nolen was widely viewed as a boom-or-bust prospect coming into the draft, he should fit well with what Arizona wants to accomplish defensively.\n\nNolen's concerns aren't centered around his play on game days.\n\n\"Nolen's practice habits and sense of entitlement have been questioned,\" Sports Illustrated's Albert Breer wrote on April 23.\n\nThe 21-year-old has as much physical upside as any defensive lineman in this class. He can create havoc on the interior, and he can help give head coach Jonathan Gannon the sort of disruptive front he once had as the Philadelphia Eagles defensive coordinator.\n\nArizona took a flier on Michigan cornerback Will Johnson in Round 2, which, in a vacuum, was a brilliant move. The Cardinals ranked just 21st in net yards allowed per pass attempt last season, and Johnson was the fifth-ranked prospect on the final B/R board.\n\nAccording to NFL Network's Ian Rapoport, Johnson slid because of long-term concerns about his knee. If his health holds up, though, the Cardinals may have gotten the steal of the early draft.\n\nGannon got a few more pieces for his defense in the middle rounds, adding Jordan Burch, Denzel Burke and Cody Simon.\n\nIt wasn't surprising to see a defensively focused draft from the Cardinals, given Gannon's background. It's fair to wonder, though, if Arizona should have done more to support quarterback Kyler Murray, who has yet to establish himself as a top-tier signal-caller.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Atlanta Falcons appear eager to support second-year quarterback Michael Penix Jr. with a vastly improved defense. With their first 2025 draft selection, the Falcons took Georgia linebacker Jalon Walker, arguably the most versatile defender in the class.\n\nAtlanta then traded back into Round 1 for Tennessee pass-rusher James Pearce Jr. Like Walter Nolen, Pearce carries off-field concerns but has an intriguing amount of upside.\n\n\"Pearce is seen as a bit edgy, and had a reputation for being divisive in college,\" Breer wrote on the eve of the draft.\n\nIt's worth noting that Pearce was viewed as a candidate to go No. 1 overall a year ago. If he can reach that ceiling, moving up to acquire him will have been worth it. If not, the Falcons will regret sending the 46th and 242nd picks, along with a 2026 first-round selection, to the Los Angeles Rams for the 26th and 101st picks.\n\nSafeties Xavier Watts and Billy Bowman Jr. have the potential to form a very disruptive duo on the back end. Atlanta lacked legitimate difference-makers in its secondary last season. That shouldn't be as much of a concern in 2025.\n\nAdding Watts, specifically, should help mitigate the risk of trading up for Pearce. He was the 27th-ranked overall prospect on the Bleacher Report Scouting Department's final draft board.\n\nWith Jessie Bates III still in the mix at safety, the back end of the defense should actually be a team strength in 2025.\n\nWas the move to land Pearce an unnecessary risk? Probably. Is Atlanta's defense, on paper, dramatically better than it was a few days ago? Yes.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "While it can't really be considered a draft strategy, the Baltimore Ravens seem to have a knack for allowing talented players at positions of need to fall to them in the first round.\n\nA year ago, it was cornerback Nate Wiggins. Three years ago, it was safety Kyle Hamilton. On Thursday, it was Georgia safety Malaki Starks.\n\nBaltimore's newest defensive back should immediately pair with Hamilton to form one of the league's best young safety duos. Along with free-agent addition Chidobe Awuzie, he should help bolster a secondary that showed growth in 2024 but still finished the year ranked 31st in passing yards allowed.\n\nThe Ravens added more help to their pass defense by grabbing Marshall pass-rusher Mike Green late in the second round. The No. 2 edge-rusher on the B/R board could prove to be a massive steal, though other teams may have shied away because Green twice faced sexual assault allegations—once in high school and most recently while at Virginia in 2022, which caused his transfer to Marshall.\n\nGreen has never been charged and denies all accusations.\n\n\"We understand the severity of what these allegations were, of course,\" general manager Eric DeCosta said, per ESPN's Jamison Hensley. \"But doing our due diligence, we are comfortable with Mike.\"\n\nDay 3 selections Teddye Buchanan and Carson Vinson figure to provide depth for one of the AFC's more talented rosters. Kicker Tyler Loop may be the eventual heir to longtime special-teams stalwart Justin Tucker.\n\nThe Ravens are good at this drafting thing. They had another productive three days over the weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A year after trading out of Day 1, the Buffalo Bills used their first-round selection on Kentucky cornerback Maxwell Hairston. It was a sensible pick that provided sensible value at No. 30.\n\nHairston, the 34th-ranked prospect on the B/R Scouting Department's final board, has good length (5'11\", 183 lbs), solid coverage skills and elite athletic ability. He also has a positive, energetic personality that should instantly resonate with Bills fans.\n\nTaking Hairston at No. 30 was very sensible after Buffalo ranked 24th in passing yards allowed last season. Buffalo made a more aggressive move on Day 2, trading up to No. 41 to snag South Carolina defensive tackle T.J. Sanders.\n\nWhile Sanders was only the 96th-ranked prospect on the B/R board, it's hard to call his selection a massive reach. Buffalo watched an early run on defensive linemen unfold and decided to go up and get a player they liked and needed.\n\nThe Bills ranked just 19th in yards allowed per carry last season. That's a big reason why adding prospects like Landon Jackson and Deone Walker to the defensive front in the middle rounds was logical.\n\nGeneral manager Brandon Beane targeted depth at cornerback and tight end on Day 3, logical choices given Buffalo's defensive needs and offensive identity.\n\nOverall, this was a defensive draft for the Bills, which was largely expected. While Buffalo may still lack a true No. 1 receiver, it can coax enough offense out of Josh Allen, James Cook and a good collection of complementary pass-catchers. Ideally, it'll now have a chance to finally stop Patrick Mahomes and the rival Kansas City Chiefs in the postseason.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Some selections just make too much sense. The Carolina Panthers' first pick of the 2025 draft was one of those.\n\nCarolina scooped up Arizona wide receiver Tetairoa McMillan, who should provide an ideal blend of ability, scheme fit and value. The eighth-ranked prospect on the final B/R board, McMillan has the size (6'4\", 219 lbs) and ball skills needed to be a true No. 1 receiver for third-year quarterback Bryce Young.\n\nBleacher Report's Dame Parson favorably compared McMillan to Tampa Bay Buccaneers wide receiver Mike Evans in his predraft scouting profile. Panthers head coach Dave Canales coached Evans two years ago as Tampa's offensive coordinator.\n\nIn the second round, the Panthers got a potential difference-maker for their defense. Texas A&M's Nic Scourton has the traits needed to make an immediate impact as a rookie.\n\n\"Between his pro-ready body and impressive movement skills, it's easy to see why NFL teams like Scourton,\" Matt Holder of the B/R Scouting Department wrote.\n\nCarolina added some great depth pieces on Day 3, including safety Lathan Ransom.\n\n\"The Carolina Panthers invested heavily in safety Tre'von Moehrig in free agency,\" Bleacher Report's Brent Sobleski wrote while giving Carolina an \"A\" grade for the Ransom pick. \"Ohio State's Lathan Ransom could step in immediately as the Panthers' other starting safety since Nick Scott is currently the squad's best option.\"\n\nGeneral manager Dan Morgan addressed his team's biggest defensive needs, grabbed a receiver with No. 1 potential and added another intriguing piece to Carolina's budding backfield.\n\nIt was a good three days at the office for a franchise that has hope after Young's late-season emergence in 2024.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "In Round 1, the Chicago Bears found themselves a terrific new target for second-year quarterback Caleb Williams. Michigan's Colston Loveland should be a wonderful complement to Cole Kmet and a Sam LaPorta-like playmaker in the offense of new head coach Ben Johnson.\n\nAnd while, according to ProFootballTalk's Mike Florio, teams were \"divided\" on whether Loveland or Penn State's Tyler Warren was the top tight end in the 2025 class, the Bleacher Report Scouting Department long favored Chicago's newest star.\n\n\"Loveland was the B/R Scouting Department's TE1 throughout the season, not Penn State's Tyler Warren,\" Brent Sobleski of the B/R Scouting Department wrote on Thursday while giving the Bears an \"A\" grade for their first-round selection. \"The reasoning was simple: Loveland has the same upside as a playmaker, but he's a more well-rounded tight end, particularly when used as a Y-option.\"\n\nChicago got another weapon for Williams and Johnson on Day 2, adding Missouri wideout Luther Burden III.\n\nBurden, who tallied 2,263 receiving yards and 21 touchdowns in 38 games at Missouri, should partner with Warren, Kmet, D.J. Moore and Rome Odunze to give the Bears a deep, talented receiving corps.\n\nChicago also added some Day 2 value by trading back in a deal with Buffalo.\n\nEven after trading down, the Bears got themselves a quality tackle prospect in Boston College's Ozzy Trapilo, who was named the most pro-ready tackle by the Bleacher Report Scouting Department.\n\nTexas A&M defensive lineman Shemar Turner should help address Chicago's 28th-ranked run defense right away. On Day 3, general manager Ryan Poles took a flier on late-riser Ruben Hyppolite II, a solid gamble at that point in the draft.\n\nIf Johnson is looking to replicate the success the Detroit Lions have had in recent years—and one can assume that's the plan—the Bears were wise to add pass-catchers and build in the trenches over draft weekend.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Cincinnati Bengals entered draft weekend needing to find pass-rushing help in a big way. Trey Hendrickson's contract situation remains unresolved, and Sam Hubbard retired earlier in the offseason.\n\nYet, using the 17th pick on Texas A&M's Shemar Stewart felt like a gamble the Bengals shouldn't have made. Though he was the 17th-ranked player on the Bleacher Report Scouting Department's draft board, Stewart is a massive boom-or-bust prospect.\n\nHe has elite physical tools but remains unpolished and had very modest production (4.5 sacks) in college. He'll need to be a better pro than college player for the bet to pay off, and Cincinnati doesn't have a strong track record of developing unfinished prospects.\n\nAddressing Cincinnati's underwhelming offensive line would have been a more sensible move on opening night.\n\nIn the second round, the Bengals reached for South Carolina linebacker Demetrius Knight Jr., who was the 89th-ranked prospect on the B/R board. Linebacker was a significant need for Cincinnati, though, especially after Germaine Pratt requested a trade in the early offseason.\n\nCincinnati took a flier on a second linebacker, Barrett Carter, in Round 4 and added some backfield depth with Tahj Brooks in Round 6.\n\nOverall, the Bengals did address some needs, but they reached a bit too much to do so. They also could have afforded to throw a few more darts at their offensive line—though, at this point, we may have to accept that Cincinnati is content to see Joe Burrow take sacks regularly.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Moving forward, the story of the Cleveland Browns' draft will likely be centered around the team stopping Shedeur Sanders' dramatic slide in Round 5, but we'll get to that momentarily.\n\nThe Browns were widely expected to take Colorado cornerback and wide receiver Travis Hunter with the second overall pick. Instead, Cleveland provided the first surprise of the event by flipping the pick to the Jacksonville Jaguars.\n\nWhile Cleveland got excellent value—a top-36 pick and a future first-rounder is quite a haul—to only move down three spots, it passed up the chance to draft the closest person to a \"sure thing\" there was in this class.\n\nIf Hunter becomes a perennial All-Pro at receiver, cornerback or both positions, Thursday's trade may haunt the Browns for the next decade or more. That said, general manager Andrew Berry got some big draft chips in return and a terrific player in Michigan defensive lineman Mason Graham, who was the third-ranked overall prospect on the B/R board.\n\nCleveland came back for linebacker Carson Schwesinger at the top of Round 2, and that selection felt like much more of a reach. Schwesinger was only the 66th-ranked prospect on the B/R board, though he was arguably the best off-ball linebacker remaining.\n\nWith the Browns' second pick on Day 2, the team targeted a starting-caliber running back in Ohio State's Quinshon Judkins. This may also have been a bit of a reach—Judkins was the 55th-ranked prospect on the B/R board—though Cleveland needed a starter and was unlikely to snag Judkins or an equivalent back in Round 3.\n\nJudkins and fourth-round pick Dylan Sampson—who was the 75th-ranked prospect on the B/R board—could give Cleveland one of the league's better young RB duos.\n\nGraham, Schwesinger, Judkins, Sampson and Harold Fannin Jr. all have the potential to be early contributors, which boosts the overall grade for a team that needs young, cheap talent to help navigate the Deshaun Watson debacle. Sanders and Dillon Gabriel, who was drafted two rounds earlier, will compete with Joe Flacco and Kenny Pickett to be Cleveland's starting quarterback—and possible quarterback of the future.\n\nCleveland's draft strategy regarding Sanders can certainly be questioned. The Browns need a long-term answer at quarterback, and he was the second-ranked QB on the B/R board and a prospect many had mocked to Cleveland at second overall early in the predraft process. Getting a borderline first-round talent in Round 5, however, is a steal under almost any circumstance.\n\nThe Browns' roster is much, much stronger than it was a week ago, and there's at least a glimmer of hope for the future.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "After first-round picks on fairly significant projects in each of the past two years—on defensive tackle Mazi Smith and offensive tackle Tyler Guyton—the Dallas Cowboys went with a more pro-ready prospect on Thursday.\n\nAlabama's Tyler Booker was a two-year starter at guard for Alabama and comes into the NFL with a 6'5\", 321-pound frame, a physical play style and an aggressive demeanor.\n\nBooker should be a strong fit for the balanced offense of new head coach Brian Schottenheimer. He won't make fans forget about future Hall of Famer Zack Martin, who retired in the offseason, but he'll help replace him.\n\nTaking Booker, who was the 32nd-ranked prospect on the B/R board, at No. 12 represents a slight reach. It was still a sensible decision by the Cowboys.\n\nDallas got its developmental prospect early on Day 2, grabbing Boston College pass-rusher Donovan Ezeiruaku.\n\n\"He'll be more of a third-down rusher at first and needs to spend more time in the weight room before becoming a complete defender,\" Matt Holder of the B/R Scouting Department wrote.\n\nEzeiruaku should, however, contribute early as a situational player.\n\nDallas waited until the fifth round to add a running back, but Jaydon Blue and Phil Mafah should push Javonte Williams and Miles Sanders for playing time as a rookie. Cornerback Shavon Revel Jr. will provide much-needed depth while Trevon Diggs continues to recover from a significant knee injury.\n\nOverall, the Cowboys did a solid job of adding players who should contribute right away and provide long-term value.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Plenty of folks probably expected the Denver Broncos to target an offensive player on opening night who could help support second-year quarterback Bo Nix. Instead, the Broncos made an equally smart move by adding to their playoff-caliber defense.\n\nTexas cornerback Jahdae Barron may immediately form part of the league's top cornerback duo alongside reigning Defensive Player of the Year Patrick Surtain II.\n\n\"His ability to play multiple positions, combined with his high football IQ, physicality, and ball skills, gives him a high ceiling in a variety of defensive schemes,\" Cory Giddings of the B/R Scouting Department wrote.\n\nBarron, the 12th-ranked prospect on the final B/R board, brought tremendous value at No. 20, even if he'll simply bolster a team strength.\n\nDenver added a complementary receiving back in UCF's RJ Harvey after trading back in the second round.\n\nMore defensive help came in the middle rounds, along with a big-bodied receiver in Pat Bryant (6'2\", 208 lbs). He should complement pass-catchers Courtland Sutton, Marvin Mims Jr. and Evan Engram in Sean Payton's passing attack.\n\nSai'vion Jones and Quandarrius Robinson should provide depth along an already talented defensive front.\n\nDenver didn't take a wide receiver early and didn't add a big-name running back like Ashton Jeanty or Omarion Hampton to its offense, so its draft class might fly under the radar. It's a solid group, though, that should help keep the Broncos in the AFC West mix.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Detroit Lions' selection of Ohio State defensive lineman Tyleik Williams in the first round probably didn't generate many headlines. Adding an interior defender isn't quite as exciting as adding a game-breaking receiver or dominant edge-defender.\n\nAnd the Lions have been searching for a complementary sack artist to pair with Aidan Hutchinson.\n\nHowever, Williams does fit Detroit's defensive identity and needs. The Lions featured a strong defensive front when healthy over the past two years. But standout defensive tackle Alim McNeill is coming off a torn ACL, while free-agent addition D.J. Reader will turn 31 in July.\n\nWhile Williams was only the 43rd-ranked prospect on the final B/R board, an early run on defensive linemen made his selection sensible at No. 28.\n\nDetroit stayed in the trenches in Round 2, scooping up Georgia interior lineman Tate Ratledge. He was the 50th-ranked overall prospect on the B/R board and a very sensible selection for the Lions.\n\n2024 starting guard Kevin Zeitler departed in free agency.\n\nThe Lions got more interior-line depth with Miles Frazier and took fliers on wideout Isaac TeSlaa and edge-rusher Ahmed Hassanein. Moving up to get TeSlaa came at a cost, though; namely, a pair of 2026 third-round selections.\n\nThis was a solid draft for Detroit, though the Lions may not see significant early contributions from their rookie class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The jokes about the Green Bay Packers not valuing wide receivers in the draft can finally end. Green Bay ended its 20-plus-year run of not drafting a receiver in Round 1 by taking Texas' Matthew Golden—and making quite the show of it:\n\nSelecting Golden wasn't about breaking trends, though. It was about finally providing quarterback Jordan Love with a legitimate difference-maker. With an elite combination of size (6'0\", 195 lbs) and speed (4.29-second 40-yard dash), Golden will likely replace Christian Watson as Green Bay's de facto No. 1 target.\n\nWatson suffered a torn ACL in January and has never quite emerged as a reliable No. 1 receiver. Golden might not be that either, but he'll certainly add some potency to the Packers' passing attack. Savion Williams will add additional competition to the receiver room and should put some of Green Bay's existing receivers on notice.\n\nIn the second round, the Packers may have reached for North Carolina offensive tackle Anthony Belton, who was only the 134th-ranked prospect remaining on the B/R board after Day 1.\n\nBelton should add competition at tackle, though, while edge-rusher Barryn Sorrell will help address the Packers' need for another situational sack specialist.\n\nGeneral manager Brian Gutekunst added some much-needed defensive depth on Day 3, though it was a bit surprising that he didn't target cornerback help early in the draft.\n\nGreen Bay may need to see a big jump in passing production for this draft to be considered a success.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Houston Texans didn't make a selection on opening night, choosing instead to trade with the New York Giants so that New York could get its quarterback of the future, Jaxson Dart.\n\nGeneral manager Nick Caserio made the move after the Minnesota Vikings picked Ohio State offensive lineman Donovan Jackson at No. 24. In exchange for the 25th pick, Houston got a respectable return.\n\nHouston also got a quality receiver prospect early on Day 2. Iowa State's Jayden Higgins is a big (6'4\", 214 lbs) possession receiver who should add a new dynamic to the receiving corps.\n\nHiggins will also help the Texans replace the departed Stefon Diggs and give C.J. Stroud a reliable target as Tank Dell recovers from the devastating knee injury he suffered in Week 16. He and third-round pick—and former teammate—Jaylin Noel should stabilize Houston's receiver depth this season.\n\nThe Texans also got themselves a tackle after trading up in Round 2 to secure Minnesota's Aireontae Ersery.\n\nErsery was the top-ranked tackle remaining on the B/R board after Day 1. He should provide much-needed depth right away and could develop into a long-term starter for the Texans.\n\nIt would have been nice to see Houston invest a little more into its offensive line. However, the Texans did a good job of addressing most of its major needs while further building the foundation of a young, dynamic receiving corps that can grow alongside Stroud for the foreseeable future.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Indianapolis Colts are set to hold a quarterback competition between 2023 fourth overall pick Anthony Richardson and free-agent addition Daniel Jones. The hope, obviously, is for Richardson to finally play up to his draft status and emerge as an above-average signal-caller.\n\nThe Colts needed to upgrade their offensive cast this offseason, and they've long needed a dynamic receiving tight end. They landed one in Penn State's Tyler Warren while making one of the most obvious picks of opening night.\n\nIndianapolis was widely expected to take a tight end in Round 1. The B/R Scouting Department paired Michigan's Colston Loveland with the Colts in its final predraft mock, but Loveland went to Chicago at No. 10, leaving Warren as the perfect choice for the Colts at No. 14.\n\nOn Day 2, the Colts grabbed Ohio State pass-rusher JT Tuimoloau, who probably would have been a high 2024 draft selection if he hadn't decided to return to college to chase a national championship with the Buckeyes.\n\nCornerback Justin Walley was probably more of a reach in Round 3. He was the 190th-ranked prospect on the final B/R board.\n\nDay 3 was mostly about depth for the Colts, and that's where they added Notre Dame quarterback Riley Leonard. Leonard probably won't push Richardson or Jones for the starting job, but he can settle in as a long-term backup.\n\nDid Chris Ballard hit on every pick this weekend? Perhaps not, but Warren and Tuimoloau should be instant-impact players.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Did the Jaguars give up a lot for Colorado receiver and defensive back Travis Hunter? Yes. Can Hunter change the face of the franchise? Jacksonville seems to think so.\n\n\"There are players that you can target and acquire that alter the trajectory of a football team,\" general manager James Gladstone said on the team's draft show on YouTube (h/t ESPN's Michael DiRocco). \"...it's rare to be able to target and prioritize a player who can alter the sport itself. And Travis is somebody that we view has the potential to do that.\"\n\nIf Hunter can be a Pro Bowl talent at both receiver and cornerback—or if, as a wideout, he can simply help Trevor Lawrence play up to his potential—the Jags should be happy with their return on investment. However, it was a steep price.\n\nJacksonville gave up its second-round pick and a 2026 first-round selection to move up three spots and add a sixth-round pick and a higher fourth-round selection. We'll have to wait to see how Hunter pans out, but, on paper, he addresses two of Jacksonville's biggest predraft needs.\n\nThe Jags didn't pick again until late on Day 2 but landed a possible early contributor in safety Caleb Ransaw. Fourth-round pick Bhayshul Tuten should also make an early impact as part of Jacksonville's backfield rotation.\n\nIt's clear that Gladstone is willing to take an aggressive approach to team construction, which might be precisely what the Jags need to return to relevance. A solid draft class and a justifiable superstar will certainly help.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Kansas City Chiefs didn't make waves at the bottom of Round 1, but they certainly got some value.\n\nFirst, Kansas City traded back one spot to let the Eagles secure Alabama linebacker Jihaad Campbell. The Chiefs pocketed a fifth-round pick in the move and still landed a promising tackle prospect in Josh Simmons at No. 32.\n\nSimmons is coming off a significant knee injury, but the Chiefs were comfortable with his recovery.\n\n\"He's in a good place…It's healed well,\" head coach Andy Reid said, per Matt McMullen of the team's official website.\n\nOffensive line issues were a major problem in 2024, and while Simmons may not supplant free-agent addition Jaylon Moore immediately, he could become Kansas City's long-term solution at left tackle.\n\nGeneral manager Brett Veach deserves credit for the slam-dunk series of moves that led to Simmons in Round 1.\n\nThe Chiefs added to their defensive front in Round 2, grabbing Tennessee defensive tackle Omarr Norman-Lott. At 6'2\" and 291 pounds, Norman-Lott is just a tad undersized for the interior but should have some early pass-rushing value. Ashton Gillotte and Nohl Williams were also added to the defense on Day 2.\n\nKansas City finally turned back to the offense in Round 4 and may have gotten a steal in wideout Jalen Royals. The Utah State product caught 21 touchdown passes over the past two seasons and was the 49th-ranked overall prospect on the final B/R board.\n\nDid the Chiefs add a slew of immediate difference-makers? Probably not. However, Veach got some solid value early and late while adding several prospects who can develop into quality contributors down the road.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Sometimes teams really do what others expect on draft night. A cursory search of predraft mocks will likely uncover several that paired the Las Vegas Raiders with running back Ashton Jeanty. \n\nJeanty was still on the board at No. 6, and Las Vegas didn't hesitate to get Pete Carroll his next dominant ball-carrier.\n\nBrent Sobleski of the B/R Scouting Department gave the Raiders an \"A\" grade for the selection, citing how well Jeanty meshes with what Las Vegas has put in place this offseason.\n\n\"Jeanty will immediately take pressure off veteran quarterback Geno Smith, the Raiders' marquee offseason acquisition. He's truly a special runner and should feast in Chip Kelly's running back-friendly scheme.\"\n\nThe Raiders traded down twice near the top of Round 2, adding some valuable capital in a draft that was believed to have depth in the middle rounds. They still managed to add another potential playmaker in TCU wide receiver Jack Bech, a physical, reliable possession receiver who should complement the rest of Las Vegas' receiving corps.\n\nDont'e Thornton Jr. may be more of a project but should add big-play speed to Las Vegas' receiving corps.\n\nJeanty, Bech, Thornton, Brock Bowers and Jakobi Meyers should form the foundation of a potent multi-faceted offense in 2025.\n\nDarien Porter has the skills needed to be an early contributor in the secondary, while Caleb Rogers and Charles Grant will help solidify the Raiders' offensive line depth.\n\nLas Vegas added some quality defensive depth later in the draft and finally settled on a developmental quarterback in North Dakota State's Cam Miller. However, this draft was all about finding the pieces needed to field a Pete Caroll team—one with a dominant ground game, strong offensive line and physical defense. In that regard, this class looks terrific.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Like the Raiders, the Los Angeles Chargers opted for a potential game-changing running back in Round 1. As with Las Vegas' pick, we probably could have seen the Chargers' selection coming.\n\nHead coach Jim Harbaugh loves to lead with the running game, and North Carolina's Omarion Hampton has all the tools needed to be a top-10 or even a top-five running back in the NFL.\n\nHampton should be a terrific fit for Greg Roman's offense because of his physical, efficient running style and his pass protection—Justin Herbert will love having him in the backfield.\n\nLos Angeles got another weapon for Herbert in Round 2, grabbing Mississippi wide receiver Tre Harris. He was the fourth-ranked receiver on the B/R board and should add both talent and versatility to the Chargers' receiver room.\n\n\"He is alignment versatile and can play all three wide receiver positions effectively,\" Dame Parson of the B/R Scouting Department wrote. \"With his route running, strength, and football IQ, Harris projects as a productive starting receiver at the next level.\"\n\nL.A. also took a flier on Auburn receiver Keandre Lambert-Smith in Round 5. Lambert-Smith is likely to be a developmental project at best, but his 4.37 speed is tough to ignore.\n\nGeneral manager Joe Horitz added depth to the defensive front in the middle rounds, grabbing Jamaree Caldwell and Kyle Kennard. It's clear that Horitz and Harbaugh are on the same page when it comes to building in the trenches.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Well, the Rams' run of being first-round relevant proved to be short-lived. A year ago, general manager Les Snead made Jared Verse the franchise's only first-round selection since 2016. On Thursday, Snead flipped the 26th and 101st picks to the Falcons for the 46th and 242nd picks, along with a 2026 first-rounder.\n\nAs head coach Sean McVay said after the fact, this was too much value to pass up.\n\nDuring L.A.'s first-round drought, the front office became exceptional at finding high-level contributors on Days 2 and 3. The Rams likely felt they'd be getting a second-round talent at No. 26 anyway, so they essentially flipped a third-round pick for a future first.\n\nThe Rams made their first selection of 2025 in Round 2, grabbing Oregon tight end Terrance Ferguson. He should provide valuable depth behind Tyler Higbee and should contribute right away as a rotational player.\n\n\"He has developmental upside as a blocker and contested-catch target,\" Dame Parson of the B/R Scouting Department wrote.\n\nWhile Josaiah Stewart's lack of elite size and physical tools may make him seem like a third-round reach—he was the 160th-ranked prospect on the B/R board—the Rams have shown that they know how to get the most from productive defensive linemen.\n\nJarquez Hunter should have a chance to contribute to the backfield early, while Ty Hamilton should provide even more depth along the defensive front.\n\nThe Rams would have been wise to add a cornerback or an elite off-ball linebacker early, but they navigated the draft fairly successfully, considering they traded their first-round selection.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Miami Dolphins kicked off their 2025 draft class with a bit of a reach. While Michigan defensive tackle Kenneth Grant possesses enough upside to justify going in Round 1—he was the 26th-ranked prospect on the final B/R board—he's highly unlikely to be an every-down contributor.\n\nAt 6'4\" and 331 pounds, Grant projects as more of a space-eating nose tackle than a versatile three-down defender. Miami has needed defensive line help since losing Christian Wilkins in 2024 free agency, but there was better value to be found at No. 13.\n\nDefensive lineman Walter Nolen, tight end Tyler Warren and edge-rusher Shemar Stewart were all rated higher than Grant by the Bleacher Report Scouting Department and drafted after him on opening night.\n\nMiami continued reloading its defensive front in Round 2. Following a trade with the Raiders, the Dolphins grabbed themselves a guard in Arizona's Jonah Savaiinaea.\n\nSavaiinaea can provide depth at tackle but will likely make a more immediate impact if the Dolphins play him inside.\n\n\"Savaiinaea is best suited inside at guard in the NFL, where his starter-level size, square power, and initial quicks can earn him a starting role early in his rookie contract,\" Brandon Thorn of the B/R Scouting Department wrote.\n\nTrading up for Savaiinaea was smart and may provide a bigger impact this season than the drafting of Grant. However, it's hard to envision Miami getting early contributions from Day 3 selections like Jordan Phillips and Jason Marshall Jr.\n\nTaking a flier on Quinn Ewers was smart, given Tua Tagovailoa's lengthy injury history. Ewers may never develop into a high-level starter, but he can become a long-term backup for the Dolphins—and they could definitely use one.\n\nOverall, though, it's hard to think Miami will make a big 2025 jump because of its draft class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Despite entering draft weekend with only four total selections, the Vikings opted to take Ohio State offensive lineman Donovan Jackson at No. 24 instead of trading down in Round 1.\n\nBoth the 25th and 26 selections were dealt, by the Texans and Rams, respectively.\n\nPresumably, Minnesota felt it could struggle to find quality offensive-line help later in the draft, so it scooped up Jackson, who was only the 51st-ranked prospect on the B/R board. While his selection at No. 24 may have been a reach, the logic behind it was sound.\n\nThe Vikings are looking to turn the offense over to J.J. McCarthy in 2025 and needed to revamp their offensive interior. Jackson will join Ryan Kelly and Will Fries as additions who should help solidify Minnesota's blocking unit.\n\nMinnesota did move down in Round 3, grabbing the 102nd and 142nd picks by sending the 97th and 187th picks to the Texans. With the 102nd pick, the Vikings grabbed Maryland receiver Tai Felton, who could be a very strong complement to Justin Jefferson and Jordan Addison.\n\n\"If paired with a true No. 1 receiver, he can find success on the lesser defenders on the opposing defense,\" Dame Parson of the B/R Scouting Department wrote.\n\nThe Vikings also found their veteran quarterback insurance to pair with McCarthy by acquiring Sam Howell from the Seattle Seahawks.\n\nHowell shouldn't be a threat to McCarthy as the starter but will provide solid depth in the quarterback room.\n\nDay 3 prospects Tyrion Ingram-Dawkins, Kobe King and Gavin Bartholomew figure to be pure depth and may struggle to make the final 53-player roster. All in all, though, general manager Kwesi Adofo-Mensah did a nice job of maximizing Minnesota's limited draft capital.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "LSU offensive lineman Will Campbell always felt like the right pick for the New England Patriots at No. 4. While he didn't draw as much attention as Travis Hunter, Abdul Carter and Cam Ward entering the draft, he's a high-floor prospect who will thrive as a tackle or guard in New England.\n\n\"We spent a lot of time, and we looked at a lot of other players and worked a lot of other players out. He made a huge impact on us, and we're excited about adding him,\" head coach Mike Vrabel told reporters after the pick.\n\nThe Patriots are looking to build a strong offense around second-year quarterback Drake Maye, and finding an instant-impact starter along the offensive line was a wise way to begin the draft.\n\nNew England continued building its offense on Day 2, using the 38th pick on Ohio State running back RB TreVeyon Henderson.\n\nHenderson should make an immediate impact as a ball-carrier and as a pass-catcher. He'll add some much-needed home run ability to the Patriots offense. He will pair with Rhamondre Stevenson to create a backfield that should concern opposing defensive coordinators this season.\n\nKyle Williams should give Maye an explosive target who can generate big plays before or after the catch.\n\nDefensive prospects Craig Woodson and Joshua Farmer should get opportunities to contribute early. Of course, the goal in this draft was to improve Maye's supporting cast, and the Patriots did a wonderful job of doing just that.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2025,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "There was plenty of buzz connecting the New Orleans Saints and quarterbacks like Colorado's Shedeur Sanders entering draft weekend. This, in no small part, was a result of the shoulder injury that \"threatens\" incumbent starter Derek Carr's availability in 2025, according to NFL Media's Ian Rapoport.\n\nHowever, the Saints didn't draft a quarterback with the ninth pick. Instead, they reached for Texas lineman Kelvin Banks Jr., who was the 33rd-ranked prospect on the final B/R board.\n\nAccording to Brent Sobleski of the B/R Scouting Department, who gave New Orleans an \"F\" grade for the Banks selection, New Orleans simply reacted to the mistakes it has already made along the line:\n\n\"Trevor Penning still isn't an NFL-caliber pass-blocker. Taliese Fuaga never should have been moved to left tackle. Banks isn't necessarily a tailor-made left tackle despite playing the position in college. Questions remain about whether he can stay on an island and remain effective.\"\n\nNinth overall was too high for Banks, plain and simple.\n\nThe Saints did come back for their quarterback in Round 2, using the 40th overall pick on Louisville's Tyler Shough.\n\nWhile Shough comes into the NFL with durability concerns, his combination of size, athleticism, maturity and arm talent makes him a strong fit for Kellen Moore's offense—if he can put everything together.\n\n\"The talent and potential are there, but he needs more consistency,\" Dame Parson of the B/R Scouting Department wrote of Shough.\n\nIn Round 3, the Saints added some intriguing pieces to their 30th-ranked defense in Vernon Broughton and Jonas Sanker. Getting Danny Stutsman, another defensive addition, in Round 4 was solid value.\n\nStutsman was the seventh-ranked linebacker on the B/R board.\n\nUnfortunately, the Saints didn't do the best job of maximizing value early in the draft, and it's fair to wonder if taking Shough over quarterbacks like Shedeur Sanders and Jalen Milroe was a massive mistake.\n\nNew Orleans may need to prove a lot of people wrong for its draft to be considered a big win.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "It's hard not to love what the Giants accomplished on opening night. General manager Joe Schoen didn't panic in his search for a quarterback of the future but landed him anyway by staying patient.\n\nAt the top of Round 1, the Giants simply let the draft's best pure defender fall to them at No. 3. Penn State pass-rusher Abdul Carter, the second-ranked overall prospect on the B/R board, should be an immediate difference-maker.\n\nThere should now be some questions, however, about what the future holds for Kayvon Thibodeaux in New York.\n\nSchoen then traded back into Round 1 to snag Mississippi quarterback Jaxson Dart. While Dart was ranked below Colorado's Shedeur Sanders by the B/R Scouting Department, seeing Dart become the second signal-caller off the board was not surprising. His big arm, athleticism and scrambling ability always made him a sensible fit for Biran Daboll's offense.\n\n\"I'm told Daboll was a key driving force behind New York trading back into the first round to take him,\" Fox Sports insider Jordan Schultz posted to X on Thursday.\n\nTrading back into Round 1 without surrendering a future first-round pick—the move cost Schoen the 34th and 99th picks, along with a 2026 third-rounder—should be seen as a big win.\n\nDarius Alexander should add valuable depth to New York's defensive front, while Cam Skattebo could help reshape the team's offensive identity.\n\n\"Be prepared for Skattebo to make regular appearances on Angry Runs. The first-team All-American plays with a level of power and passion that can't be denied,\" Bleacher Report's Brent Sobleski wrote while giving the Giants an \"A\" grade for the Skattebo pick.\n\nThe Giants did a great job of finding players who can contribute early while adding a quarterback of the future. Of course, it remains to be seen whether that'll be enough to save the jobs of Schoen and Daboll beyond this season.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A year after taking Olu Fashanu in Round 1, the New York Jets kicked off their draft with another offensive tackle.\n\nFashanu should enter 2025 as the team's starting left tackle, leaving the right side open for Missouri's Armand Membou. Right tackle is Membou's natural position, so fans should see the rookie start early in the season.\n\nWhile New York could have considered other prospects at No. 7, including tight end Colston Loveland and linebacker Jalon Walker, Membou was a very sensible selection.\n\nThe 10th-ranked player on the B/R board was also perhaps the cleanest line prospect in the 2025 class. With Membou in the fold, the Jets should be able to get an accurate look at what they have in free-agent quarterback Justin Fields.\n\nAnd while the Jets passed on an offensive skill player in Round 1, they got one near the top of Round 2. LSU tight end Mason Taylor should give New York the dynamic pass-catching tight end it hasn't had in recent years.\n\nCornerback Azareye'h Thomas has the potential to be a quality starter early in his career. Taking Arian Smith represented a solid gamble on explosive traits, though the Georgia product is a boom-or-bust prospect.\n\nIt was a surprise to see the Jets ignore quarterbacks who could be developed behind Fields or eventually push him for the QB1 role. Darren Mougey could have done much worse in his first draft as New York's general manager, though.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Eagles general manager Howie Roseman may not always land the best players in the draft, but it sure seems like he consistently finds the perfect prospects for his franchise.\n\nAlabama's Jihaad Campbell is a wonderful combination of edge-rusher and off-ball linebacker who should give defensive coordinator Vic Fangio fresh options. He and 2024 All-Pro Zack Baun will be a nightmare for opposing offenses sooner than later.\n\nAnd while Philly did surrender the 164th pick to move up only one spot for Campbell, Roseman wasn't about to risk another team trading up to get him.\n\n\"This was a top-10 player on our board,\" Roseman said, per ProFootballTalk's Michael David Smith.\n\nCampbell was the 19th-ranked prospect on the final B/R board and was well-worth moving up to secure.\n\nAt the end of the second round, the Eagles grabbed some secondary help in the form of Texas defensive back Andrew Mukuba. He should contribute early as a versatile rotational player who can help Philly replace trade departure C.J. Gardner-Johnson.\n\nRoseman primarily focused on depth on defense and along the defensive line on Day 3. Offensive tackle Cameron Williams, who was the 86th-ranked prospect on the B/R board, was a particularly good value in the sixth round.\n\nThe Eagles also got a developmental quarterback in Kyle McCord.\n\nRoseman and the Eagles tend to shine on draft weekend, and it would seem that they've done it again in 2025.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Pittsburgh Steelers had their chance to select a quarterback like Shedeur Sanders or Jaxson Dart with the 21st pick. Despite not having a long-term answer at the position—Pittsburgh may eventually reach an agreement with a 41-year-old Aaron Rodgers for the 2025 season—the Steelers opted for Oregon defensive lineman Derrick Harmon instead.\n\nHarmon, the third-ranked defensive tackle on the B/R board, does make sense for the Steelers. He's a big (6'5\", 313 lbs), disruptive interior defender, and 35-year-old Cameron Heyward can't man the middle forever.\n\n\"We were on the clock,\" head coach Mike Tomlin said Thursday night, per ESPN's Brooke Pryor. \"We got the player that we wanted.\"\n\nPittsburgh filled another need on Day 3, grabbing Iowa running back Kaleb Johnson in the third round—the Steelers sent their second-round pick to Seattle for wide receiver DK Metcalf.\n\nThe Steelers needed a physical running back to pair with the shifty Jaylen Warren. They got exactly that in Johnson. Edge-rusher Jack Sawyer also fills Pittsburgh's need for a situational edge-rusher, and he provided good value in the fourth round.\n\nSawyer was the 84th-ranked prospect on the B/R board.\n\nThis was a very Steelers-like draft, and most of their picks should mesh with Pittsburgh's locker room culture. The biggest issue is that the team desperately needed a long-term quarterback plan but didn't draft a signal-caller before taking a sixth-round flier on Will Howard.\n\nIncluding Metcalf as part of the draft haul keeps the Steelers from getting a more disappointing grade.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "In a vacuum, the San Francisco 49ers' selection of pass-rusher Mykel Williams made sense. San Francisco is experiencing a bit of a roster overhaul this offseason—not a full-on rebuild, but key players like Dre Greenlaw and Charvarius Ward did depart—and it has long needed a high-end edge-rusher opposite Nick Bosa.\n\nWilliams may eventually be that top-tier complement. However, the Georgia product is on the raw side.\n\n\"The Bulldog's traits are worth betting on for a team that uses a lot of even fronts and is looking for a hand-in-the-ground defensive end,\" Matt Holder of the B/R Scouting Department wrote. \"But he'll likely take a year or two to flesh out his game and become an impact, every-down player.\"\n\nTeams typically prefer cleaner prospects in the top half of Round 1.\n\nSan Francisco continued reloading its defensive front in Round 2, taking Texas defensive tackle Alfred Collins with the 43rd pick. A massive (6'6\", 332 lbs) interior defender, Collins should help fill the void created when the 49ers released Javon Hargrave early in the offseason.\n\nThe run on defenders continued in the middle rounds, and prospects like Upton Stout, Nick Martin and CJ West should have opportunities to compete for early playing time. It was an unsurprising approach for a team that ranked 29th in points allowed last season and is looking to revitalize the defense under former/new coordinator Robert Saleh.\n\nAt the end of Round 4, the 49ers took a flier on speedy (4.37-second 40-yard dash) receiver Jordan Watkins.\n\nIn the latter rounds, John Lynch largely targeted depth—though Jordan James may find a backfield role after Jordan Mason was traded to Minnesota earlier in the offseason.\n\nSan Francisco also took a flier on Indiana quarterback Kurtis Rourke, who may have backup value behind Brock Purdy.\n\nOverall, this draft was about replacing departed players and turning over a roster that couldn't stay healthy in 2024.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Seattle Seahawks had a solid tackle tandem in Charles Cross and Abraham Lucas, but their interior line was a significant liability in 2024. Unsurprisingly, Seattle addressed that need with its first opportunity.\n\nThe Seahawks settled on North Dakota State interior lineman Grey Zabel, a smaller-school prospect with big-time physical tools.\n\n\"Zabel shows starter-level physical tools with refined run blocking skills and understanding of leverage that signal he can become an immediate role player and potential starter within his first year or two with center likely being his best fit,\" Brandon Thorn of the B/R Scouting Department wrote.\n\nSeattle got terrific value early on Day 2, trading up to No. 35 and snagging safety Nick Emmanwori, who was the 28th-ranked prospect on the B/R board.\n\nThe Seahawks also grabbed Miami tight end Elijah Arroyo in the second round. He's a talented deep threat at tight end who should complement Noah Fant or potentially replace him if the Seahawks plan to move on from the 27-year-old. Arroyo and fifth-round receiver Tory Horton should have chances to improve the passing attack as rookies.\n\nThe Seahawks grabbed an intriguing developmental quarterback in Jalen Milroe, who could threaten Darnold's long-term future in Seattle. Getting Milroe in Round 3 was great value.\n\nAfter adding Milroe, the Seahawks dealt Sam Howell as part of a move up to grab Rylie Mills in the fifth round.\n\nIt was a bit surprising that Seattle didn't invest even more into its offensive interior, but it was a sensible draft otherwise. The Seahawks added a few early contributors, got something in return for a quarterback they no longer wanted and added a signal-caller with, perhaps, the highest upside in the class.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "A year after taking Olu Fashanu in Round 1, the New York Jets kicked off their draft with another offensive tackle.\n\nFashanu should enter 2025 as the team's starting left tackle, leaving the right side open for Missouri's Armand Membou. Right tackle is Membou's natural position, so fans should see the rookie start early in the season.\n\nWhile New York could have considered other prospects at No. 7, including tight end Colston Loveland and linebacker Jalon Walker, Membou was a very sensible selection.\n\nThe 10th-ranked player on the B/R board was also perhaps the cleanest line prospect in the 2025 class. With Membou in the fold, the Jets should be able to get an accurate look at what they have in free-agent quarterback Justin Fields.\n\nAnd while the Jets passed on an offensive skill player in Round 1, they got one near the top of Round 2. LSU tight end Mason Taylor should give New York the dynamic pass-catching tight end it hasn't had in recent years.\n\nCornerback Azareye'h Thomas has the potential to be a quality starter early in his career. Taking Arian Smith represented a solid gamble on explosive traits, though the Georgia product is a boom-or-bust prospect.\n\nIt was a surprise to see the Jets ignore quarterbacks who could be developed behind Fields or eventually push him for the QB1 role. Darren Mougey could have done much worse in his first draft as New York's general manager, though.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Yes, the Tennessee Titans passed on a potentially elite prospect like Travis Hunter or Abdul Carter to take Miami quarterback Cam Ward No. 1 overall. No, that doesn't mean that general manager Mike Borgonzi made a mistake.\n\nThe Titans needed a true franchise quarterback. They got the best QB prospect in the draft—or, at least, the top-ranked QB on the Bleacher Report Scouting Department's final draft board.\n\n\"The combination of arm talent, mobility/athleticism, and accuracy is what the NFL is looking for in potential franchise QBs,\" Dame Parson of the B/R Scouting Department wrote of Ward. \"He has superstar potential if he can cut down on mistakes/risky decisions.\"\n\nWard may not be a totally finished product. However, he's a terrific high-upside project for head coach Brian Callahan, who landed the Tennessee job after working with Joe Burrow in Cincinnati.\n\nTennessee then waited until the 52nd overall pick to make its second selection of the draft—after adding the 52nd and 82nd picks in a trade down with the Seahawks. With that selection, the Titans grabbed UCLA edge-rusher Oluwafemi Oladejo.\n\nOladejo should partner with free-agent additions Dre'Mont Jones and Cody Barton to help bolster Tennessee's pass rush. Safety Kevin Winston Jr., the 45th prospect on the final B/R board was a bargain in Round 3.\n\nIncoming players Chimere Dike, Gunnar Helm, Elic Ayomanor and Kalel Mullings should help Ward adjust to life in the NFL. The most important thing, though, is that Tennessee got its guy at quarterback.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Washington Commanders found their franchise quarterback when they took Jayden Daniels second overall in last year's draft. A year later—thanks in no small part to Daniels' rookie success—Washington selected near the bottom of the draft order.\n\nDaniels is the key to the Commanders' future, so protecting him should be a top offseason priority. After trading for left tackle Laremy Tunsil, Washington used its first-round pick on Oregon's Josh Conerly Jr.\n\nConerly should have a chance to compete at right tackle as a rookie, though his collegiate experience came on the right side. He may also be viewed as an heir to Tunsil at left tackle, as Tunsil is only under contract through 2026.\n\nThere's nothing wrong with investing in the trenches, though Washington may have reached a bit for Conerly, who was the 40th-ranked prospect on the final B/R board.\n\nLate in the second round, the Commanders added to an already respectable secondary—Washington ranked 10th in net yards allowed per pass attempt last season—by taking Mississippi cornerback Trey Amos.\n\nAmos, 2024 trade acquisition Marshon Lattimore and 2024 second-round pick Mike Sainristil could give the Commanders a championship-caliber cornerback trio. Amos was the 44th-ranked overall prospect on the B/R board.\n\nIt was largely depth after those two, though Virginia Tech receiver Jaylin Lane could see some early playing time as a rotational slot receiver. Of course, Washington didn't have a ton of draft capital with which to work. Getting two likely starters in Conerly and Amos should be viewed as a win.",
    "sourceName": "Bleacher Report",
    "sourceUrl": "https://bleacherreport.com/articles/25190015-2025-nfl-draft-grades-every-team-br-nfl-scouting-dept",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "I liked what they did. They addressed major needs on defense with their first three picks. First-round pick Walter Nolen adds a nice push-the-pocket player to the defense. Burch and fourth-round linebacker Cody Simon both could be steals.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They were bold on the first day, adding two speedy edge players who can liven up the pass rush. Walker came with the 15th pick and then adding Pearce was another big move. The draft will be defined by Pearce. If he plays to his top-10 talent, they nailed it. They also took two safeties, which they needed to do.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Ravens are one of those teams that always seem to draft well. General manager Eric DeCosta does a great job of landing players who fit what they want. This draft was no different. First-round safety Malaki Starks adds a rangy player to the defense and I love Jones in the third and receiver LaJohntay Wester in the sixth. If Green hits, it's a heck of a draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bills had to get a corner, a young edge and inside player for their defense. They got all three in the first four rounds. That's good drafting. Hairston will be a star. He plays with an attitude that you love at the position. Third-round edge Landon Jackson is a power player who did some good things against fourth-overall pick Will Campbell when they faced off. Fourth-round defensive tackle Deone Walker could be a steal and he's a monster inside -- if he stays in shape.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They clearly wanted to get a weapon for Bryce Young and some edge help, which they did with their second- and third-round picks. They took receiver Tet McMillan in the first, which will help Young, but I worry about his separation speed. The two pass rushers in Nic Scourton (second) and Umanmielen have talent, but they didn't always play to it. Tight end Mitch Evans in the fifth could be a nice pick.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They had four picks in the top 62 and added two pass catchers, an offensive lineman (Ozzy Trapilo) and a defensive lineman in Shemar Turner. I didn't love the pick of Burden, but the rest of the class was solid -- even if it was a little high for Trapilo. But tackles do go fast. Fifth-round corner Zah Frazier is long and athletic.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "I didn't love their draft. Stewart is so raw that it could take time. Second-round linebacker Demetrius Knight has some pop and will help at a need spot. I do like guard Dylan Fairchild in the third. But this is a draft that will be all about Stewart and his development. Sixth-round running back Tahj Brooks has talent and I like his chances as a third-down back.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They clearly have an eye on the 2026 draft with the trade they made. They can get their quarterback then, even if they took Dillon Gabriel in the third and Sheduer Sanders in the fifth this year. First-round pick Mason Graham is a good player who will be an immediate starter. Fourth-round running back Dylan Sampson has a chance to be a good runner and compete with second-round back Quinshon Judkins. The focus will be on Sanders, but it shouldn't be.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They added some good players, even if taking a guard at No. 12 seems high. Tyler Booker, that guard, will be a good player. I do like Revel in the third-round edge Donovan Ezeiruaku in the second. I love running back Jaydon Blue in the fifth. It was a good haul, but I wanted to see an early receiver taken.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Taking corner Jahdae Barron in the first gives them another nice player on the back end. Harvey can rip off big plays, but he went too high by my book. I know Sean Payton sees him as Alvin Kamara-like. I like Jones in the third, and third-round receiver Pat Bryant can play.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2025,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "This isn't a draft that I loved, which is a departure from their recent drafts. Williams is a good player, but was that really a need? Why not an edge? Third-round receiver Isaac TeSlaa is a project who didn't do a lot in college and they traded up to get him. Fifth-round guard Miles Frazier has starting experience.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They added two receivers in their first three picks, which was a must. Taking Matthew Golden in the first was a good move and then getting Williams in the third was another good one. Belton has skills and will fit their offense, but he went a little high for me. Fifth-round linebacker Collin Oliver was impressive before a foot injury derailed him after two games last season.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They did a lot of moving around and added two receivers, a guard-tackle, a corner and basically with their first five picks. It didn't really do a lot for me, even if I do like Higgins. They must really like running back Woody Marks since they traded up to get him in the fourth. Seventh-round defensive tackle Kyonte Hamilton is a sleeper.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Tight end Tyler Warren was a nice first pick, giving them something they haven't had since Dallas Clark, which is a player teams have to defend from the tight end spot. Walley will be a steal and I do like second-round edge J.T. Tuimoloau, but offensive line might have been a better choice there. Fifth-round running back D.J. Giddens is a nice player.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "In his first draft running things, new general manager James Gladstone had a great draft. The trade to get Hunter was big, and gives them another playmaker, but they added a bunch of good players. I love guard Wyatt Milan in the third and running back Bhshul Tuten in the fourth. This once-slow team can now fly. Seventh-round center Jonah Monheim is a good player.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "I really liked their draft. Simmons will be a star. Norman-Lott can be really good. Third-round edge Ashton Gillotte was one of my favorite players in this draft and was on my Better-Than team. Third-round corner Nohl Williams and fourth-round receiver Jalen Royals will be nice additions and I liked seventh-round back Brashard Smith.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "New general manager John Spytek had a good first draft. Taking running back Ashton Jeanty in the first was a good move, but he added a lot of good players. Bech and fourth-round receiver Dante Thornton Jr. will help the passing game. Third-round corner Darien Porter could be a steal. Sixth-round quarterback Tommy Mellott is a player they will move to receiver.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They landed good football players up and down the draft board, guys I really liked. Taking running back Omarion Hampton in the first will give the offense some juice in the running game. Caldwell will be a steal. I like tight end Orande Gadsden Jr. in the fifth. It was nice haul.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They traded out of the first round to land a 2026 first-round pick from the Falcons. That's a different approach for them, but it made sense. I do like second-round tight end Terrance Ferguson and Stewart. Both will be good players. Fifth-round linebacker Chris Paul is a good player.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "They only had two picks in the first four rounds, which limits what you can do. Grant is good and Savaiinaea is as well, but he better be special for what they did to get him. Quinn Ewers in the seventh is an interesting pick.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They only had two picks in the top 102, which limited what they could do. First-round guard Donovan Jackson is a good player who will upgrade the interior. Felton is a sleeper receiver, but the rest of the draft didn't add much. Sixth-round linebacker Kobe King has a chance to be a contributor down the road.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Taking Will Campbell in the first gives them their blind-side left tackle for Drake Maye. I still think he's more of a guard, but time will tell. Getting running back TreVeyon Henderson in the second and Williams in the third will also help Maye. This draft was all about their second-year quarterback, and it should have been.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "First-round offensive linemen Kelvin Banks will help solidify that unit up front and will develop into a good player. I didn't like Shough in the second, but the rest of their draft was solid. Shough has to develop into a starter for this to be a good draft -- and I wonder if he can.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Getting Carter in the first round was easy, but they passed on a quarterback and then came back in to get Dart at pick No. 25. This draft will be defined by Dart's growth as a player. If he's good, it's a great draft. If he isn't, it's a bad one. I did like the pick of fifth-round tackle Marcus Mbow.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "They added some good football players in Membou, Taylor and third-round corner Azareye'h Thomas. But they all have some questions. I do like fourth-round safety Malachi Moore. He will be a nice player.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They went defense with their first five picks to fortify a unit that suffered some losses in free agency and has some injury issues. First-round linebacker Jihaad Campbell was the best off-ball linebacker in this draft. I like quarterback Kyle McCord in the sixth. They added a bunch of other talented players. Howie Roseman had another good draft.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "They didn't take a quarterback until taking Will Howard in the sixth, which says a lot about how they felt about this class. Instead, they did what the Steelers usually do, which is take big people to help their defense. Getting Harmon was a smart move, rather than forcing a quarterback in the first.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It was clear the 49ers wanted to rebuild their defensive line to go with Nick Bosa. They did a nice job of that by taking Mykel Williams in the first and getting defensive tackles from Collins in the second and West from Indiana in the fourth. Consider it rebuilt. Fifth-round running back Jordan James should find a role as a backup.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Getting offensive lineman Grey Zabel in the first was a good, sound pick and they followed that up by taking South Carolina safety Nick Emmanwori, who I thought could go to them in the first. It was a solid draft -- if not special. I do like fifth-round receiver Tory Horton.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "It's time Bucs general manager Jason Licht gets the due for being a good drafter. He continues to nail his picks. This draft was no different. Egbuka going in the first was a little odd -- even if he is a good player -- but Licht made up for it the rest of the draft. He got two corners in Benjamin Morrison and Parrish, which they needed. I like seventh-round receiver Tez Johnson. He plays faster than he ran at the combine.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "This draft will be defined by what Ward becomes as a player. If he's a star, it's a great draft. If he's just OK, it's a problem. I do like second-round edge Oluwafemi Oladejo and Winston in the third. Fourth-round Gunner Helm is a good tight end. They picked a lot of players to help Ward, which is smart.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "They landed a young offensive tackle with a lot of upside in the first in Josh Conerly Jr. He will compete right away to start. With a young quarterback, you can never have enough good linemen. Getting Amos in the second was a nice pick. They didn't have a lot of picks because of trades for veterans, but did a solid job with what they had.",
    "sourceName": "CBS Sports",
    "sourceUrl": "https://www.cbssports.com/nfl/news/priscos-nfl-draft-2025-grades-for-every-team-including-best-and-worst-picks-for-all-32-franchises/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "When you draft for best player available, you can end up with two running backs and two quarterbacks. Drafting Gabriel over Sanders (who the Browns passed over seven times) was a stunner, but so was Sanders falling to No. 144. Graham is a stud, Fannin set NCAA tight end records, and they acquired a 2026 first-rounder.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "You can't beat picking arguably the best player in the draft at No. 3 then trading two third-rounders to get back into the first round for coach Brian Daboll's handpicked future QB. Alexander could be a Week 1 starter. Skattebo is the perfect power complement to Tyrone Tracy Jr.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Zabel, the practice player of the week at the Senior Bowl, has five-position versatility. Emmanwori (No. 35) and Arroyo (No. 50) are steals at those spots. Milroe has the highest-ceiling of all 2025 QBs, but will he be used as a gadget runner while he develops?",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Campbell was the first of three top-10 offensive tackles. Did the Patriots pick the right one — short-arm concerns be damned? Speed and athleticism at receiver was a must-get. Wilson, the draft's best center, was available in Round 3. Henderson could be in line for lots of carries.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Shough is the Saints' first top-two round QB draft pick since 1971. He's 25 years old and ready to play if Derek Carr is out for the season. Banks was a late riser who started from Day 1 at Texas. The Saints might have won rounds three and four.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Unique situation keeping two sets of college teammates together. Higgins and Noel combined for 167 catches for 2,377 yards last season. It was surprising that they couldn't squeeze more out of the Giants to trade out of Round 1. Ersery was a must after trading away Laremy Tunsil.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Is Williams going to be the next Georgia pass-rusher who has better numbers in the NFL than college? He better be at No. 11. The defense was picked apart in free agency and is starting to be rebuilt. Collins is a rare physical specimen.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Simmons is coming off season-ending surgery but should be a Week 1 starter on a team that needs to better protect Patrick Mahomes.  Norman-Lott plugs a hole created in free agency. Williams led the FBS with seven interceptions last season. Royals had 15 touchdown catches in 2023.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Jeanty is going to have to be Saquon Barkley- or Christian McCaffrey-level good to justify the No. 6 pick. And he can be. The four Day 2 picks should all be immediate contributors.  Bech led a loaded 2021 LSU receiving corps in catches and Porter is a late-bloomer.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "A WR1 was badly needed for Bryce Young, and McMillan plays like a basketball forward. Back-to-back Day 2 edge rushers — both on trade ups — made sense for a defense tied for No. 29 in sacks last season. Etienne is the younger brother of Jaguars' runner Travis.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Egbuka is a high-floor receiver who is a luxury alongside Mike Evans and Chris Godwin. Morrison is an interception machine, if he is healthy after two surgeries in 2024. If he isn't, Parrish offers extra insurance. Walker could be a small-school star.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A touchdown-scorer was needed, but the Cowboys are trying to recapture their great line of the 2010s with three first-round picks since 2022 (Booker, Tyler Guyton, Tyler Smith). Revel is a bargain if his torn ACL rehab checks out. Ezeiruaku reminds some of the departed DeMarcus Lawrence.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A top-10 player with pass-rush ability on the Eagles' draft board fell into their laps at No. 31. Why does that happen every year? Mukuba joins 2024 draft picks Cooper DeJean and Quinyon Mitchell in a dynamic young secondary. Two trade-downs in the third round.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Membou could be the finishing piece to the NFL's best young offensive line. Taylor drew late first-round interest and could be a rookie starter in a light pass-catching corps. The feisty Thomas was a rare clean medical evaluation among corners in this class. Waited too long to address wideout.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Hunter better be as good as advertised — Pro Bowler on both sides of the ball — considering how much was traded to move up from No. 5 to No. 2. Neither Milium nor Ransaw — picked No. 88 and No. 89 — had a top-100 grade from The Post.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Ward was the unquestioned No. 1 quarterback in the class. Will they regret taking him over \"can't-miss\" prospects Abdul Carter and Travis Hunter? The Titans traded down to land Oladejo then turned the extra pick into Winston, who would've gone much higher if not for a torn ACL.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The multi-year search for a tight end is over. And it ended with great value as the multi-dimensional Warren fell to No. 15. Tuimoloau had 6.5 sacks in four College Football Playoff games. There were several better cornerbacks available at No. 80 than Walley.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Golden, the fastest offensive player at the combine, ended a 22-year drought of not picking a first-round receiver. Williams doubled the weapons. Sorrell stayed in the draft's green room until pick No. 124 and had a memorable emotional moment. Belton could be the rookie starting left tackle.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Drafting Hampton after signing free agent Najee Harris is interesting. Tre Harris (17.7 yards per catch the last two seasons) on the outside with Ladd McConkey in the slot could be a dynamic receiving duo for years. Caldwell fits a prototype for head coach Jim Harbaugh.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Starks-Kyle Hamilton could quickly become the NFL's best young safety tandem. Green in the late second round was great football value, but his two separate sexual assault allegations (both denied) brought more focus to veteran kicker Justin Tucker's ongoing sexual misconduct investigation. Jones has inside-outside versatility.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Barron is an example of the NFL's newest craving: the do-it-all slot back. Harvey's production is eye-popping — 458 carries and 42 touchdowns over the last two seasons — but is that too much tread on the tires? Bryant was a reach because of below-average speed.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Acquiring a 2026 first-rounder to move from No. 26 to No. 46 was worth it, though it was a surprise to see Ferguson before TE Elijah Arroyo. Why no cornerback on Day 2? Stewart is undersized but finds a way.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Conerly is on an upward trajectory. Wise move to protect franchise QB Jayden Daniels. Lane is fearless punt returner who can break tackles as a receiver, too. Amos is a man-to-man corner who can start early. Day 2 draft depth was traded for veterans.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The mayor of Buffalo could lose a popularity contest if the ballhawking speedster Hairston pairs great play with a magnetic personality. Addressing the defensive front with each of the next three suggested the Bills are just going to overtax Josh Allen to score points again.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "After failed attempts to trade up, the Bears took Loveland over consensus No. 1 TE Tyler Warren. Did they panic? Going back to receiver after 2024 first-rounder Rome Odunze was strange, too, though Burden is more of a Deebo Samuel-type. An offseason-long offensive makeover continued.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Stewart is going to have to be a much better finisher (39 pressures became 1.5 sacks in 2024). There are no more points for athleticism. A dearth of high-quality linebackers pushed Knight up the board for a second-round reach.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "A few months ago, Johnson could've been the first-rounder and Nolen the second-rounder. There are questions about Nolen's level of commitment and Johnson's long injury history. Burch, a former five-star recruit, finally lived up to his potential last season. Very boom-or-bust.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "The Falcons' last player to reach 10 sacks was in 2012. So, they went with two first-round edge rushers — trading a 2026 first-round pick for Pearce, who was red-flagged in other places for his coachability. Then they went with double safeties who combined for 24 career interceptions.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Their defensive line depth was ravaged last season, so the Lions added Williams to push the pocket from the interior. TeSlaa felt like a significant reach on a trade up. The Lions know how to draft offensive linemen, and Ratledge could be a Week 1 starter.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2025,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "Out of college teammate Mason Graham's shadow, Grant is the run-stopper sorely missing from this defense — hence his over-drafting (No. 13).  Going about 100 picks — no third- or fourth-rounder — without selecting was too risky in a make-or-break year. Savaiinaea adds a much-needed physical presence to a finesse offense.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2025,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "The run-game-mauler Jackson was the multi-year best player on Ohio State's offensive line, including a move to left tackle during the national-championship run. But his pick at No. 24 felt too need-based. After a 78-pick wait, Felton was picked rather than addressing multiple needs in the secondary.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2025,
    "grade": "D",
    "gradeNumeric": 1,
    "text": "Not addressing quarterback in the first five rounds and banking on fickle free agent Aaron Rodgers to sign was a bold (read: ill-advised) choice. Harmon, whose mother passed away hours after he was drafted, is an inspirational story. Johnson is a classic Steelers downhill runner.",
    "sourceName": "Yahoo Sports",
    "sourceUrl": "https://sports.yahoo.com/article/2025-nfl-draft-grades-32-211418581.html",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Adding splashy defensive tackle Walter Nolen in the first round was an ideal final touch to a masterful offseason dedicated to improving Arizona's front. Nolen has some boom or bust to him, but the talent is undeniable and Jonathan Gannon's proven ability to develop defenders makes him an intriguing investment. If healthy, cornerback Will Johnson offers top-10 talent at a discount price as the No. 47 overall pick. Jordan Burch is an intriguing talent who could pop in Gannon's scheme, as well. While I'm excited for all the improvements made to Arizona's defense in this draft, I question if enough was done to upgrade the offensive line, tempering my enthusiasm for this group, overall.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "There is something to be said for approaching a draft with clear-cut goals and addressing those needs. Similar to the Cardinals one spot earlier, it had to be refreshing for defensive-minded head coach Raheem Morris to so thoroughly address a sagging Atlanta pass rush, investing not one but two first-round picks in twitchy sack stars Jalon Walker and James Pearce Jr. I love Walker's versatility and alpha-dog mentality, and Pearce might just be the bendiest rusher of this class (though he doesn't chip in much against the run). Each offers immediate impact potential, as does the Falcons' new safety tandem of Xavier Watts and Billy Bowman Jr. in the middle rounds. Both are natural ballhawks capable of taking advantage of the green quarterbacks of the NFC South. The Falcons only had five picks to play with, and their double-dipping strategy leaves almost zero room for error.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "In the days leading up to the draft, Ravens GM Eric DeCosta spoke about his anticipation of adding a cornerback and safety. Who knew at that time that he meant it happening with one player in the opening round? That's the positional versatility Malaki Starks should offer Baltimore, giving the club a plug-and-play option at strong safety alongside star Kyle Hamilton and added flexibility at the nickel and dime corner spots. The culture established by DeCosta and head coach John Harbaugh seemingly made them comfortable drafting CFB sack leader Mike Green at No. 59 overall despite disturbing off-field allegations. But like Starks, he winds up in an ideal landing spot. Middle-rounders Emery Jones Jr. and Carson Vinson starred at tackle in college but could be best suited inside for the Ravens. Of their staggering eight selections on Day 3, I'm highest on them and speedy cornerbacks Bilhal Kone and Robert Longerbeam. It is difficult to improve a team as talented as Baltimore with rookies, but this draft class is loaded with both quality and quantity.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Sometimes, it isn't just the positional fit that warrants a high grade but the specific prospect chosen. I love Buffalo's bet on the speed and playmaking of cornerback Maxwell Hairston, as the Bills needed more game-breaking ability on the defensive side of the ball. GM Brandon Beane could have stuck to the \"same old\" Bills formula of drafting good, physical players, but Hairston is a gamble that could be the finishing touch needed for a Super Bowl run. Following the early investment made in Hairston — the fastest player at the Combine this year — the Bills returned to the \"black-and-blue\" strategies of prior drafts, dedicating their first five picks on defenders, including a trio of former SEC tough guys on the defensive line in T.J. Sanders, Landon Jackson and Deone Walker. The blue-collar mentality remained a focal point deep into Day 3, even as the Bills went to tight end and cornerback with Jackson Hawes and Dorian Strong, each of whom will be adding some grit and physicality to their respective position rooms in Buffalo.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Clearly, Carolina needed to get Bryce Young help at receiver, and Tetairoa McMillan possesses the size, ball skills and production to suggest he can be that. I'm eager to see if \"T-Mac\" emerges as the clear-cut WR1 expected of a top-10 selection, as I wasn't as high on him as many others in the media. However, I'm significantly higher on Nic Scourton than many draft analysts seem to be, and love the pro-readiness and value he offers as the 51st overall selection. Princely Umanmielen might play the same position, but he's an entirely different style of outside linebacker than Scourton, winning with speed and agility. Of Carolina's Day 3 selections, I'm most excited about their early picks of running back Trevor Etienne and safety Lathan Ransom, who possess not only juice but the toughness necessary to be longtime contributors.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Given the way that Sam LaPorta helped the Detroit Lions the past two seasons, few know better than new Bears head coach Ben Johnson the immediate impact a playmaking tight end can make. While I was slightly surprised to see Colston Loveland drafted ahead of Tyler Warren, the former is actually a better schematic fit for the Bears given that the club already boasts a quality dual-purpose tight end in Cole Kmet, allowing Loveland to play more of the \"big receiver\" role. I liked the Bears' selection on Thursday, but I loved their picks on Friday. Wide receiver is not a position I expected them to focus on early, but Luther Burden III is the best receiver after the catch in this draft and will make their offense (and special teams) instantly more explosive. Similarly, I like the pro-readiness and nastiness that fellow second-rounders Ozzy Trapilo and Shemar Turner provide. Of the Bears' Day 3 picks, I'm most intrigued by the upside of UTSA cornerback Zah Frazier, who offers many of the traits that have helped Tariq Woolen — another former fifth-round pick — emerge as a starter for the Seahawks.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Year in and year out, the Bengals gamble on traits, and that was again the case in 2025 with the selection of Shemar Stewart, a virtual lottery ticket of an athlete and exactly the kind of insurance policy needed with Trey Hendrickson a possible trade candidate. Insurance, in fact, seemed to be the strategy for Cincinnati in this draft, with second- and fourth-round selections used on inside linebackers Demetrius Knight Jr. and Barrett Carter, signaling that popular veterans Germaine Pratt and Logan Wilson might also be on the way out. While much of the focus will understandably lie with the Bengals' defensive prospects, I like the talent and value of blockers Dylan Fairchild and Jalen Rivers, as well as running back Tahj Brooks, a Sherman tank of a runner with excellent balance through contact.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2025,
    "grade": "C-",
    "gradeNumeric": 1.7,
    "text": "The Browns are either the smartest team in the NFL or, more likely, a ship without a rudder. Early and late, their choices were confounding. First off, while Cleveland got a very good player in Mason Graham at No. 5 overall and convinced the Jaguars to give up their 2026 first-round selection to move up just three spots, I don't like trading away the opportunity to land a true blue-chip talent like Travis Hunter or Abdul Carter. Now, to be fair, Graham is as safe as this class gets, and he certainly adds beef and tenacity to a defensive line boasting arguably the league's most dynamic defensive end in Myles Garrett. However, he isn't the \"special\" talent normally associated with a top-five selection. While similarly safe, Carson Schwesinger at No. 33 overall was also a case of paying a premium price for a good (but not great) player at a position that wasn't of dire need. And then, of course, was the double-dipping at quarterback (and running back). Obviously, if either Dillon Gabriel or Shedeur Sanders wind up being Cleveland's long-term solution at quarterback, then GM Andrew Berry and Kevin Stefanski deserve praise. But is Cleveland's plan to keep five quarterbacks on the roster? Neither Gabriel nor Sanders appear likely to be realistic options to start in the season opener, and the Browns brought in Joe Flacco and Kenny Pickett in the offseason with Deshaun Watson still on the books. In a vacuum, I like the prospects brought in by Cleveland, including both runners Quinshon Judkins and Dylan Sampson, as well as tight end Harold Fannin Jr. I'm just not convinced that this seven-man class will help the Browns win more games in 2025.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Give Jerry Jones and the Cowboys some credit. For a franchise that once prioritized playmakers — sometimes irresponsibly — Dallas chose to begin its draft with the biggest, nastiest blocker of this class in Tyler Booker, wisely providing the girth and guts needed to combat the dominant defensive lines of the NFC East. Further, Day 2 picks Donovan Ezeiruaku and Shavon Revel Jr. were quality value selections who filled positions that had been decimated in recent years by free-agent defections and injuries. While I liked the Cowboys' strategy to reinforce their offensive line and defense, they were surprisingly quiet on the playmaker front. Fifth-round running back Jaydon Blue certainly adds the element of straight-line speed, but I believe Dallas really needed to upgrade its receiving corps beyond CeeDee Lamb.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Given that I projected the Broncos to select a running back at No. 20 in virtually every mock draft I wrote this offseason, I can't say that I foresaw their pick of Texas cornerback Jahdae Barron. That admission aside, I love the addition. It takes a special breed of confidence to play opposite a superstar like Patrick Surtain Jr., and Barron has that — a critical element given the passing attacks of the AFC West. Like Barron, running back RJ Harvey offers a résumé few can touch, though he came off the board earlier than I expected. I felt the same about former Illinois wide receiver Pat Bryant, though both play with the instincts and physicality well-suited for Sean Payton's scheme, as does LSU power edge rusher Sai'vion Jones, a player whose best football still lies ahead of him.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "I was fascinated to see how GM Brad Holmes and the Lions would approach this draft given all their coaching departures in the offseason. Tyleik Williams could audition as a stunt double for injured standout defensive tackle Alim McNeill, offering similar size, power, agility and leadership skills. Meanwhile, the Lions might have found a clone of their head coach Dan Campbell in second-round guard Tate Ratledge, one of the more imposing and intense players of this class. Between Ratledge and fifth-round pick Miles Frazier, the Lions' lineage up front is secure. In terms of value, I liked the sixth-round selection of defensive end Ahmed Hassanein more than the third-round pick of wideout Isaac TeSlaa, though the latter's intriguing size/speed combination is a welcome complement to the shiftiness and speed of Detroit's current receiving corps. Finally, don't be surprised if seventh-round pick Dan Jackson makes this club.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The first round could not have played out much better for the hosting Green Bay Packers, who capitalized on the speediest wide receiver in the class — Matthew Golden — falling into their queso. Specifically, it provides them with the home-run hitter needed to take quarterback Jordan Love and this offense into another stratosphere. The Packers added a much bigger and even more versatile pass-catcher in Savion Williams in the third round. Speaking of size, the Packers got plenty of that in North Carolina State offensive lineman Anthony Belton in the second, power edge Barryn Sorrell in the fourth and defensive tackle Warren Brinson in the sixth, boosting the bulk and versatility on both sides of the line of scrimmage for Green Bay.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Sure, it was frustrating for Texans fans to watch the first day of the draft come and go without a pick being made, but GM Nick Caserio's patience will be rewarded next year with Houston now owning two first-round selections in a class expected to be much richer than this one. And let's be real — that 2026 New York Giants pick could be a high one. Even better, Caserio put together an intriguing class this year, filling the need for an athletic tackle with the Big Ten's blocker of the year in Aireontae Ersery and adding former Iowa State teammates Jayden Higgins and Jaylin Noel in the second and third rounds, respectively. Polar opposites in style, the duo offer size, speed and reliable hands, greatly improving Houston's depth at receiver. The Texans added another duo of college teammates in cornerback Jaylin Smith and Woody Marks (both from USC), with the latter arguably the best receiving back of this class.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Whether it's Anthony Richardson or Daniel Jones (or rookie Riley Leonard, for that matter) operating at quarterback for the Colts in 2025, this is a club built around their stable of runners, featuring, of course, star running back Jonathan Taylor. With opponents understandably crowing the line of scrimmage to slow the Colts' running game, adding a playmaking tight end was crucial. I love how the first round played out for GM Chris Ballard, as Tyler Warren should excel in this role and prove that the Colts stole him at No. 14. I feel that powerful edge rusher JT Tuimoloau (45th overall) and shifty running back DJ Giddens (151st) will also ultimately outperform their draft slots. I was, however, surprised that the Colts didn't add more bodies up front for the offensive line, given the significant free-agent defections.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Look, I'm as high on Travis Hunter as anyone. I've long been referring to him as the top prospect in this class and a generational talent since his first game at Colorado. And I love the pairing of Hunter with Brian Thomas Jr. and, of course, both Liam Coen and Trevor Lawrence. But Hunter had damn well better be prepared to play two positions full time to justify Jacksonville's borderline reckless trade of its 2026 first-round selection to move up three spots to get him. Anything less than immediate superstardom for Hunter and the Jags will look foolish. The long wait to pick again — Jacksonville went 86 selections before being back on the clock — only reinforces how important the Jaguars made him to their class. I like the addition of gritty corner Caleb Ransaw and dependable blocker Wyatt Milum in the third round, as well as the big-play potential offered by Day 3 running backs Bhayshul Tuten and LeQuint Allen.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Andy Reid gets a lot of credit for the Chiefs' success on game day and justifiably so. But GM Brett Veach delivered a master class on patience and value in the first round, as well, coaxing the Philadelphia Eagles out of a fifth-round pick (which KC ultimately traded to Pittsburgh) to drop a single spot and select Ohio State's Josh Simmons, a talent worthy of a top-15 pick when healthy and filling a huge need at tackle. I was surprised that Kansas City didn't invest more picks on the offensive line the rest of the way, but I love the talent added. Omarr Norman-Lott is a penetrating defensive tackle who can provide immediate juice to the Chiefs' defensive line, with the underrated Ashton Gillotte potentially doing the same on the outside. Middle-rounders Nohl Williams, Jalen Royals and Jeffrey Bassa were some of my favorite \"second-tier\" prospects at their respective positions in this class. The advanced degree of difficulty in drafting for a team that has relatively few holes cannot be overstated. Veach and the Chiefs handled it masterfully, turning in one of the best classes of this year's draft — slipping only slightly because I thought they needed more help along the offensive line.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "No team has undergone more of a transformation on offense over the offseason than the Raiders, whose selection of Ashton Jeanty (and earlier trade for Geno Smith) vaporized whatever memories fans might have of last year's offense. A true bell cow, Jeanty is a future NFL superstar, and he's going to a head coach in Pete Carroll who won't hesitate to feature him as such. Jeanty deserves praise, but so does the rest of the Raiders' incoming class. I especially loved the Raiders' Day 2 picks. Wideout Jack Bech is going to quickly emerge as one of Smith's favorite targets. Darien Porter was born to play cornerback for Carroll, with the former wideout-turned-defender taking the same path to the NFL as Richard Sherman and Tariq Woolen. The Raiders also nabbed two of the more underrated blockers in this class, in the durable and dependable Caleb Rogers and Charles Grant. The back-to-back selections of small-school quarterbacks Tommy Mellott and Cam Miller probably raised plenty of eyebrows, but the former is an elite athlete whose future could be at receiver. The Raiders needed a renaissance … and this draft is the perfect capper to an offseason that delivered it.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Similar to their aforementioned AFC West rivals, there is something refreshing about the way that Jim Harbaugh has transformed the Chargers from a once-finesse style of offense into one seeking to punish opponents. Omarion Hampton's name might appear as a picture next to the term \"workhorse\" in online dictionaries next fall. Additionally, speedy big-play pass-catchers Tre Harris, KeAndre Lambert-Smith and Oronde Gadsden II give the Chargers the necessary vertical threats to take advantage of defenses creeping up toward the line of scrimmage. While the Chargers' splashy skill-position additions will generate much of the buzz, I also like the addition of tough guys Jamaree Caldwell and Kyle Kennard in the middle rounds.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Rams GM Les Snead once famously exclaimed \"f--- those picks,\" and his actions Thursday reflected that mindset, swapping out of the first round of this year's class to give his club two selections in the opening frame next year. And make no mistake, that pick from the Atlanta Falcons could be a good one. Frankly, the Rams might need it, as I thought their draft class this year was rife with reaches. Tight end Terrance Ferguson is a good player, but I was shocked to see him come off the board at No. 46 overall, and I feel similarly about running back Jarquez Hunter roughly two rounds later. I do like the physicality of edge rusher Josiah Stewart and the dependability of defensive tackle Ty Hamilton. Chris Paul Jr. was viewed as too small to be an effective inside linebacker in the NFL — but the same was once said about Ernest Jones IV. Snead and head coach Sean McVay have surprised me many times before, consistently turning poorly-reviewed draft classes into divisional winners. I'm eager to see if they can do it again, with the extra 2026 first-round pick boosting the grade.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2025,
    "grade": "D+",
    "gradeNumeric": 1.3,
    "text": "I can appreciate the rationale behind GM Chris Grier's decision to select massive nose guard Kenneth Grant at No. 13 overall. When the Dolphins' offense is healthy and humming, opponents have little choice but to try to run the ball to slow them down — and Grant is perfectly suited to clog up those lanes. That said, I believe the Dolphins paid an awful lot in draft capital for a player who simply hasn't dominated consistently — and the Dolphins spent two more picks on Day 3 on the position (on Jordan Phillips and Zeek Biggers), as well. My favorite picks for Miami in this draft were the burly blocker Jonah Savaiinaea in the second round and the late selections of running back Ollie Gordon (179th) and quarterback Quinn Ewers (231st), each of whom are intriguing fits in Mike McDaniel's offense.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "Given the highly aggressive moves GM Kwesi Adofo-Mensah made in free agency, the Minnesota's decision to stand pat and select Ohio State blocker Donovan Jackson is roughly the equivalent of walking past a litany of your favorite restaurants, only to go home and make yourself a peanut butter and jelly sandwich. That said, I like Jackson … a lot. I won't quibble too much with a playoff-caliber team investing in the blockers necessary to protect young quarterback JJ McCarthy. However, with the Vikings' next pick coming at receiver (Tai Felton) — obviously a relative strength of their roster — I thought they made some odd selections in this draft. Things got a little more logical in the later rounds, with the addition of flashy defensive tackle Tyrion Ingram-Dawkins, hard-hitting run-stuffer Kobe King at inside linebacker and steady, all-purpose tight end Gavin Bartholomew.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "General manager Eliot Wolf worked the 2025 NFL draft like he was at the grocery store, adding a total of 11 prospects to the cart and from just about every aisle. The selection of left tackle Will Campbell at No. 4 overall isn't the most exciting of draft day picks, but it was a good one, as he's a proven and polished blocker who fits in with the blue-collar mentality Mike Vrabel is seeking to rebuild in Foxborough, as well as the backside protector Drake Maye needs to take the next step. In the middle rounds, the Patriots made similar moves with the splashiest pure center of this class in Jared Wilson, as well as run-stuffing DT Joshua Farmer and twitchy edge rusher Bradyn Swinson. In between, New England boosted its skill position talent, nabbing one of this year's most dependable all-around running backs in TreVeyon Henderson, as well as the cat-quick Kyle Williams, giving Maye legitimate playmakers. I'm not convinced that the Patriots added many true superstars this year, but this was the foundational class the franchise needed to re-establish the roster.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Over the past five years, no team has invested more early picks on offensive linemen than the Saints, with No. 9 pick Kelvin Banks Jr. now joining Taliese Fuaga (No. 14 overall, 2024), Trevor Penning (No. 19, 2022) and Cesar Ruiz (No. 24, 2020). Banks offers the club lots of flexibility at tackle — the Saints recently declined their fifth-year option on Penning — while being viewed by some as a natural fit inside at left guard. It will be interesting to see who Banks is protecting at quarterback, after the Saints invested the No. 40 overall selection on Tyler Shough, who is as gifted a passer as there is in this class. His advanced age and durability concerns made him a polarizing prospect, but I like the gamble and trust both GM Mickey Loomis and new head coach Kellen Moore's eye for talent. I thought the Saints did a nice job of adding quality players in the middle rounds. I'm especially high on their fourth-round selections of linebacker Danny Stutsman and cornerback Quincy Riley, who led all DBs in this class with 15 interceptions at the college level.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Giants have yet to announce their decision on Kayvon Thibodeaux's fifth-year option, but drafting speed rusher Abdul Carter at No. 3 overall is a statement in itself. The two couldn't be much different. Thibodeaux is more of a power player, whereas Carter is greased lightning off the edge; each should excel on a defensive front that already boasts two established stars in Dexter Lawrence and Brian Burns. While Carter offers an immediate impact — I think he should be the early favorite for Defensive Rookie of the Year honors — give GM Joe Schoen credit for playing the long game, as well, by aggressively trading back into the first round to nab Ole Miss quarterback Jaxson Dart. The talented young signal-caller should get the time needed on the sideline to watch and learn effectively with veterans Russell Wilson and Jameis Winston already on the roster. Normally, middle-round picks are the ones requiring patience, but that may not be the case with their haul. Darius Alexander is among the more pro-ready defensive tackles in this class, with a veteran carpenter's tool belt of pass-rush moves. The same could be said for the runaway freight train that is running back Cam Skattebo — a seemingly perfect \"Thunder\" to the \"Lightning\" combination of speedier Tyrone Tracy Jr. and Devin Singletary. I also thought offensive tackle Marcus Mbow was a steal in the fifth round.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Aaron Glenn saw firsthand with the Detroit Lions what a dominant offensive line can do for a club, and the first-round selection of Armand Membou reflects a desire for physicality over flash. Membou's seek-and-destroy playing style as a run-blocker is a nice complement to a running game centered around Justin Fields and Breece Hall. Speaking of Fields, he leaned heavily on playmaking tight ends in his previous NFL stops, and the Jets landed arguably the most sure-handed big pass-catcher of this class with Mason Taylor. Glenn, a former cornerback himself, knows better than most that 40-yard dash times can be overrated and that the highly physical and instinctive Azareye'h Thomas plays faster than he timed. He'll prove a steal at No. 73 overall. Of the Jets' Day 3 picks, I liked the awareness and physicality of safety Malachi Moore and Francisco Mauigoa most.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "In a case of the rich getting richer, Howie Roseman nabbed the draft's most exciting off-ball linebacker in Jihaad Campbell at No. 31 overall, boldly moving up one pick to assure his addition. It was a move that made a lot of sense, as opponents will have little choice but to get the ball out quickly to running backs and tight ends in trying to avoid the Eagles' vaunted pass rush, and Campbell offers extraordinary agility in coverage. Roseman returned to the position later in the draft with yet another Georgia standout in Smael Mondon Jr., another fast and physical linebacker who flashes future starting ability. In between, the Eagles landed a natural cover safety in Andrew Mukuba and two of the more underrated and pro-ready interior linemen of this class, defender Ty Robinson and NFL legacy Drew Kendall at center. These weren't positions of need for the defending Super Bowl champions, but they only make the roster younger, hungrier and cheaper. That \"always compete\" mentality also made quarterback Kyle McCord an intriguing selection in the sixth round. No one is suggesting that he is going to push Super Bowl MVP Jalen Hurts, but he might challenge Tanner McKee and Dorian Thompson-Robinson. McCord flashes starter-caliber accuracy, serving as a late-round investment policy for a team that seemingly has it all.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Few teams prioritize size and toughness along the line of scrimmage like the Steelers, and first-round pick Derrick Harmon exudes both of those qualities. This wasn't the flashiest of selections — the Steelers rarely have those — but I love this pick for Pittsburgh and won't be surprised at all when Harmon winds up being a decade-long anchor. Similar picks were made in the middle rounds with stubby but savvy edge rusher Jack Sawyer and nose guard Yahya Black. Third-round addition Kaleb Johnson runs with the determination, contact balance and game-speed that might remind Steelers fans of James Conner. All four were seemingly born to be Pittsburgh Steelers. I also like the late-round selections of quarterback Will Howard and linebacker Carson Bruener, a special teams ace and the son of former Steelers' tight end and current West Coast scout Mark Bruener. If the Steelers were convinced that Howard was a realistic option to start the season opener at quarterback, GM Omar Khan would not have waited until the sixth round to draft him, but he does offer starter-like intangibles.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Pardon the pun, but the 49ers went mining for gold in the 2025 NFL draft and might strike it rich or strike out with this class, making it a fascinating one. Neither Kyle Shanahan nor John Lynch were employed by the 49ers when the club boasted one of the NFL's better, more rugged defensive ends in Justin Smith, but that is the kind of player Mykel Williams can be with a little more polish (and health). Similarly, massive defensive tackle Alfred Collins could turn into a monster, but he flashed more than finished while working his way through the depth chart at Texas over his college career. I see similar boom-or-bust potential with linebacker Nick Martin and twitchy but undersized cornerback Upton Stout, each of whom also struggled with injuries in college and, frankly, I thought were both reaches in the third round. If gambling on a player coming off of injury, I think it is wiser to do it late, as the 49ers did with quarterback Kurtis Rourke, who, when healthy, proved a legitimate weapon as both a passer and runner at both Ohio and Indiana. The one player I absolutely love for the 49ers is running back Jordan James, an instinctive back with terrific vision, lateral burst and contact balance. Like his father, Kyle Shanahan seemingly has a magic wand with running backs, and James will prove it once he gets his opportunity.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Football can be a complicated game, but sometimes the simplest solution is the right one. That was the approach the Seahawks took in the first round, nabbing their perfect schematic fit in Grey Zabel, the most versatile blocker in this class and a plug-and-play option at left guard. This was the earliest the Seahawks have drafted an interior offensive lineman since Hall of Famer Steve Hutchinson, and I'm not sure GM John Schneider enjoyed using his first-round pick on an interior blocker. But once he forced down those vegetables in the first round, the rest of the draft was dessert, and the Seahawks feasted as well as any team in the league, landing three other prospects in safety Nick Emmanwori, tight end Elijah Arroyo and quarterback Jalen Milroe, each of whom flashed first-round traits. Milroe, of course, won't be expected to play right away, with the Seahawks signing Sam Darnold in free agency. He does offer intriguing running ability, however, for an offensive coordinator (Klint Kubiak) who values a mobile quarterback, and a head coach (Mike Macdonald) who joined Seattle following time in Baltimore with Lamar Jackson. The Seahawks aren't likely to get the same production out of late-round receivers Tory Horton and Ricky White III as longtime stars DK Metcalf and Tyler Lockett, but each does offer legitimate big-play potential as well as special teams prowess. The Seahawks needed a splashy draft and got one. In terms of both quantity and quality, their 2025 class was as good as any in the league.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Double-dipping was the clear strategy for the Bucs in 2025 with two picks apiece dedicated to receiver, cornerback and edge rusher. The smartest teams draft for the future, anticipating rather than reacting, and that is precisely the strategy GM Jason Licht and the Bucs took in nabbing Emeka Egbuka at No. 19 overall, even with the seemingly ageless Mike Evans and Chris Godwin set to return this year. Egbuka was the second receiver off the board, but I think he's a safer pick than the first one — Tetairoa McMillan (to the NFC South division rival Carolina Panthers) — and a pass-catcher that will keep Baker Mayfield happily firing away. Seventh-round big-play magnet Tez Johnson has the quickness to surprise, as well. Benjamin Morrison and Jacob Parrish might very well prove Day 2 steals in the secondary, and I'm a fan of both of their new edge rushers, David Walker and Elijah Roberts — each of the prospects complement their respective running mates with different, unique skill sets. But in a class loaded with talented big men along the line of scrimmage and running backs, Tampa Bay's completely ignoring such spots was surprising.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Cam Ward wasn't my favorite prospect in this class (he ranked 14th on my final Big Board), but there is no denying his talent, improvement or, frankly, Tennessee's \"titanic\" need for improved play at quarterback. Ward is a natural playmaker who brings immediate excitement to the franchise. I just wish GM Mike Borgonzi had found more established pass-catchers to aid his adjustment to the NFL. The Titans did invest multiple 2025 picks on pass-catchers — adding speedster Chimere Dike, soft-handed tight end Gunnar Helm and red-zone specialist Elic Ayomanor — to a roster that already has former first-round picks in Calvin Ridley and Treylon Burks. If Ward continues his ascent, this might be enough. Of the three rookies, I'm highest on Ayomanor (picked No. 136 overall), who wins with body control and strong hands to steal passes above the rim. I do like the potential of the two defenders selected before the pass-catchers. Edge rusher Oluwafemi Oladejo and safety Kevin Winston Jr. show the kinds of flashes on tape that suggest each could ultimately prove among the very best at their respective positions from this class. And that is the theme of this Titans draft haul. It is heavy on potential but thin on sure things.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "A quarter of the prospects drafted in the first round of the 2025 NFL draft play along the offensive line, and the Commanders got arguably the most athletic of the bunch in Josh Conerly Jr. The No. 29 overall pick starred at left tackle for Oregon, but is likely to move to right tackle for the Commanders, providing an athletic upgrade over free-agent addition Andrew Wylie and the mobility necessary to assist the mesmerizing playmaker that is second-year star quarterback Jayden Daniels. Though wideout wasn't necessarily a position of concern for the Commanders, I really liked the addition of speedster Jaylin Lane in the fourth round. He'll help in the vertical game and as a returner. Given where he was selected, my favorite pick for the Commanders was cornerback Trey Amos (No. 61 overall), who's among the better press corners in this class. With only five draft picks, GM Adam Peters didn't have as many opportunities as most, but few did more with less.",
    "sourceName": "Fox Sports",
    "sourceUrl": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-grades-analyzing-all-32-teams-classes",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Broncos provided an excellent example of what selecting the best player available actually looks like, passing on running backs Omarion Hampton and TreVeyon Henderson in the first round for Barron, the 10th-ranked player on my final top 100. Either Hampton or Henderson would've filled a pressing need, but GM George Paton stuck to his board and took advantage of this running back class being one of the deepest in the last 20 years.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Simmons would've gone much higher had he finished the season healthy, and GM Brett Veach added significant talent at all three levels of the defense, while also adding two dynamic playmakers on offense. The Chiefs also secured a solid group of priority free agents, including Briningstool, the top-ranked tight end in the 2021 recruiting class.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Hampton is the long-term solution at running back, with Najee Harris only signed for a season. Tre Harris and Gadsden could form a prolific receiving trio with Ladd McConkey for years to come. Caldwell replaces Poona Ford, who bolted for the Rams in free agency.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Jeanty reminded me so much of LaDainian Tomlinson during my evaluation process, which is interesting now, considering how much L.T. used to torture the Raiders. The four Day 2 picks should all have an immediate impact, and I'm pretty sure the ghost of Al Davis turned the card in on Thornton in the fourth round. He features an elite combination of size and speed (4.30 40-yard dash in Indy), but he's barely played.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Bills got themselves three really good corners, and bolstered their defensive line. But how about lightening Josh Allen's load on offense a bit? Adding a receiver before the seventh round might have gotten them an \"A\" grade.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "GM Chris Grier addressed significant needs on the defensive and offensive line, and in the secondary, while adding a 2026 third-rounder from the Texans.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "The Patriots added the top tackle and center in this draft, a dynamic tailback and an immediate starter at receiver. That's how you support a young franchise QB. Defacto GM Eliot Wolf also landed two defenders in the fifth round many had going in the top 100 picks, including myself.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Jets passed on the draft's top two tight ends for Membou, the perfect bookend for last year's first-round pick Olu Fashanu, but ended up landing Taylor with their second pick. Thomas' 40 time dropped him into the third round, where he's an excellent value.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Another vintage performance by GM Eric DeCosta and the Ravens' front office. Pairing Starks with Swiss Army knife Kyle Hamilton could lock in the gains Baltimore's defense achieved during the second half of last season by having Hamilton defend the slot, and play closer to the line of scrimmage.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Stewart has one of the highest upsides in this draft, and the Bengals also bolstered their linebacker corps and interior offensive line, both weaknesses last season. However, they didn't address their porous secondary at all.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Adding a first-round pick in 2026, and still landing a top 5 player (Graham) in this draft deserves praise. I'm a huge fan of every selection that wasn't a quarterback in this group, but somehow taking Gabriel in the third (!) and Sanders in the fifth, a huge value obviously, muddies up their QB situation even more than it already was.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "I would've liked to have seen the Steelers add some depth to their O-line, but I appreciate GM Omar Khan not taking the bait on a QB in the first round. There's value and potential early impact with every player in this group.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "GM Nick Caserio added a 2026 third-rounder by trading out of the first round, allowing the Giants to jump back in to select QB Jaxson Dart. I love the Texans' first three picks, especially keeping Higgins and Noel together in the pros, but both Trojans (Smith and Marks) were reaches.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I was mildly surprised Warren actually made it to the Colts, but it was an obvious choice once he did. Tuimoloau, Travis and Giddens are solid picks by GM Chris Ballard, but Walley was a reach, and Indy needed a new starting right guard.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The Jaguars trading up to select Hunter was a stunning development in the first round, but it would soon be swept away by the story of Shedeur Sanders' shocking fall. Some may think the Jags overpaid, but if the Heisman winner pans out, it was a bargain. GM James Gladstone also added my 7th- and 9th-ranked running backs in this class, Tuten and Allen, to an already crowded group that includes Travis Etienne and Tank Bigsby.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "GM Mike Borgonzi secured the Titans a franchise QB and two ascending defenders with his first three picks. Then he focused on stockpiling weapons for Ward with his next three picks. I especially like them adding Restrepo, Ward's top target at Miami, as a priority free agent.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "GM Monti Ossenfort hyper-focused on improving the Cardinals' defense in this draft, and selected two potential stars if Nolen can continue to develop and Johnson can stay healthy.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The 2026 first-round pick they added in a deal with the Falcons, allowing them to jump back into the first to select James Pearce Jr., is what's propping this grade up. I like the players GM Les Snead added, especially Stewart in the third and Paul in the fifth, but three of the Rams' top defensive backs and their starting right tackle are a year away from free agency.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "I love how the Niners targeted their weak run defense from a year ago, replenishing their front-seven with four of their first five picks. Heck, even Stout, a nickelback, is strong against the run and has the name for it. But it appears GM John Lynch completely forgot about their potentially troublesome O-line. Colby was a solid value in the seventh round, but there's no timeline in the multiverse where waiting that long to address such a glaring need would be acceptable. Especially, when one could argue that their interior O-line is what has kept them from winning their first Super Bowl title since in over 30 years.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Outside of Warren with the Colts, no pick made more sense in the first round than Zabel to the Seahawks. Both Emmanwori and Arroyo could end up steals in the second round, and Milroe is the lottery ticket of this draft. There wasn't a QB with higher upside in this class.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2025,
    "grade": "C",
    "gradeNumeric": 2,
    "text": "As much as I like Booker for them, the Joneses really needed to upgrade their offensive skill-positions earlier in this draft. Also, Revel could be a steal in the third, but he's coming off an ACL tear, and considering how snakebitten the Cowboys secondary has been, it was an odd choice.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Trading two third-rounders (this year's and next) was a reasonable price to jump back into the first round for Dart, and both Carter and Alexander are home run picks. Skattebo and Mbow were both steals on Saturday, especially Mbow, who went two rounds later than anticipated. Both Fidone and Black were great values in the seventh round.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Another masterclass by GM Howie Roseman. Campbell, the 17th-ranked player on my top 100, fell into Roseman's lap at No. 31. He added an incredible amount of talent for a team who just beat the two-time defending champs in the Super Bowl 40-22 (really wasn't that close), especially when you factor in priority free agents Pierce and Hook. Both should have been drafted. Almost none of these players will start for the Eagles next season, barring injuries, but almost all of them would be challenging for a starting gig on the vast majority of other NFL teams.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "GM Adam Peters only had five picks to work with because of trades that landed him Marshon Lattimore, Laremy Tunsil and Deebo Samuel. Peters made every pick count, but he failed to address the Commanders' largest void: edge rusher.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "GM Ryan Poles' first two days of the draft were impressive, but the Bears went ice cold on Saturday until their final selection of Monangai, one of my favorite running backs in this class.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "GM Brad Holmes, who has been on a heater recently, included two 2026 third-round picks in a deal to move up and select TeSlaa, a significant reach with the 70th overall pick. The rest of the group is textbook though.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Packers finally ended their 23-year streak of not drafting a wide receiver in the first round with Golden, but then also added Williams in the third. That makes for a pretty crowded receiver room in Green Bay. GM Brian Gutekunst should have addressed cornerback earlier than the seventh round with Jaire Alexander on the trade block and the depth chart thin as is.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "GM Kwesi Adofo-Mensah began with only four picks, but added an immediate impact player in Jackson, a talented receiver (Felton) to take the pressure off Justin Jefferson and Jordan Addison, and a solid priority free agent haul.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Peer pressure works! The Falcons finally addressed their pass rush deficiency by drafting two of the top 3 edge rushers in this class. The only downside is GM Terry Fontenot had to deal their 2026 first-rounder to do it.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "It'll be interesting how we judge GM Dan Morgan passing on Jalon Walker or Mykel Williams for McMillan five years from now.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I love the Banks, Stutsman and Neal picks, and I understand why the Saints selected Shough in the second round, but I still believe that's way too early. Plus, I wish GM Mickey Loomis would've double-dipped at cornerback and also added a receiver.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "While I like Egbuka, I'm still perplexed on how the Bucs could pass on Jihaad Campbell there. GM Jason Licht answered questions in the secondary and added talent on the edge, but they're still lacking an heir apparent for Lavonte David at linebacker. They also needed to add a tackle in this draft, since Luke Goedeke, their starter on the right side, is a free agent after next season.",
    "sourceName": "San Diego Union Tribune",
    "sourceUrl": "https://www.sandiegouniontribune.com/2025/04/28/2025-nfl-draft-grades-for-all-32-teams-patriots-raiders-among-big-winners/",
    "playerGrades": []
  },
  {
    "teamName": "Arizona Cardinals",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "It's difficult to give a team a bad grade when they might have landed one of the biggest draft steals of the last 10 years. If Will Johnson's injury concerns were overblown in the pre-draft process then the Cardinals got a Top 10 talent in the second round at cornerback. We really liked the defensive focus of this draft, and the gamble with Walter Nolen is fascinating by a normally risk-averse franchise. He loves to compare himself to Aaron Donald, and if that's halfway true it's going to be an amazing pick.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Atlanta Falcons",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "Yes, the Falcons filled their needs — but at what cost? Getting Jalon Walker at No. 15 was astounding value, but throwing away their 2026 first round pick to get James Pearce at 26th was not. Atlanta is talking a big game about the Tennessee pass rusher, saying they were considering taking him at 15. I'm not sure what planet that makes sense on, but if both of these two pass rushers struggle then this is a draft that will set the team back years.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Baltimore Ravens",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Love the football side of this. Hate giving Baltimore props for taking Mike Green. Yes, the team got two first round talents with their first two picks — but it was only because the Ravens were willing to take a guy with Green's off-field history of sexual assault allegations on two separate occasions. They can justify it however they want, but it doesn't make it easier to swallow.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Buffalo Bills",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I understand that a lot of Bills fans are underwhelmed by the lack of receiving help in this draft class, but I actually think the Bills did a pretty good job with their class. Tripling down on cornerback after their depth got ravaged last season by injury is a good thing, and I think top pick Maxwell Hairston plays with the vision and playmaking in off coverage that fits this defense. Sanders might've been a bit of a stretch at 41, but he and Landon Jackson are similar to body types that they love to bring in. I'm still worried about their ability to stop the run through the spine of their defense, but overall I think they did a fine job. Chase Lundt could be a steal.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Carolina Panthers",
    "year": 2025,
    "grade": "A+",
    "gradeNumeric": 4.3,
    "text": "Dan Morgan took over as GM just before the combine in 2024 without a chance to really evaluate the roster, so this was more or less his first real draft leading the team — and he knocked it out of the park. The decision to take Tetairoa McMillan with the No. 8 pick seemed questionable with Jalon Walker on the board, but the Panthers liked the EDGE depth in this class and had their patience rewarded. There's a very real chance Carolina could have gotten 4-5 starters out of this class — which is the best example of using the board effectively.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Chicago Bears",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Ben Johnson has a vision and it's a hell of a vision. This draft was a compete understanding that the Bears are nothing without making sure Caleb Williams succeeds. Loveland and Burden III are big-time weapons that take pressure off D.J. Moore while still ensuring there are four good targets on the field at any time. Ozzy Trapilo was an underrated pick, and Shemar Turner was a very solid pick up in the trenches. Just great work.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Cincinnati Bengals",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "The Bengals had a weird draft. I love the Shemar Stewart selection--look beyond the stat sheet and you'll see an impactful player who is on the cusp of being great. After that, I think they had a few reaches. I'm a Demetrius Knight fan, but in the second round feels rich. Then taking Dylan Fairchild, who I wasn't a fan of, in the third round is a wild one. I think Carter could be fun, Jalen Rivers could play more than Fairchild, and Tahj Brooks is a great pick in Round 6. But, this class worries me a bit.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Cleveland Browns",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "This draft has to be evaluated with the understanding the team also added a first round pick in 2026 via the trade with Jacksonville. The Graham and Schwesinger picks were great, but I have extreme questions about any organization that would be more hyped about Dillon Gabriel in the 3rd round than Shedeur Sanders in the 5th. The Browns had a lot of needs all over the roster, so it's a little weird to take two running backs and two quarterbacks with the picks they had.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Dallas Cowboys",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Nobody had a better Day 2 than Dallas. As much as the Tyler Booker pick was iffy, getting both Ezeiruaku AND Revel Jr. was a massive coup. Both were first round talents, and the Cowboys just kept finding value throughout the draft. This is a class where it might not made the team better right now, but it really sets them up for the future.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Denver Broncos",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "It's tough to find too many faults with this class. Everyone predicted the Broncos would go RB in Round 1, which would have been fine — but instead they worked the board well and got Jahrae Barron, who will be a force when paired with Patrick Surtain II. RJ Harvey might have been a touch of an overdraft on most boards, but I really like him in a Sean Payton offense. A really solid three days of work.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Detroit Lions",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "An extremely Dan Campbell draft — and that's a good thing. We know the coach has a type, and the team absolutely stuck to that with hard-nosed, no-nonsense players. Williams and Ratledge are great line anchors who will open up things for Detroit's established players. From there it's all depth and gravy. Isaac TeSlaa is sneaky good in this offense, and could play a role sooner than later.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Green Bay Packers",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Not too sure about this one. I know Packers fans are overjoyed to finally see a receiver in Round 1, but another Z guy is a bit of a weird choice. They then followed it with Anthony Belton, who has some nice traits — but was taken at least a round or two early. This could very well work out, but it's a little head-scratching right now as we sit here after the draft.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Houston Texans",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The first round pick coming from the Falcons trade is doing a lot of heavy lifting here. It's not that the picks are bad, in fact the Iowa State 1-2 handcuff could actually be fantastic. The issue is that the Texans didn't have the luxury to hold back as much as they did on the offensive line. Ersery is a solid addition, but it needed to be followed with about four more offensive line additions. Instead the team is getting more weapons for C.J. Stroud without the protection to go along with it. Ask Cincinnati how that works.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Indianapolis Colts",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Getting Tyler Warren at No. 14 without needing to make any trades is what defines this draft. for the Colts. Warren was the perfect tight end for this team and he'll immediately make an impact. The only really questionable pick for me is taking Riley Leonard in the 6th. Getting a Notre Dame QB, in Indiana — it's just going to put even more unfair pressure on Anthony Richardson to perform with a bigger potential fans turn on him. I don't know if Richardson will pan out, but this feels like a move designed to start a QB controversy.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Jacksonville Jaguars",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "Look man, any time you trade up for the single most impactful and best player in this draft class, you're going to get passing marks. I understand that the trade package was a lot, but I would do it every time for a player of Travis Hunter's ability. He has the potential to be a franchise-altering player. Beyond that, the Jaguars did a good job of filling out needs. Caleb Ransaw can play multiple positions in the secondary, and Wyatt Milum will step in and push Ezra Cleveland for the starting LG spot. I'm a big fan of Bhayshul Tuten in the 4th round, as well. Instant home run ability in the run and passing game. This could be a very good class for the Jags.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Kansas City Chiefs",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The Chiefs keep doing this, they can't keep getting away with it! I thought they'd have to trade up for LT Josh Simmons, but instead they traded back and still added Simmons. Their Day 2 picks all could challenge for starting time, including DT Omarr Norman-Lott and CB Nohl Williams. Norman-Lott's lateral quickness and burst as a pass rusher is a great complement to the heavy hands and power of EDGE Ashton Gillotte, and Williams is a feisty corner who led the NCAA with seven interceptions in 2024. On day 3, Jalen Royals and Brashard Smith bring speed to an offense that needs it as well. Another outstanding draft for the Chiefs.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Las Vegas Raiders",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "If you want to change a culture through one draft, the Raiders' class could certainly get it done. Adding Boise State RB Ashton Jeanty and TCU WR Jack Bech is such a cool 1-2 punch in the early rounds; Vegas is going to be extremely hard to tackle. Then adding high upside players like Caleb Rogers and Charles Grant who could both end up being high quality starters for them down the line is really good. Their Day 3 intrigues as well; they added speed (Dont'e Thornton Jr.), versatility (JJ Pegues, Tommy Mellott) and their backup QB who can do some work with his legs. I've been a big fan of everything the Raiders have done this offseason, and the draft is no different.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Chargers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "The Chargers know their identity, and through this draft they continue to solidify it. Omarion Hampton in the first round is a solid pick. He's the best RB fit for the Chargers' gap scheme run game and gives them a major jolt of energy in that room. Tre Harris and KeAndre Lambert-Smith give them more speed and capability on the outside, Harris is going to complement Ladd McConkey really well. However, Jamaree Caldwell might be my favorite pick of theirs. He's a powerful run defender who has a bit of pass rush upside, but won't be needed in that department at first. He's the perfect Poona Ford replacement. Big fan of this draft class.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Los Angeles Rams",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Rams were linked to all sorts of wild scenarios with quarterbacks in training and big-time trades, but in the end they had a really safe draft without much remarkable at all. Terrance Ferguson is a solid TE addition, but doesn't add much as a blocker. This team had enough receiving weapons. Jarquez Hunter is my favorite pick, and I think he was solid value for Los Angeles. Overall this was just a fine class.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Miami Dolphins",
    "year": 2025,
    "grade": "B-",
    "gradeNumeric": 2.7,
    "text": "The Miami Dolphins heard the rumors. They heard the \"cold rainy night in Stoke\" allegations, and people telling them they can't win physical games. Drafting DTs Kenneth Grant, Jordan Phillips and Zeek Biggers is a good way of getting more physical up front. All three guys are good run defenders, who will open up lanes for their speedy pass rushers. On the offensive side of the ball, Jonah Savaiinaea gives them some nasty at guard, a physicality the team has lacked for the entirety of the Mike McDaniel tenure. Would've liked to see them double dip at corner given the uncertainty of the Jalen Ramsey situation, but overall it's a solid class.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Minnesota Vikings",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "I see the vision taking Donovan Jackson with the 24th pick. It's after that things went a little off the rails. Tai Felton was an extremely bizarre pick for a team with Justin Jefferson, Jordan Addision, and Jalen Nailor. Felton is essentially a straight line burner, and sure there's value taking the top off the defense while also getting a kick returner, but where was the DB help this franchise needed? With so few picks there was little room for luxuries and the team took too many luxury players.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "New England Patriots",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "The main assignment for Eliot Wolf? Help Drake Maye. New England did just that, adding Will Campbell at No. 4 — who said he would \"fight and die\" to protect his new QB — TreVeyone Henderson at No. 38, who can help in both the run game and in pass protection, and a potentially-elite separator with Kyle Williams at No. 69. Factor in some additional pieces along the offensive line, including Jared Wilson who could be the starting center in Week 1, and you have a fantastic draft for the Patriots.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "New Orleans Saints",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "This was the closest to throwing darts at a board without drafting Jaxson Dart. If there's a vision in New Orleans I don't see it. Kelvin Banks Jr. was a massive overdraft for a guy who might not be able to make it as an NFL offensive tackle. There's a real chance he'll need to be kicked inside, in which case the Saints would have been better taking a guard. Tyler Shough as the third QB off the board is a choice. He's old, he's been hurt — and it felt like the Saints just took a caretaker QB with a 2nd round pick when they needed so much more.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "New York Giants",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "Truly think this class would get better grades--had they not made the one pick that everyone questioned. QB Jaxson Dart has the belief of the franchise, but trading up into round 1 for him is a stretch for me. Outside of that, the Giants' class is really good. Marcus Mbow in Day 3 is a steal, he has positional versatility and could start for them. Skattebo is a great complement to Tyrone Tracy Jr and the duo of Abdul Carter and Darius Alexander is an awesome pairing on pass rush downs. I'm still left with questions about their pass rush rotation given that they picked up the fifth-year option on Kayvon Thibodeaux, but this class has some potential.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "New York Jets",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "I'm a big fan of what the Jets did in this draft. Instead of drafting tight end early, they took Armand Membou, who won't even have to move from right to left tackle like many projected him to. Mason Taylor is going to be a fun receiver in their offense, and the secondary duo of Azareye'h Thomas and Malachi Moore are such fitting Aaron Glenn picks. I would've loved to see them add a different style of receiver or double dip there, but overall a solid class by the Jets.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Philadelphia Eagles",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "This wasn't quite the Philadelphia masterclass we've seen in the past, but it was still a darn solid draft. Jihaad Campbell was incredible value in at pick 31, but things tapered off from there. The positive note is with so many picks the Eagles have set themselves up to hit on a few of these guys — so that's a good position to be in.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Pittsburgh Steelers",
    "year": 2025,
    "grade": "C+",
    "gradeNumeric": 2.3,
    "text": "Derrick Harmon makes a ton of sense. It was reported early and often the Steelers were obsessed, and it's understandable why they wanted him to anchor the middle. The obvious question is why the hell this team didn't take Shedeur Sanders at some point. I get if teams were turned off because he might have come off as cocky, but it feels bizarre for Pittsburgh to die on that hill in the draft, while also courting Aaron Rodgers — one of the cockiest, most self-absorbed QBs in NFL history. Will Howard ain't it, and the Steelers left a lot to be desired with their mid-rounders.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "San Francisco 49ers",
    "year": 2025,
    "grade": "A-",
    "gradeNumeric": 3.7,
    "text": "The 49ers saw their run defense get blasted off the face of the earth in 2024 and said, \"never again\". This is an awesome class to help reform the identity of the Niners' defense. Starting with Mykel Williams and Alfred Collins, two bonafide stars against the run, with Williams offering high upside. Then adding CJ West to that, one of my favorite players in this class, to help stop the run is incredibly smart business. Upton Stout is a feisty nickel defender who fits the Niners like a glove, and Connor Colby could push for starting time. Love this class.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Seattle Seahawks",
    "year": 2025,
    "grade": "A",
    "gradeNumeric": 4,
    "text": "Absolutely love this draft from Seattle. The Grey Zabel pick in the first was definitely iffy, but if you swap Zabel and Emmanwori's positions it feels much better. Two really solid opening picks, while also getting Elijah Arroyo who is uber-productive, as well as basically stealing Jalen Milroe in the third. Love this class overall.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Tampa Bay Buccaneers",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "Doubling-down on a strength is often good business in the NFL, and that is exactly what the Buccaneers did in the first round. After re-signing Chris Godwin in free agency Jason Licht added Ohio State WR Emeka Egbuka, who slides in as perhaps the perfect slot receiver inside of Godwin and Mike Evans. Then Licht addressed some need picks with a pair of cornerbacks in Benjamin Morrison and Jacob Parrish, and then some potential options on the edges with David Walker and Elijah Roberts. Tez Johnson may be undersized, and best positioned to contribute early on designed plays for him, but he'll see opportunities given the rest of the WR room.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Tennessee Titans",
    "year": 2025,
    "grade": "B+",
    "gradeNumeric": 3.3,
    "text": "They got their quarterback. We can litigate the decision to preach the need for a \"game changing\" player, then take a QB over the truly game-changing players in this class — but the team needed a passer too badly. I love the Oladejo pick in the second round, and Kevin Winston Jr. was great value in the third. Would have liked to see more line help, but this was a decent class.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  },
  {
    "teamName": "Washington Commanders",
    "year": 2025,
    "grade": "B",
    "gradeNumeric": 3,
    "text": "The Commanders didn't have a lot of picks to play with this draft, but did a decent job all things considered. Conerly Jr. might project to playing interior over time, but pick 29 was decent value. Amos' length as a press corner will give the defense more punch as well, and Jaylin Lane is a good slot option to accompany Terry McLaurin. Nothing eye popping, but everything was solid here.",
    "sourceName": "SBNation",
    "sourceUrl": "https://www.sbnation.com/nfl/2025/4/28/24419371/nfl-draft-grades-teams-final-full-class-best-drafts-panthers",
    "playerGrades": []
  }
]